{
  "CommonServicesSection": {
    "Cadres": [
      {
        "Cadre": "Cleaner",
        "Grades": [
          {
            "Cleaner Grade Level 01": {
              "Duties": ["Cleaning Offices, closets and office premises"],
              "EntryRequirements": [
                "By direct appointment of an able-bodied candidate"
              ],
              "AdvancementPath": "Promotion to Senior Cleaner "
            }
          },

          {
            "Senior Cleaner Grade Level 02": {
              "Duties": ["Performing General Cleaning Duties"],
              "EntryRequirements": [
                "By promotion of a suitable cleaner who has spent at least two years onthe grade."
              ],
              "AdvancementPath": "Promotion to Head Cleaner "
            }
          },
          {
            "Head Cleaner Grade Level 03": {
              "Duties": [
                "Performing Cleaning Duties",
                "Supervising a number of cleaners"
              ],
              "EntryRequirements": [
                "By promotion of a suitable Senior Cleaner who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Watchman",
        "Grades": [
          {
            "Watchman Grade II Grade Level 01": {
              "Duties": [
                "Watching Office buildings and Government properties",
                "Opening and locking gates of a Government Institution."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate who is mentally and physically fit and possesses the ability to read and write."
              ],
              "AdvancementPath": "Promotion to Watchman Grade I"
            }
          },
          {
            "Watchman Grade I Grade Level 02": {
              "Duties": [
                "Watching Office buildings and Government properties",
                "Opening and locking gates of a Government Institution."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Watchman Grade Ii who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Senior Watchman "
            }
          },
          {
            "Senior Watchman, Grade Level 03": {
              "Duties": [
                "Supervising the activities of a number of Watchman",
                "Watching Office buildings and Government properties"
              ],
              "EntryRequirements": [
                "By promotion of a Watchman who has spent at least two years on the grade"
              ],
              "AdvancementPath": "Promotion to Head Watchman"
            }
          },
          {
            "Head Watchman, Grade Level 04": {
              "Duties": [
                "Co-ordinating the activities of a number of Watchmen",
                "Watching Office buildings and Government properties"
              ],
              "EntryRequirements": [
                "By promotion of Senior Watchman who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          },
          {
            "Head Watchman, Grade Level 04": {
              "Duties": [
                "Co-ordinating the activities of a number of Watchmen",
                "Watching Office buildings and Government properties"
              ],
              "EntryRequirements": [
                "By promotion of Senior Watchman who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Security Guard",
        "Grades": [
          {
            "Security Guard Grade II Grade Level 03": {
              "Duties": [
                "Keeping records of movement of persons and vehicles",
                "Searching vehicles and suspected visitors or employees"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School Leaving Certificate plus evidence of training in either the Nigerian Police or any of the disciplined services."
              ],
              "AdvancementPath": "Promotion to Security Guard Grade I"
            }
          },
          {
            "Security Guard Grade I Grade Level 04": {
              "Duties": [
                "Keeping records of movement of persons and vehicles",
                "Searching vehicles and suspected visitors or employees"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Security Guard Grade II who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Senior Security Guard"
            }
          },
          {
            "Senior Security Guard Grade Level 05": {
              "Duties": [
                "Keeping records and searching suspected vehicles and employees",
                "Overseeing the activities of a number of Security Guards"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Security Guard, Grade II who has spent at least two years on the grade"
              ],
              "AdvancementPath": "Promotion to Head Security Guard"
            }
          },
          {
            "Head Security Guard Grade Level 06": {
              "Duties": [
                "Advising on security matters",
                "Co-ordinating the activities of a number of Security Guards"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Security Guard who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Messenger",
        "Grades": [
          {
            "Messenger Grade Level 02": {
              "Duties": [
                "Moving files from officers’ tables",
                "Carrying and delivering letters, articles and message"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School Leaving Certificate.",
                "By promotion from a lower post, of any suitable officer possessing the First School Leaving Certificate."
              ],
              "AdvancementPath": "Promotion to Senior Messenger"
            }
          },
          {
            "Senior Messenger Grade Level 03": {
              "Duties": [
                "Carrying Security boxes",
                "Directing visitors",
                "Assisting a Head Messenger in supervising a number of Messengers"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Messenger who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Head Messenger"
            }
          },
          {
            "Head Messenger Grade Level 04": {
              "Duties": [
                "Supervising Junior Messengers, and checking attendance registers.",
                "Carrying mails to and from the Post Office."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Senior Messenger who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Porter",
        "Grades": [
          {
            "Porter Grade Level 03": {
              "Duties": [
                "Taking charge of entrances to public buildings and controlling the entry of visitors to offices.",
                "Serving as ushers and guides to visitors to public buildings",
                "Controlling the entry of visitors into public buildings and other official meeting places."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing Junior Secondary School Certificate or S.75."
              ],
              "AdvancementPath": "Promotion to Senior Porter"
            }
          },
          {
            "Senior Porter Grade Level 04": {
              "Duties": [
                "Supervising a number of porters in a public building",
                "Preparing duty rosters for vetting by the Head Porter",
                "Performing the duty of a porter when the latter is unavailable",
                "Requisitioning stationery items for porters",
                "Ensuring security of Government inner properties i.e. Typewriters, Fans etc."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Porter who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Head Porter"
            }
          },
          {
            "Head Porter Grade Level 05": {
              "Duties": [
                "Deploying porters",
                "Completing APER forms for porters",
                "Completing Indemnity Forms for porters’ salaries before First and Second payments",
                "Safe-keeping of lost and found items before handing them over to Security Guards or the Police after a specified period",
                "Reporting cases of missing items for example, door any vehicle keys, etc."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Senior Porter who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Radio/Telephone Operator",
        "Grades": [
          {
            "Radio/Telephone Operator Grade Level 03": {
              "Duties": [
                "Operating a Telephone PBX under-supervision.",
                "Ensuring that the switchboard under his control is efficiently maintained.",
                "Collecting revenue for private calls."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate Possessing at least the First SchoolLeaving Certificate plus evidence of framing in telephone operation duties."
              ],
              "AdvancementPath": "Promotion to Senior Radio/Telephone Operator"
            }
          },
          {
            "Senior Radio/Telephone Operator Grade Level 04": {
              "Duties": [
                "Supervising a number of Ratio/Telephone Operators",
                "Rendering accounts of the revenue collected for private calls.",
                "Keeping such records as are required in the operation of a Telephone PBX."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed suitable Radio/Telephone Opera who has spent at least two years on the grade",
                "By direct appointment of a candidate possessing the First School Leaving Certificate with a minimum of two years post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Radio/Telephone Supervisor"
            }
          },
          {
            "Radio/Telephone Supervisor Grade Level 05": {
              "Duties": [
                "Taking charge of a Telephone Exchange",
                "Supervising a number of Telephone Operators/Senior Radio Operators."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Radio/Telephone Operator who has spent at least two years on the grade",
                "By direct appointment of a candidate possessing the First School Leaving Certificate with a minimum of four years post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Senior Radio/Telephone Supervisor"
            }
          },

          {
            "Senior Radio/Telephone Supervisor Grade Level 06": {
              "Duties": [
                "Assisting in supervising telephone staff in a defined area.",
                "Assisting in the training of telephone operators."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed suitable Radio/Telephone Supervisor who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Radio/Telephone Supervisor"
            }
          },

          {
            "Chief Radio/Telephone Supervisor Grade Level 07": {
              "Duties": [
                "Supervising telephone is a defined area",
                "Advising the authority on the 5ining and posting of telephone operators."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Senior Radio/Telephone supervisor who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Tailor",
        "Grades": [
          {
            "Assistant Tailor Grade Level 03": {
              "Duties": [
                "Sewing simple dresses",
                "Mending clothes",
                "Cleaning sewing machines"
              ],
              "EntryRequirements": [
                "By appointment of a candidate possessing a minimum of First School Leaving Certificate plus a pass in the Federal Ministry of labour Trade Test Class III in Tailoring or a Certificate from a reputable Tailoring Firm."
              ],
              "AdvancementPath": "Promotion to Tailor"
            }
          },

          {
            "Tailor Grade Level 04": {
              "Duties": [
                "Sewing all types of dresses.",
                "Cutting simple dresses.",
                "Making minor repairs of sewing machines."
              ],
              "EntryRequirements": [
                "By advancement of a confirmed and suitable Assistant Tailor who has passed Government Trade Test Class II and spent at least two years on the grade.",
                "By direct appointment of a candidate possessing at least First School Leaving Certificate plus Government Trade Test Class II in Tailoring and a minimum of two years’ experience in the trade.",
                "By direct appointment of a candidate possessing the Government Craft Certificate obtained from a Government Trade Center or any approved Institution."
              ],
              "AdvancementPath": "Promotion to Senior Tailor Grade II"
            }
          },
          {
            "Senior Tailor Grade II Grade Level 05": {
              "Duties": [
                "Supervising the work of a number of junior staff.",
                "Taking charge of a small Tailoring Unit.",
                "Cutting and sewing dresses into differentpatterns.",
                "Undertaking repairs of sewing machines."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Tailor who has demonstrated competent performance, passed Government Trade Test Class I and spent at least two years on the grade.",
                "By direct appointment of a candidate possessing at least First School Leaving Certificate plus Government Trade Test Class I and at least four years’ experience in the trade."
              ],
              "AdvancementPath": "Promotion to Senior Tailor Grade I"
            }
          },
          {
            "Senior Tailor Grade I Grade Level 06": {
              "Duties": [
                "Taking charge of a large Tailoring Unit",
                "Cutting and sewing dresses of complex pattern",
                "Assisting in organizing for the repair of unserviceable machines"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Tailor Grade 11 who has spentat least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Tailor"
            }
          },
          {
            "Chief Tailor Grade Level 07": {
              "Duties": [
                "Keeping disposition list of the tailoring staff and sewing machines in the establishment e.g. State Hospitals.",
                "Coordinating activities in a number of Tailoring Units",
                "Advising the authority on matters relating to tailoring",
                "Organizing training programmes for Tailors"
              ],
              "EntryRequirements": [
                "Bypromotion of a suitable Senior Tailor Grade I who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Motor Driver/Driver Mechanic",
        "Grades": [
          {
            "Motor-Driver Grade Level 02": {
              "Duties": [
                "Driving with care and caution a motor vehicle (not more than 20 tons) assigned to him.",
                "Assisting in keeping accurate and up-to-date log book.",
                "Understanding and ensuring the correct tyre pressures, the weight and the load carrying capacity of vehicles."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School Leaving Certificate plus a valid Class “C” Driving Licence."
              ],
              "AdvancementPath": "Promotion to Heavy Lorry Driver"
            }
          },
          {
            "Heavy Lorry Driver Grade Level 03": {
              "Duties": [
                "Driving with care and Caution any heavy vehicle (10 tons - 25 tons) assigned to him",
                "Keeping an accurate and up-to-date log book of the movement of vehicle"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Motor Driver who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing the First School Leaving Certificate plus a valid Class “C” Driving Licence. plus at least two years’ satisfactory post-qualification driving experience."
              ],
              "AdvancementPath": "Promotion to Motor Driver-Mechanic"
            }
          },
          {
            "Motor Driver-Mechanic Grade Level 04": {
              "Duties": [
                "Driving with care and caution any Vehicle assigned to him.",
                "Undertaking minor maintenance and repairs of motor vehicles"
              ],
              "EntryRequirements": [
                "By advancement of a suitable Motor Driver who has passed the Class III Trade Test for Motor Mechanic Work.",
                "By direct appointment of a suitable and experienced candidate possessing the Class UI Trade Test Certificate for Motor Mechanic Work plus First SchoolLeaving Certificate and professional Driver’s Licence."
              ],
              "AdvancementPath": "Promotion to Senior Motor Driver-Mechanic Grade II"
            }
          },
          {
            "Senior Motor Driver-Mechanic Grade II Grade Level 05": {
              "Duties": [
                "Driving with care and caution any vehicle assigned to him.",
                "Maintaining records of fuel and lubrication consumption by vehicles.",
                "Working out vehicle performance figures and applying knowledge of indentingPurchase procedures"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Motor Driver Mechanic who has spentat least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Senior Motor Driver-Mechanic Grade I"
            }
          },
          {
            "Senior Motor Driver-Mechanic Grade I Grade Level 06": {
              "Duties": [
                "Driving with care and caution any Vehicle signed to him.",
                "Assisting in thesupervision and disposition of the staff and vehicles in the transport unit.",
                "Assisting chief Motor Driver Mechanic in ensuring the security of vehicles in the establishment"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Motor Driver Mechanic Grade II who has spent at least twoyears on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Motor Driver-Mechanic"
            }
          },

          {
            "Chief Motor Driver-Mechanic Grade Level 07": {
              "Duties": [
                "Driving with care and caution any vehicle assigned to him",
                "Ensuring the security of vehicles.",
                "Taking prompt action o accident cases",
                "Supervising Motor Driver Mechanics and Senior Motor Driver Mechanics"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Motor Driver Mechanic Grade I who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Stores Attendant",
        "Grades": [
          {
            "Stores Attendant Grade Level 02": {
              "Duties": [
                "Performing under supervision, routine and manual stores work"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School Leaving Certificate."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Store Keeper",
        "Grades": [
          {
            "Stores Assistant Grade Level 03": {
              "Duties": [
                "Assisting in a Departmental/Zonal Store",
                "Keeping simple stores records under supervision"
              ],
              "EntryRequirements": [
                "By direct appointment of candidate possessing any of the following qualifications Evidence of completion of a full course in a Government approved Secondary School Royal Society of Arts School Commercial CertificateJunior Secondary School Certificate"
              ],
              "AdvancementPath": "Promotion to Storekeeper"
            }
          },
          {
            "Storekeeper Grade Level 04": {
              "Duties": [
                "Taking charge, under supervision of a site or small store",
                "Making local purchase of small items of stores approved by the appropriate authority."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Storekeeper who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications:-West African School Certificate or Senior Secondary Schools Certificate General Certificate of Education (O/L) in four subjects obtained at one sitting or five subject at two sittings"
              ],
              "AdvancementPath": "Promotion to Senior Storekeeper"
            }
          },
          {
            "Senior Storekeeper Grade Level 05": {
              "Duties": [
                "Taking charge, under supervision of a site or small store",
                "Making local purchase of small items of stores approved by the appropriate authority."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Storekeeper who has spent at least two years on the grade and passed Storekeepers Confirmation/Promotion Test at promotion level (i.e. 50%)",
                "By direct appointment of a candidate possessing any of the following qualifications:- West African School Certificate or Senior Secondary Schools Certificate General Certificate of Education (O/L) in four subjects obtained at one sitting or five subject at two sittings plus at least two years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Storekeeper"
            }
          },
          {
            "Assistant Chief Storekeeper Grade Level 06": {
              "Duties": [
                "Taking charge of a large store",
                "Supervising a number of small stores within a Department",
                "Assisting in training junior staff",
                "Making local purchase of approved materials and equipment"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Storekeeper who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Storekeeper"
            }
          },
          {
            "Chief Storekeeper Grade Level 07": {
              "Duties": [
                "Supervising a very big store",
                "Making local purchase of approved materials and equipment",
                "Supervising and training junior staff within the Unit",
                "Checking stock in stores in a large Department"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Chief Storekeeper who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Stores Officer",
        "Grades": [
          {
            "Assistant Stores Officer Grade Level 06": {
              "Duties": [
                "Taking charge, under supervision, of a Departmental or Specialized Store",
                "Checking stores and reviewing stock positions in a big store or a number ofsmall Stores",
                "Planning store bins."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate Possessing any of the following qualifications. General Certificate of Education (A/L) in two subjects obtained at one Sitting or three subjects obtained at two sittings. Ordinary National Diploma in Business Studies. Intermediate Certificate of the Institute of Purchasing and Supply, London"
              ],
              "AdvancementPath": "Promotion to Stores Officer  "
            }
          },
          {
            "Stores Officer Grade Level 07": {
              "Duties": [
                "Taking charge of materials and equipment in a Departmental or Technical Store.",
                "Training junior Officers in his Unit",
                "Checking stocks of allocated and unallocated stores."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed aid suitable Assist Stores Officer who has spent at least two years on the grade",
                "By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies. Membership of the institute of Purchasing and Supply, London. Intermdiate Certificate of’ the Nigerian institute of CharteredAccountants or Intermediate Certificate of the 1nstitute of Costs andManagement Accountants",
                "By direct appointment of a candidate Possessing any of the following qualifications. General Certificate of Education (A/L) in two subjects obtained at one Sitting or three subjects obtained at two sittings. Ordinary National Diploma in Business Studies. Intermediate Certificate of the Institute of Purchasing and Supply, London Intermediate Certificate of’ the Nigerian institute of CharteredAccountants or Intermediate Certificate of the 1nstitute of Costs andManagement Accountants ",
                "By direct appointment of a candidate Possessing any of the following qualifications. General Certificate of Education (A/L) in two subjects obtained at one Sitting or three subjects obtained at two sittings. Ordinary National Diploma in Business Studies. Intermediate Certificate of the Institute of Purchasing and Supply, London  plus at least two years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Higher Stores Officer  "
            }
          },

          {
            "Higher Stores Officer Grade Level 08": {
              "Duties": [
                "Taking charge of a Central Store.",
                "Allocating Stores to Ministries/Departments or Stores Units.",
                "Rendering reports to appropriate authorities in respect of sub-stores and stores Units within the jurisdiction."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Stores Officer who has spent at leastthree years on the grade.",
                "By direct appointment of a candidate Possessing any of the following qualifications. General Certificate of Education (A/L) in two subjects obtained at one Sitting or three subjects obtained at two sittings. Ordinary National Diploma in Business Studies. Intermediate Certificate of the Institute of Purchasing and Supply, London. plus at least five years’ post- qualificationcognate experience or By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies. Membership of the institute of Purchasing and Supply, London. Intermediate Certificate of’ the Nigerian institute of CharteredAccountants or Intermediate Certificate of the 1nstitute of Costs andManagement Accountants plus at least three years’post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Senior Stores Officer  "
            }
          },
          {
            "Senior Stores Officer Grade Level 09": {
              "Duties": [
                "Taking charge of a large Central Store.",
                "Disposing boarded and unwanted vehicles, equipment and other goods.",
                "Preparing insuranceclaims.",
                "Assisting in rendering quarterly/annual reports in respect of stores services."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Higher Stores Officer who has spent at least three years ort the grade",
                "By direct appointment of a candidate Possessing any of the following qualifications. General Certificate of Education (A/L) in two subjects obtained at one Sitting or three subjects obtained at two sittings. Ordinary National Diploma in Business Studies. Intermediate Certificate of the Institute of Purchasing and Supply, London. plus at least eight years’ post- qualificationcognate experience or By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies. Membership of the institute of Purchasing and Supply, London. Intermediate Certificate of’ the Nigerian institute of CharteredAccountants or Intermediate Certificate of the 1nstitute of Costs andManagement Accountants plus at least six years’post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Stores Officer Grade II  "
            }
          },

          {
            "Principal Stores Officer Grade II Grade Level 10": {
              "Duties": [
                "Taking charge of a large Central Store.",
                "Disposing boarded and unwanted vehicles, equipment and other goods.",
                "Preparing insuranceclaims.",
                "Assisting in rendering quarterly/annual reports in respect of stores services."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Higher Stores Officer who has spent at least three years ort the grade",
                "By direct appointment of a candidate Possessing any of the following qualifications. General Certificate of Education (A/L) in two subjects obtained at one Sitting or three subjects obtained at two sittings. Ordinary National Diploma in Business Studies. Intermediate Certificate of the Institute of Purchasing and Supply, London. plus at least eight years’ post- qualificationcognate experience or By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies. Membership of the institute of Purchasing and Supply, London. Intermediate Certificate of’ the Nigerian institute of CharteredAccountants or Intermediate Certificate of the 1nstitute of Costs andManagement Accountants plus at least six years’post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Stores Officer Grade I  "
            }
          },
          {
            "Principal Stores Officer Grade I Grade Level 12": {
              "Duties": [
                "Taking charge of a large Store Depot.",
                "Conducting periodic surveys and checking stores under jurisdiction.",
                "Keeping up-to-data prices of stores and materials."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Principal Stores Officer Grade II who has spent at least three years on the grade."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Stores Office"
            }
          },
          {
            "Assistant Chief Stores Officer Grade Level 13": {
              "Duties": [
                "Supervising Stores in a large Ministry/department.",
                "Undertaking shipping, freight and customs formalities.",
                "Assisting in organizing training programmes of Stores Staff",
                "Assisting in the administration of the Section."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Principal Stores Officer Grade I who has spent at least three years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Stores Office"
            }
          },

          {
            "Chief Stores Officer Grade Level 14": {
              "Duties": [
                "Taking charge of the Stores Section",
                "Preparingreports in respect of Government Stores.",
                "Assisting in the review of Stores Regulations."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Chief Stores Officer who has spent at least three years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Stock Verifier",
        "Grades": [
          {
            "Assistant Stock Verifier Grade Level 06": {
              "Duties": [
                "Responsible for 100% counting, weighing and measuring of stores.",
                "Reconciling Tally Cards with LedgerCards and tracing of payment vouchers.",
                "Responsible for comparing stores requisitions with relative Job Cards.",
                "Preparing Stock Verification Schedules, Stock Survey Forms, Stores Forms2and 9 Treasury Forms 146 and 147.",
                "Conducting stock surveys of stores procured through Local Purchase Orders or by Contracts."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing any of the following qualifications. Higher School Certificate or General Certificate of Education (Advanced Level), with passes in each case in three subjects at one sitting or our subjects at two sittings. Ordinary National Diploma in Business Studies Diploma or Intermediate Certificate of the Institute of Purchasing and Supply, London or equivalent qualification."
              ],
              "AdvancementPath": " Promotion to Stock Verifier"
            }
          },
          {
            "Stock Verifier Grade Level 07": {
              "Duties": [
                "Taking charge of teams of Examiners and Checkers responsible for a 100% counting, measuring and re-organization of Stores.",
                "Examining stores and stores accounts records and documents.",
                "Reconciling Tally Cards with Ledger Cards balances.",
                "Conducting stock survey of stores procured through Local Purchase Orders or by Contracts.",
                "Carrying out stock check of Plants, Vehicles and Equipment where-ever located, including verification of plant ledger.",
                "Compiling stock verification findings showing list of stores found surplus, deficient, obsolete and unserviceable."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Stock Verifier who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies Membership Certificate of the Institute of Purchasing and Supply, London.Higher School Certificate (Principal Level) or General Certificate of Education (Advance Level) with passes in each case in three subjects at a sitting or four subjects at two sittings plus two (2) years’ cognate experience in StockVerification or Stores duties."
              ],
              "AdvancementPath": " Promotion to Higher Stock Verifier"
            }
          },

          {
            "Higher Stock Verifier Grade Level 08": {
              "Duties": [
                "Conducting stock-taking in all sub-stores.",
                "Reconciling Tally Cards entries with Ledger Cards.",
                "Taking inventory in government offices and residential quarters.",
                "Maintaining records of unserviceable obsolete stores at condemned stores depot.",
                "Examining loans, registers and preparing lists of cut-standing loans.",
                "Rendering interim stock verification reports."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Stock Verifier who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications. Higher School Certificate or General Certificate of Education (Advanced Level), with passes in each case in three subjects at one sitting or our subjects at two sittings. Ordinary National Diploma in Business Studies Diploma or Intermediate Certificate of the Institute of Purchasing and Supply, London or equivalent qualification.  plus at least five years’ post-qualification cognate experience",
                "By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies Membership Certificate of the Institute of Purchasing and Supply, London. Higher School Certificate (Principal Level) or General Certificate of Education (Advance Level) with passes in each case in three subjects at a sitting or four subjects at two sittings. plus at least three years’ post-qualification cognate experience"
              ],
              "AdvancementPath": " Promotion to Senior Stock Verifier"
            }
          },
          {
            "Senior Stock Verifier Grade Level 09": {
              "Duties": [
                "Responsible for the stock verification of allocated and/or unallocated stores.",
                "Responsible for stock survey of stores procured through Local Purchase Orders and or Contracts.",
                "Responsible for the reconciliation of Tally Cards postings with Stores Ledger entries",
                "Responsible for the removal of stores found unserviceable and those whichappear to be surplus to requirements to the condemned Stores Deport for boarding and disposal processes",
                "Vetting and writing stock verification reports on stores checked."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Higher Stock Verifier who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications. Higher School Certificate or General Certificate of Education (Advanced Level), with passes in each case in three subjects at one sitting or our subjects at two sittings. Ordinary National Diploma in Business Studies Diploma or Intermediate Certificate of the Institute of Purchasing and Supply, London or equivalent qualification.  plus at least eight post-qualification cognate experience",
                "By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies Membership Certificate of the Institute of Purchasing and Supply, London. Higher School Certificate (Principal Level) or General Certificate of Education (Advance Level) with passes in each case in three subjects at a sitting or four subjects at two sittings. plus at least six years’ post-qualification cognate experience"
              ],
              "AdvancementPath": " Promotion to Principal Stock Verifier Grade II"
            }
          },
          {
            "Principal Stock Verifier Grade II Grade Level 10": {
              "Duties": [
                "Organizing stock verification of allocated and/or unallocated stores.",
                "Organizingreconciliation of Tally Cardsposting with ledger cards entries.",
                "Responsible for price analysis and taking charge of stock survey of the Federal Government Plants, Motor Vehicles and Equipment.",
                "Treating matters relating to Board of Survey and Enquiry.",
                "Training Stock Verification Personnel.",
                "Vetting report on store checked.",
                "Handling Stock Verification Half Yearly reports."
              ],
              "EntryRequirements": [
                "By promotion ofa confirmed and suitable Senior Stack Verifier who has spent at least three years in the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications. Higher School Certificate or General Certificate of Education (Advanced Level), with passes in each case in three subjects at one sitting or our subjects at two sittings. Ordinary National Diploma in Business Studies Diploma or Intermediate Certificate of the Institute of Purchasing and Supply, London or equivalent qualification.  plus at least eleven post-qualification cognate experience",
                "By direct appointment of a candidate possessing any of the following qualifications: Higher National Diploma in Business Studies Membership Certificate of the Institute of Purchasing and Supply, London. Higher School Certificate (Principal Level) or General Certificate of Education (Advance Level) with passes in each case in three subjects at a sitting or four subjects at two sittings. plus at least nine years’ post-qualification cognate experience"
              ],
              "AdvancementPath": " Promotion to Principal Stock Verifier Grade I"
            }
          },

          {
            "Principal Stock Verifier Grade I Grade Level 12": {
              "Duties": [
                "Verifying Tenders Documents, Contracts Agreements and Local Purchase orders for supply of stores.",
                "Checking and ensuring proper handling of Security Book.",
                "Writing, reviewing and submitting stock verification reports to the Accounting Officer, and treating outstanding queries related thereto.",
                "Examining the systems of internal check and handling stores coding and classification.",
                "Controlling and organizing the training of Stock Verification Personnel",
                "Coordinating the activities of the Divisional and/or Sectional Heads at the Headquarters or elsewhere.",
                "Prosecuting surcharge cases and related queries.",
                "Ensuring thin approved supply proceeds are complied with",
                "Developing and directing implementation of approved stores handling systems and stores, accounting and contract managements procedures."
              ],

              "EntryRequirements": [
                "By promotion of a confirmed and suitable Principal Stock Verifier Grade II who has spent at least three years on the grade."
              ],
              "AdvancementPath": " Promotion to Assistant Chief Stock Verifier"
            }
          },

          {
            "Assistant Chief Stock Verifier Grade Level 13": {
              "Duties": [
                "Assisting in general Stock Verification Administration",
                "Assisting in general Planning of stock verification activities",
                "Initiating stock verification programs",
                "Initiating stock record exercise.",
                "Recommending changes when deficiencies or abuse are deducted in the stores Systems. ",
                " Developing Manual of Instruction for guidance of Stock Verifiers."
              ],

              "EntryRequirements": [
                "By promotion of a confirmed and suitable. Principal Stock Verifier Grade I whohas spent at least three years on the grade."
              ],
              "AdvancementPath": " Promotion to Chief Stock Verifier"
            }
          },

          {
            "Chief Stock Verifier Grade Level 14": {
              "Duties": [
                "Responsible for general stock Verification Administration",
                "Responsible for planning stock verification activities. ",
                " Coordinating the activities of Stock Verification Units under his Section."
              ],

              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Chief Stock Verifier who has spent at least four years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Typist",
        "Grades": [
          {
            "Typist Grade IIII Grade Level 03": {
              "Duties": [
                "Typist manuscripts and other materials that may be assigned.",
                "Filing typed scripts/letters and making necessary cross reference.",
                "Cutting stencils scripts",

                "Cyclostyling stencils on duplicating machines."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School LeavingCertificate plus any of the following qualifications in typewriting at 25 wordsper minute: R.S.A. Certificate Certificate issued by any State owned Secretarial Institution."
              ],
              "AdvancementPath": "Promotion to Typist Grade III"
            }
          },

          {
            "Typist Grade III Grade Level 04": {
              "Duties": [
                "Performing general typing duties.",
                "Cyclostyling stencils on duplicating machines."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing a minimum of S.75 or J.S.S.C plus any of the recognized Certificates in Typewriting at 25 words per minute."
              ],
              "AdvancementPath": "Promotion to Typist Grade II"
            }
          },
          {
            "Typist Grade II Grade Level 05": {
              "Duties": [
                "Performing general typing duties.",
                "Cyclostyling stencils on duplicating machines."
              ],
              "EntryRequirements": [
                " By advancement of a Typist Grade III who acquires a recognized Certificate inTypewriting at a speed of 35 words per minute."
              ],
              "AdvancementPath": "Promotion to Typist Grade I"
            }
          },

          {
            "Typist Grade I Grade Level 06": {
              "Duties": [
                "Performing typing duties.",
                "Assisting in supervising junior staff."
              ],
              "EntryRequirements": [
                " By advancement of a Typist Grade U who has obtained a recognized Certificate in Typewriting at a speed of 50 words per minute.",
                "By direct appointment of a candidate possessing a minimum of First School Leaving Certificate plus a recognized Certificate in Typewriting at a speed of 50 words per minute."
              ],
              "AdvancementPath": "Promotion to Senior Typist Grade II"
            }
          },

          {
            "Senior Typist Grade II Grade Level 07": {
              "Duties": [
                "Performing typing duties.",
                "Assisting in keeping typing materials such as papers, stencils, etc."
              ],
              "EntryRequirements": [
                " Bypromotion of a confirmed and suitable ‘Typist Grade I who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Senior Typist Grade I"
            }
          },

          {
            "Senior Typist Grade I Grade Level 08": {
              "Duties": [
                "Performing typing duties.",
                "Supervising Junior Typists,",
                "Taking charge of a small Typing Pool."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Senior Typist Grade II who has spent at least three years on the grade"
              ],
              "AdvancementPath": "Promotion to Chief Typist"
            }
          },

          {
            "Chief Typist, Grade Level 09": {
              "Duties": [
                "Taking charge of a Typing Pool of not less than ten Typist",
                "Taking charge of duplicating machines In a Department.",
                "Coordinating the activities ofjunior staff"
              ],
              "EntryRequirements": [
                "By promotion of a suitable Senior Typist Grade I who has spent at least three years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Confidential Secretary",
        "Grades": [
          {
            "Confidential Secretary Grade IV Grade Level 05": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script.",
                "Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached.",
                "Performing office routines associated with the duties enumerated above."
              ],
              "EntryRequirements": [
                "By promotion of a staff in the Clerical or Typist grades who has successfully completed the ten months Confidential Secretary training course at the Federal Training Centre.",
                "By direct appointment of a candidate possessing any of the following qualifications: First School Leaving Certificate plus R.S. A. or Federal/State Training Centre Certificate in Typewriting and Shorthand at the speed of 35 and 80 words per minute respectively plus English Language at R.S.A. Stage II or Confidential Grade IV or WASC/SSSC/GCE (O/L) West African School Certificate with a pass in Shorthand and Typewriting National Secretarial Certificate with a pass in English Language and in Shorthand and Typewriting at 80 and 35 words per minute respectively. Secondary Modern School (Commercial) Certificate including passes in English Language and in Shorthand and Typewriting at 80 and 35 words per minute respectively."
              ],
              "AdvancementPath": "Promotion to Confidential Secretary Grade III"
            }
          },
          {
            "Confidential Secretary Grade III Grade Level 06": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above. for officer on Grade Level 10"
              ],
              "EntryRequirements": [
                "By advancement of a confirmed Confidential Secretary Grade IV who successfully completes the in-service training/improver course by attaining the speed of 100 and 50 words per minute in Shorthand and Typewriting respectively and passing tests in Secretarial Practice, English Language, Office Practice and any of the optional subjects, including Social Studies, Civil Service Rules, Economics or Book-keeping.",
                "By direct appointment of a candidate possessing any of the following qualifications: Ordinary National Diploma in Secretarial Studies including passes in Shorthand and Typewriting at 100 and 50 words per minute respectively from a recognized Secretarial/Technical Institution.  West African School Certificate/Senior Secondary School Certificate plus R.S.A. or Civil Service Training School Certificate in Shorthand and Typewriting at 100 and 50 words per minute respectively, plus a recognized Certificate in English Language, Office Practice, Secretarial Practice and any of the optional subjects, including Social Studies, Civil Service Rules, Economics or Book-keeping."
              ],
              "AdvancementPath": "Promotion to Confidential Secretary/Bilingual Secretary Grade II"
            }
          },
          {
            "Confidential Secretary/Bilingual Secretary Grade II Grade Level 07": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above.  for an officer on Grade Level 12."
              ],
              "EntryRequirements": [
                "By advancement or a Confidential Secretary Grade 111 who has successfully completed an approved in-service training/improver course by passing the shorthand and Typewriting Tests at 120 and 60 words per minute respectively.",
                "By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary Certificate or GCE (OIL) plus R.S.A. or Civil Service Training School Certificate in Shorthand and Typewriting at 120 and 60 words per minute respectively plus other prescribed subjects. Higher National Diploma (HND) in Secretarial Studies including a pass at 120 and 60 words per minute in Shorthand and Typewriting respectively from a recognized Secretarial/Technical Institution.",
                "By direct appointment of a candidate possessing a Certificate in Bilingual Secretaryshipor equivalent qualification from a recognized Institution."
              ],
              "AdvancementPath": "Promotion to Confidential Secretary/Bilingual Secretary Grade I"
            }
          },
          {
            "Confidential Secretary/Bilingual Secretary Grade I Grade Level 08": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above.  for an officer on Grade Level 13."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Confidential Secretary/Bilingual Secretary Grade II who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary Certificate or GCE (OIL) plus R.S.A. or Civil Service Training School Certificate in Shorthand and Typewriting at 120 and 60 words per minute respectively plus other prescribed subjects. Higher National Diploma (HND) in Secretarial Studies including a pass at 120 and 60 words per minute in Shorthand and Typewriting respectively from a recognized Secretarial/Technical Institution. or By direct appointment of a candidate possessing a Certificate in Bilingual Secretaryshipor equivalent qualification from a recognized Institution. plus at least three years post qualification cognate experience"
              ],
              "AdvancementPath": "Promotion to Senior Confidential Secretary/Bilingual Secretary"
            }
          },
          {
            "Senior Confidential Secretary/Bilingual Secretary Grade Level 09": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above.  for an officer on Grade Level 13.",
                "Taking notes of meetings and assisting in producing brief for meeting."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Confidential Secretary/Bilingual Secretary Grade I who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary Certificate or GCE (OIL) plus R.S.A. or Civil Service Training School Certificate in Shorthand and Typewriting at 120 and 60 words per minute respectively plus other prescribed subjects. Higher National Diploma (HND) in Secretarial Studies including a pass at 120 and 60 words per minute in Shorthand and Typewriting respectively from a recognized Secretarial/Technical Institution. or By direct appointment of a candidate possessing a Certificate in Bilingual Secretaryshipor equivalent qualification from a recognized Institution. plus at least six years post qualification cognate experience"
              ],
              "AdvancementPath": "Promotion to Principal Confidential Secretary/Bilingual Secretary Grade II"
            }
          },

          {
            "Principal Confidential Secretary/Bilingual Secretary Grade II Grade Level 10": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above.  for an officer on Grade Level 15.",
                "Organizing the work of the Office.",
                "Supervising subordinates in the Office.",
                "Taking notes of meetings and assisting in producing brief for meeting."
              ],
              "EntryRequirements": [
                " By promotion of a confirmed and suitable Senior Confidential Secretary Bilingual Secretary who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary Certificate or GCE (OIL) plus R.S.A. or Civil Service Training School Certificate in Shorthand and Typewriting at 120 and 60 words per minute respectively plus other prescribed subjects. Higher National Diploma (HND) in Secretarial Studies including a pass at 120 and 60 words per minute in Shorthand and Typewriting respectively from a recognized Secretarial/Technical Institution. or By direct appointment of a candidate possessing a Certificate in Bilingual Secretaryshipor equivalent qualification from a recognized Institution.  plus at least nine years’ post-qualification experience."
              ],
              "AdvancementPath": "Promotion to Principal Confidential Secretary/Bilingual Secretary Grade I"
            }
          },

          {
            "Principal Confidential Secretary/Bilingual Secretary Grade I Grade Level 12": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above.  for an officer on Grade Level 16.",
                "Organizing the work of the Office.",
                "Supervising subordinates in the Office.",
                "Taking notes of meetings and assisting in producing brief for meeting."
              ],
              "EntryRequirements": [
                " By promotion of a confirmed and suitable Principal Confidential Secretary Bilingual Secretary Grade II who has spent at least three years on the grade."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Confidential Secretary"
            }
          },

          {
            "Assistant Chief Confidential Secretary Grade Level 13": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above.  for anofficer on Grade Level 17.",
                "Organizing the work of the Office.",
                "Supervising subordinates in the Office.",
                "Taking notes of meetings and assisting in producing brief for meeting."
              ],
              "EntryRequirements": [
                " By promotion of a suitable Principal Confidential Secretary Grade I who has spent at least three years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Confidential Secretary"
            }
          },

          {
            "Chief Confidential Secretary Grade Level 14": {
              "Duties": [
                "Providing secretarial assistance such as taking dictation in shorthand and reproducing them in typed script. Receiving visitors, enquires and telephone calls on behalf of the officer to whom he/she is attached. Performing office routines associated with the duties enumerated above.  for the following office holders: President of the Federal Republic of Nigeria, Governors of States Secretary to the Government of the Federation. Secretary to State Governments Chief Justice of the Federation Any other very Senior Government functionary Organizing the activities of the Office. Supervising the activities of subordinate staff Attending conferences which may involve any of the officials mentioned above. Maintaining discipline among subordinates Taking notes of meetings and producing briefs for meetings"
              ],
              "EntryRequirements": [
                " By promotion of a suitable Assistant Chief Confidential Secretary who has spentat least three years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Clerical Staff",
        "Grades": [
          {
            "Clerical Assistant Grade Level 03": {
              "Duties": [
                "Performing routine clerical duties, under supervision, in an organizational unit such as Correspondence Registry, Transport Pool or Records Registry.",
                "Assisting a Clerical Officer or other senior staff"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing any of the following or equivalent qualifications: Junior Secondary School Certificate."
              ],
              "AdvancementPath": "Promotion to Clerical Officer Grade II"
            }
          },
          {
            "Clerical Officer Grade II Grade Level 04": {
              "Duties": [
                "Performing Clerical duties less routine than those assigned to Clerical Assistant in an organizational unit"
              ],
              "EntryRequirements": [
                "By promotion of a suitable Clerical Assistant who has spent at least two years on the grade and passed the Confirmation/Promotion Test at promotion level i.e.50%",
                "By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary School Certificate/West African School Certificate. General Certificate of Education (OIL) with four credits obtained at one sitting or Five credits at two sittings."
              ],
              "AdvancementPath": "Promotion to Clerical Officer Grade I"
            }
          },
          {
            "Clerical Officer Grade I Grade Level 05": {
              "Duties": [
                "Assisting in taking charge of a small Registry (Correspondence or Records).",
                "Assisting in training junior staff",
                "Performing routine internal audit duties."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Clerical Officer Grade II who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Senior Clerical Officer"
            }
          },
          {
            "Senior Clerical Officer Grade Level 06": {
              "Duties": [
                "Supervising and training junior staff in the unit",
                "Performing routine internal audit duties.",
                "Taking charge of a small Registry (Correspondence or Records).",
                "Assisting in maintaining discipline among subordinate staff."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Clerical Officer Grade I who has spent at least two years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Clerical Officer"
            }
          },

          {
            "Chief Clerical Officer Grade Level 07": {
              "Duties": [
                "Taking charge of a large Open Registry within a Ministry/Department.",
                "Rendering routine returns such as returns in respect of staff, staff quarters, Leave etc.",
                "Maintaining file archives in a Ministry/Department.",
                "Maintaining discipline among subordinate staff"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Clerical Officer who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Executive Officer(General Duties)",
        "Grades": [
          {
            "Assistant Executive Officer Grade Level 06": {
              "Duties": [
                "Applying under supervision, the Civil Service Rules, Civil Service Commission, Regulations, Financial Regulations, Circulars, etc in treating specified subject assigned in the field of Personnel Management.",
                "Heading, under supervision, routine correspondence on subjects within his schedule of duties.",
                "Making submissions to appropriate senior officers on matters within his schedule of duties."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing Ordinary National Diploma in Business Administration/Studies or Public Administration from a recognized Institution."
              ],
              "AdvancementPath": "Promotion to Executive Officer"
            }
          },
          {
            "Executive Officer Grade Level 07": {
              "Duties": [
                "Taking charge, under supervision, of specified subject/subjects or assignment within a Section or Division of a Ministry/Department and applying the Civil Service Rules, Civil Service Commission Regulations, Circulars etc. in treatment matters in any of the fields of Personnel Management."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Executive Officer who has spent at least two years on the grade. ",
                " By direct appointment of a candidate possessing Higher National Diploma (HND) in Business Studies/Administration or Public Administration from a recognized Institution.",
                "By direct appointment of a candidate possessing Ordinary National Diploma in Business Administration/Studies or Public Administration from a recognized Institution.  plus at least two years’ post-qualification cognate experience. "
              ],
              "AdvancementPath": "Promotion to Higher Executive Officer"
            }
          },
          {
            "Higher Executive Officer Grade Level 08": {
              "Duties": [
                "Taking charge of specified Subject/subjects within a Unit of a Ministry/Department.",
                "Supervising the work of a number of Officers in a Unit"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Executive Officer who has spent at least three years on the grade.",
                " By direct appointment of a candidate possessing Higher National Diploma (HND) in Business Studies/Administration or Public Administration from a recognized Institution. plus at least three years’ post- qualification cognate experience.",
                "By direct appointment of a candidate possessing Ordinary National Diploma in Business Administration/Studies or Public Administration from a recognized Institution.  plus at least five years’ post-qualification cognate experience. "
              ],
              "AdvancementPath": "Promotion to Senior Executive Officer"
            }
          },
          {
            "Senior Executive Officer Grade Level 09": {
              "Duties": [
                "Taking charge of specified subject/subjects or assignment requiring little or no supervision within a Unit of a Ministry/Department",
                "Supervising the work of a number of Officers in a Unit"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Higher Executive Officer who has spent at least three years on the grade.",
                " By direct appointment of a candidate possessing Higher National Diploma (HND) in Business Studies/Administration or Public Administration from a recognized Institution. plus at least eight years’ post- qualification cognate experience.",
                "By direct appointment of a candidate possessing Ordinary National Diploma in Business Administration/Studies or Public Administration from a recognized Institution.  plus at least eight years’ post-qualification cognate experience. "
              ],
              "AdvancementPath": "Promotion to Principal Executive Officer Grade II"
            }
          },
          {
            "Principal Executive Officer Grade II Grade Level 10": {
              "Duties": [
                "Taking charge of specified assignment or subject/subjects ‘Within a Unit in a Ministry/Department.",
                "Assisting in the estab1jsIient and maintenance of accurate staff information System.",
                "Assisting the Head a Section in the supervision and deployment of junior staff."
              ],
              "EntryRequirements": [
                "By promotion of a confirmedand suitable Senior Executive Officer who has spent at least threeyearsonthe grade.",
                " By direct appointment of a candidate possessing Higher National Diploma (HND) in Business Studies/Administration or Public Administration from a recognized Institution. plus at least nine years’ post- qualification cognate experience.",
                "By direct appointment of a candidate possessing Ordinary National Diploma in Business Administration/Studies or Public Administration from a recognized Institution.  plus at least eleven years’ post-qualification cognate experience. "
              ],
              "AdvancementPath": "Promotion to Principal Executive Officer Grade I"
            }
          },
          {
            "Principal Executive Officer Grade I Grade Level 12": {
              "Duties": [
                "Assisting in the supervision of defined functions.",
                "Assisting in the planning, execution and supervision of specific programmes.",
                "Assisting in the collection and collation of data for the preparation of manpower budget.",
                "Assisting in the processing of pension and gratuity papers."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Principal Executive Officer Grade II who has spent at least three years on the grade."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Executive Officer"
            }
          },
          {
            "Assistant Chief Executive Officer Grade Level 13": {
              "Duties": [
                "Assisting the head of the Management Information Section.",
                "Supervising the execution of specific programmes in the Section."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Principal Executive Officer Grade I who has spent at least three years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Executive Officer"
            }
          },
          {
            "Chief Executive Officer Grade Level 14": {
              "Duties": [
                "Supervising arid coordinating the activities of a number ofjunior staff.",
                "Assisting in the training of staff.",
                "Taking charge of specific programmes.",
                "Assisting in the deployment of subordinate staff."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Chief Executive Officer who has spent at least three years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Administrative Officer",
        "Grades": [
          {
            "Administrative Officer Grade II Grade Level 08": {
              "Duties": [
                "Collecting andinterpreting data for useby senior officers.",
                "Making submissions and preparing draft letters on specific matters",
                "Preparing minutes of meetings"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing a degree in any of the disciplines of Social Science or Humanities."
              ],
              "AdvancementPath": "Promotion to Administrative Officer Grade I "
            }
          },

          {
            "Administrative Officer Grade I Grade Level 09": {
              "Duties": [
                "Performing specialized functions in the fields of Trade, Investment, Economic Planning, Personnel Management et-cetera.",
                "Collating and assisting in analyzing data",
                "Making submissions and preparing draft letters on Specific matters."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Administrative Officer Grade II who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing a degree in any of the disciplines of Social Science or Humanities.  plus at least three years’ post- qualification cognate experience.",
                "By direct appointment of a candidate possessing a Masters’ degree in any of the disciplines of Social Science or Humanities. plus at least one-year post- qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Senior Administrative Officer"
            }
          },

          {
            "Senior Administrative Officer Grade Level 10": {
              "Duties": [
                "Initiating the preparation of draft memorandum and speeches.",
                "Supervising the work of a number of subordinate officers",
                "Analyzing and applying data",
                "Assisting in making reports."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Administrative Officer Grade I who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing a degree in any of the disciplines of Social Science or Humanities.  plus at least six years’ post- qualification cognate experience.",
                "By direct appointment of a candidate possessing a Masters’ degree in any of the disciplines of Social Science or Humanities. plus at least four year post- qualification cognate experience.",
                "By direct appointment of a candidate possessing a Doctorate degree in any of the disciplines of Social Science or Humanities. plus at least one year post- qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Administrative Officer"
            }
          },

          {
            "Principal Administrative Officer Grade Level 12": {
              "Duties": [
                "Preparing annual estimates of revenue and expenditure",
                "Performing personnel financial and general administrative duties",
                "Preparing statutory and periodic reports",
                "Coordinating the activities of a number ofjunior officers"
              ],
              "EntryRequirements": [
                "By promotion of confirmed and suitable Senior Administrative Officer whohas spent at least three years on the grade.",
                " Direct appointments may also be made to posts in Grade Level 12 and above; but these would be preceded by specific advertisement at the instance of the user Ministry/Department. Promotion from such direct appointments to higher grades are subject to confirmation of appointment."
              ],
              "AdvancementPath": "Promotion to Assistant chief Administrative Officer"
            }
          },

          {
            "Assistant chief Administrative Officer Grade Level 13": {
              "Duties": [
                "Personnel Management",
                "Project Analysis",
                "Investment Management",
                "Financial Management",
                "Management Services",
                "Assisting in the administration of a Section",
                "Assisting in the formulation, execution and review ofpolicies",
                "Assisting in training junior staff."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Principal Administrative Officer has spent at least three years on the grade and attended a course in c’ Manpower Budgeting and Staff Inspection, Pension Administrative Management Consulting or Grading.",
                " Direct appointments may also be made to posts in Grade Level 12 and above; but these would be preceded by specific advertisement at the instance of the user Ministry/Department. Promotion from such direct appointments to higher grades are subject to confirmation of appointment."
              ],
              "AdvancementPath": "Promotion to chief Administrative Officer"
            }
          },

          {
            "Chief Administrative Officer Grade Level 14": {
              "Duties": [
                "Taking charge of a Section",
                "Taking charge of specific subject/subjects",
                "Assisting in the formulation, execution and review of policies"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Chief Administrative Officer who has spent at least three years on the grade and success - completed a prescribed course.",
                " Direct appointments may also be made to posts in Grade Level 12 and above; but these would be preceded by specific advertisement at the instance of the user Ministry/Department. Promotion from such direct appointments to higher grades are subject to confirmation of appointment."
              ],
              "AdvancementPath": "Promotion to Assistant Director"
            }
          },

          {
            "Assistant Director Grade Level 15": {
              "Duties": [
                "Taking charge of a Branch",
                "Taking charge/coordinating activities in specific subject/subjects.",
                "Coordinating the training programme of staff.",
                "Assisting in the formulation, execution and review of policies.",
                "Assisting in the general administration of the Department (States)"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Chief Administrative Officer who spent at least three years on the grade.",
                " Direct appointments may also be made to posts in Grade Level 12 and above; but these would be preceded by specific advertisement at the instance of the user Ministry/Department. Promotion from such direct appointments to higher grades are subject to confirmation of appointment."
              ],
              "AdvancementPath": "Promotion to Deputy Director (Federal)/Director (State)"
            }
          },

          {
            "Deputy Director (Federal)/Director (State) Grade Level 16": {
              "Duties": [
                "Taking charge of Division/Department (States)",
                "Advising on general administrative matters (States).",
                "Assisting in the general administration of the Department.",
                "Taking responsibility for administrative development planning."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Director who has spent at least four y on the grade.",
                " Direct appointments may also be made to posts in Grade Level 12 and above; but these would be preceded by specific advertisement at the instance of the user Ministry/Department. Promotion from such direct appointments to higher grades are subject to confirmation of appointment."
              ],
              "AdvancementPath": "Promotion to Director "
            }
          },

          {
            "Director Grade Level 17": {
              "Duties": [
                "Taking charge of the general administration of a Department",
                "Advising on general administrative matters"
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Director who has spent at least four y on the grade.",
                " Direct appointments may also be made to posts in Grade Level 12 and above; but these would be preceded by specific advertisement at the instance of the user Ministry/Department. Promotion from such direct appointments to higher grades are subject to confirmation of appointment."
              ],
              "AdvancementPath": " "
            }
          }
        ]
      },

      {
        "Cadre": "Library Officer",
        "Grades": [
          {
            "Assistant Library Officer Grade Level 06": {
              "Duties": [
                "Giving routine services to readers including simple reference and information Services",
                "Undertaking routine cataloguing and classifying simple Library materials.",
                " Maintaining Library records.",

                "Assisting in setting up Library exhibits.",
                "Supervising stock."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing any of the following qualification General Certificate of Education (Advanced Level) in two subjects obtained at one sitting or in three subjects obtained at two sittings. A pass in the First Professional Examination of the Library Associations. Certificate in Library Studies obtained from a recognized Institution plus at least two years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Library Officer "
            }
          },

          {
            "Library Officer Grade Level 07": {
              "Duties": [
                "Classifying and cataloguing Library books and materials. ",

                "Taking charge of a small Library."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Library Officer who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing arty of the following qualifications Part of the Associate Membership of the Library Association. Diploma in Library Studies obtained from a recognized institution.",
                "By direct appointment of a candidate possessing any of the following qualification General Certificate of Education (Advanced Level) in two subjects obtained at one sitting or in three subjects obtained at two sittings. A pass in the First Professional Examination of the Library Associations. Certificate in Library Studies obtained from a recognized Institution plus at least two years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to  Higher Library Officer"
            }
          },

          {
            "Higher Library Officer Grade Level 08": {
              "Duties": [
                "Coordinating the activities of a nsumber ofjunior officers.",
                "Acting as readers’ adviser in lending libraries",
                "Assisting in the training ofjunior staff."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Library Officer who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing arty of the following qualifications Part of the Associate Membership of the Library Association. Diploma in Library Studies obtained from a recognized institution. plus at least three years post- qualification",
                "By direct appointment of a candidate possessing any of the following qualification General Certificate of Education (Advanced Level) in two subjects obtained at one sitting or in three subjects obtained at two sittings. A pass in the First Professional Examination of the Library Associations. Certificate in Library Studies obtained from a recognized Institution plus at least five years’ post-qualification cognate experience."
              ],
              "AdvancementPath": " Promotion to Senior Library Officer"
            }
          },

          {
            "Senior Library Officer Grade Level 09": {
              "Duties": [
                "Trainingjuniorstaff",
                "Taking charge of the circulation of periodicals and other publications"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Higher Library Officer who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing arty of the following qualifications Part of the Associate Membership of the Library Association. Diploma in Library Studies obtained from a recognized institution. plus at least six years post- qualification",
                "By direct appointment of a candidate possessing any of the following qualification General Certificate of Education (Advanced Level) in two subjects obtained at one sitting or in three subjects obtained at two sittings. A pass in the First Professional Examination of the Library Associations. Certificate in Library Studies obtained from a recognized Institution plus at least eight years’ post-qualification cognate experience."
              ],
              "AdvancementPath": " Promotion to Principal Library Officer"
            }
          },

          {
            "Principal Library Officer Grade Level 10": {
              "Duties": [
                "Taking part in talks to school and literary associations",
                "Inspecting small Departmental or Local Government Libraries to ensure they maintain high standards"
              ],
              "EntryRequirements": [
                " By promotion of a confirmed arid suitable Senior Library Officer who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing arty of the following qualifications Part of the Associate Membership of the Library Association. Diploma in Library Studies obtained from a recognized institution. plus at least nine years post- qualification"
              ],
              "AdvancementPath": " Promotion to Assistant Chief Library Officer"
            }
          },

          {
            "Assistant Chief Library Officer Grade Level 12": {
              "Duties": [
                "Assisting in the training, supervision and appraisal ofjunior staff",
                " Organizing library exhibitions."
              ],
              "EntryRequirements": [
                " By promotion of a confirmed and suitable Principal Library Officer who has at spent at least three years on the grade."
              ],
              "AdvancementPath": " Promotion to Chief Library Officer"
            }
          },
          {
            " Chief Library Officer Grade Level 13": {
              "Duties": [
                "Taking charge of a unit of a Library",
                " Supervising the activities of a number of Library staff."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Chief Library Officer who has spent at least three years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Stores Attendant",
        "Grades": [
          {
            "Stores Attendant Grade Level 02": {
              "Duties": [
                "Performing under supervision, routine and manual stores work"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School Leaving Certificate."
              ],
              "AdvancementPath": ""
            }
          },

          "Stores Officer Grade Level 07"
        ]
      },

      {
        "Cadre": "Stores Attendant",
        "Grades": [
          {
            "Stores Attendant Grade Level 02": {
              "Duties": [
                "Performing under supervision, routine and manual stores work"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School Leaving Certificate."
              ],
              "AdvancementPath": ""
            }
          },

          "Stores Officer Grade Level 07"
        ]
      },
      {
        "Cadre": "Stores Attendant",
        "Grades": [
          {
            "Stores Attendant Grade Level 02": {
              "Duties": [
                "Performing under supervision, routine and manual stores work"
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing the First School Leaving Certificate."
              ],
              "AdvancementPath": ""
            }
          },

          "Stores Officer Grade Level 07"
        ]
      }
    ],

    "SectionMetadata": {
      "TotalCadres": 28,
      "Categories": [
        "Media and Communication",
        "Cultural Heritage",
        "Archival",
        "Creative Arts",
        "Technical Support"
      ],
      "TypicalGradeLevels": "GL 03 to GL 17 depending on cadre and seniority",
      "DepartmentFunctions": [
        "Information dissemination and public communication",
        "Cultural heritage preservation and management",
        "Archival records management and preservation",
        "Media production and creative arts development",
        "Cultural research and documentation"
      ],
      "KeySkills": [
        "Communication and media relations",
        "Cultural research and documentation",
        "Creative arts and production",
        "Heritage conservation and management",
        "Information management and dissemination"
      ],
      "TechnologyRequirements": [
        "Media production equipment",
        "Archival preservation systems",
        "Digital documentation tools",
        "Information management software",
        "Cultural heritage databases"
      ]
    }
  },

  "CateringDomesticAndHotelServicesSection": {
    "Cadres": [
      {
        "Cadre": "Gardener",
        "Grades": [
          {
            "Gardener Grade Level 02": {
              "Duties": [
                "Performing such horticultural duties as growing flowers, fruits and vegetables.",
                "Maintaining existing flowers/fruits’ gardens.",
                "Weeding or pruning flowers/fruits’ gardens.",
                "Repairing lawns"
              ],
              "EntryRequirements": [
                "By direct appointment cu a suitable able bodied candidate."
              ],
              "AdvancementPath": "Promotion to Head Gardener"
            }
          },
          {
            "Head Gardener Grade Level 03": {
              "Duties": [
                "Supervising the work of a number of Gardeners.",
                "Taking charge of the general cleanliness of premises"
              ],
              "EntryRequirements": [
                "By promotion, of a confirmed and suitable Gardener who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Washerman",
        "Grades": [
          {
            "Washerman Grade Level 02": {
              "Duties": [
                "Washing used textile materials and ironing them.",
                "Assisting in dry-cleaning non-washable textile materials."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing First School Leaving Certificate.",
                "By direct appointment of a candidate who can read and write plus at least two years’ cognate experience"
              ],
              "AdvancementPath": "Promotion to  Senior Washerman"
            }
          },
          {
            "Senior Washerman Grade Level 03": {
              "Duties": [
                "Keeping laundry records.",
                "Dry-cleaning non-washable textile materials."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Washerman who baa sent at least two years on the grade.",
                " By direct appointment of a candidate who can read and write plus at least two years’ post-qualification cognateexperience."
              ],
              "AdvancementPath": "Promotion to Head Washerman"
            }
          },
          {
            "Head Washerman Grade Level 04": {
              "Duties": [
                "Performing under supervision, routine and manual stores work"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Washerman who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Kitchen Attendant/Cook",
        "Grades": [
          {
            "Kitchen Attendant Grade Level 01": {
              "Duties": [
                "Assisting generally in the preparation of meals.",
                "Washing and cleaning Kitchen and Kitchen Utensils.",
                "Cleaning the Kitchen surroundings."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing ability to read and write."
              ],
              "AdvancementPath": "Promotion to  Cook Grade Level 02"
            }
          },

          {
            "Cook Grade Level 02": {
              "Duties": [
                "Assisting in preparing meals.",
                "Cleaning and washing Kitchen and Kitchen utensils"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Kitchen Attendant who has spell least two years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications:First School Leaving Certificate. Ability to read and write simple English plus at least two years’ cognate experience."
              ],
              "AdvancementPath": "Promotion to Senior Cook"
            }
          },
          {
            "Senior Cook Grade Level 03": {
              "Duties": [
                "Preparing meals.",
                "Assisting in preparing special dishes.",
                "Keeping kitchen utensils."
              ],
              "EntryRequirements": [
                "By promotion of& confirmed and suitable Cook who has spent at least two on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications:First School Leaving Certificate. Ability to read and write simple English plus at least two years’ cognate experience."
              ],
              "AdvancementPath": "Promotion to Head Cook"
            }
          },

          {
            "Head Cook Grade Level 04": {
              "Duties": [
                "Preparing special dishes.",
                "Supervising the activities of a number of Cooks/Senior Cooks."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Cook who has spent at least twoyears on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Steward",
        "Grades": [
          {
            "Steward Grade Level 01": {
              "Duties": [
                "Serving meals and laying tables for meals.",
                "Serving drinks, beverages, cigars and cigarettes when required.",
                "Blending wine.",
                " Cleaning and washing linen, cooking utensils and other equipment/materials.",
                "Maintaining general cleanliness of dining/living rooms and halls.",
                "Keeping records of stocks of drinks, cigars and cigarettes."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing ability to read and write simple English Language."
              ],
              "AdvancementPath": "Promotion to Senior Steward"
            }
          },
          {
            "Senior Steward Grade Level 02": {
              "Duties": [
                "Assisting the Head Steward in the supervision of the activities ofjunior staff.",
                " A Senior Steward may he required to keep small records of foodstuffs supplied to cooks for preparation."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Steward who has spent at least years on the grade.",
                "By direct appointment of a candidate possessing the First School Lea Certificate."
              ],
              "AdvancementPath": "Promotion to Head Steward"
            }
          },
          {
            "Head Steward Grade Level 03": {
              "Duties": [
                "Supervising the activities of a minimum number of eight Stewards/Senior Stewards."
              ],
              "EntryRequirements": [
                "Bypromotion of a confirmed and suitable Senior Steward who has spent at two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Catering Assistant",
        "Grades": [
          {
            "Catering Assistant Grade Level 04": {
              "Duties": [
                "Performing, under supervision, routine catering duties in a large staff canteen hospital, college or V.I.P. Guest House, etcetera.",
                " Taking charge of an out-station Catering Rest House, Guest House or Restaurant.",
                "Serving as a Warden in a Student Nurses and Student Midwives hostels or college, for example, assisting to enforce hostel rules."
              ],
              "EntryRequirements": [
                " By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary School Certificate or West African School Certificate General Certificate of Education (Ordinary Level) obtained with four credits at one sitting or five credits at two sittings. Evidence of completion of a full course in a Government approved Secondary School or S. 75 or Junior Secondary School Certificate plus Certificate in Catering Studies obtained after completion of a year’s course in a recognized institution for example, Kaduna Polytechnic (one year course)."
              ],
              "AdvancementPath": "Promotion to Senior Catering Assistant Grade II "
            }
          },
          {
            "Senior Catering Assistant Grade II Grade Level 05": {
              "Duties": [
                "Taking charge of a large out-station Government Rest House, Guest House or Restaurant.",
                "Taking charge of a small hostel for Student Nurses, Student Midwives or Pupils.",
                "Supervising and training junior staff."
              ],
              "EntryRequirements": [
                "Bypromotion of a confirmed and suitable Catering Assistant who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing Teachers’ Grade II Certificatein a relevant subject",
                "By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary School Certificate or West African School Certificate General Certificate of Education (Ordinary Level) obtained with four credits at one sitting or five credits at two sittings. Evidence of completion of a full course in a Government approved Secondary School or S. 75 or Junior Secondary School Certificate plus Certificate in Catering Studies obtained after completion of a year’s course in a recognized institution for example, Kaduna Polytechnic (one year course).",
                "By direct appointment of a candidate who has successfully completed a two- years certificate course in Home Economics from a recognized Institution."
              ],
              "AdvancementPath": "Promotion to Senior Catering Assistant Grade I"
            }
          },
          {
            "Senior Catering Assistant Grade I Grade Level 06": {
              "Duties": [
                "Assisting in inspecting Government out-station Catering institutions. ",
                " Taking charge of a very large out-station Government Rest House, Guest House or Restaurant."
              ],
              "EntryRequirements": [
                " By promotion of a confirmed and suitable Senior Catering Assistant Grade II who has spent at least two ‘ears on the grade.",
                "By direct appointment of a candidate possessing a Diploma in Catering Stu obtained on completion of a two-year course in a recognised institution, example, the Kaduna Polytechnic."
              ],
              "AdvancementPath": "Promotion to Chief Catering Assistant"
            }
          },

          {
            "Chief Catering Assistant Grade Level 07": {
              "Duties": [
                "Coordinating the activities of a number of subordinate officers.",
                "Inspecting Government out-station Catering Institutions to ensure high standards."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Catering Assistant Grade II has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Catering Officer",
        "Grades": [
          {
            "Assistant Catering Officer Grade Level 06": {
              "Duties": [
                "Planning daily menus.",
                "Supervising the preparation and serving of food.",
                "Ensuring clean1inss and orderliness.",
                "Taking charge ofthe welfare of students student-nurses/midwives inhostel and enforcing hostel rules.",
                "Checking daily sales to ensure proper accounts."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association. Ordinary National Diploma in Hotel Keeping and Catering."
              ],
              "AdvancementPath": "Promotion to Catering Officer"
            }
          },
          {
            "Catering Officer Grade Level 07": {
              "Duties": [
                "Taking charge of the catering services of a hospital",
                "Organizing school meals.",
                "Performing the duties ofa Housekeeper in a State house, which include: Planning menus. Making purchases of food-stuff. Supervising the State House kitchen staff Ensuring cleanliness and orderliness."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Catering Officer who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least two years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Higher Catering Officer"
            }
          },
          {
            "Higher Catering Officer Grade Level 08": {
              "Duties": [
                "Taking charge of the Catering Department of a large institution.",
                "Takingchargeof V.I.P. Guest Houses",
                "Teaching in Catering Schools."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Catering Officer who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least five years’ post-qualification cognate experience. or By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.  plus o least three years post-qualification cognate experience",
                "By direct appointment of a candidate possessing Higher National Diploma Dietetics of Kaduna Polytechnics plus Registration with the State Registered Dieticians."
              ],
              "AdvancementPath": "Promotion to Senior Catering Officer "
            }
          },
          {
            "Senior Catering Officer Grade Level 09": {
              "Duties": [
                "Taking charge of food stuffs and ensuring proper storage",
                "Taking charge of the Catering Department of a very large Institution.",
                "Coordinating the activities of a number of Catering Rest Houses/Guest House."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable higher Catering Officer who has spent at least three years of the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least eight years’ post-qualification cognate experience. or By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.  plus at least six years post-qualification cognate experience By direct appointment of a candidate possessing Higher National Diploma Dietetics of Kaduna Polytechnics plus Registration with the State Registered Dieticians. plus at least three years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Catering Officer"
            }
          },
          {
            "Principal Catering Officer Grade Level 10": {
              "Duties": [
                "Taking charge of the training programmes of staff",
                "Giving lectures to Student nurses and catering staff",
                "Supervising and coordinating the activities of a number of subordinates"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Catering Officer who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least eleven years’ post-qualification cognate experience. or By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.  plus at least nine years post-qualification cognate experience By direct appointment of a candidate possessing Higher National Diploma Dietetics of Kaduna Polytechnics plus Registration with the State Registered Dieticians. plus at least six years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Catering Officer "
            }
          },
          {
            "Assistant Chief Catering Officer Grade Level 12": {
              "Duties": [
                "Inspecting Catering Departments of Institutions to ensure high standards.",
                "Assisting the Chief Catering Officer in the formulation of policies on cateringmatters.",
                "Participating in seminars and conferences on matters relating to catering services."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Principal Catering Officer who has spent at leastthree years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Catering Officer"
            }
          },
          {
            "Chief Catering Officer Grade Level 13": {
              "Duties": [
                "Advising on catering services.",
                "Assisting in the formulation of policies on catering services including trainingprogrammes.",
                "Developing catering services.",
                "Implementing Government policies on catering.",
                "Taking charge of catering staff."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Chief Catering Officer who has spent at least three years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Instructor(Catering)",
        "Grades": [
          {
            "Instructor Grade Level 07": {
              "Duties": [
                "Teaching catering subjects.",
                "Preparing notes of lessons.",
                "Keeping class attendance register and oilier relevant records.",
                "Setting questions and marking test papers.",
                "Assisting in maintaining discipline and cleanliness in the school."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics."
              ],
              "AdvancementPath": "Promotion to Higher Instructor"
            }
          },
          {
            "Higher Instructor Grade Level 08": {
              "Duties": [
                "Teaching catering subjects.",
                "Preparing notes of lessons.",
                "Keeping class attendance register and other relevant records.",
                "Setting questions and marking test papers.",
                "Assisting in organizing group-work and educational visits for students.",
                "Assisting in maintaining discipline and cleanliness in the school"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Instructor who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics. plus at least three years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Senior Instructor"
            }
          },
          {
            "Senior Instructor Grade Level 09": {
              "Duties": [
                "Teaching Catering Subjects",
                "Preparing notes of lesson and supervising junior instructors in the preparation of lessons, experiments and demonstrations.",
                "Setting questions and marking test papers.",
                "Maintaining discipline and cleanliness in the school.",
                "Keeping class attendance register and other relevant records."
              ],
              "EntryRequirements": [
                " By promotion of a confirmed and suitable Higher Instructor who has spent at least three yearson the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics. plus at least six years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Instructor Grade II "
            }
          },
          {
            "Principal Instructor Grade II Grade Level 10": {
              "Duties": [
                "Teaching catering subjects",
                "Coordinating and monitoring a number of courses.",
                " Acting as a team leader in examining students in catering subjects.",
                "Assisting in conducting research tests and experiments on Nigerian dishes."
              ],
              "EntryRequirements": [
                "Bypromotion of a confirmed and suitable Senior Instructor who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics. plus at least nine years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Instructor Grade I"
            }
          },
          {
            "Principal Instructor Grade I Grade Level 12": {
              "Duties": [
                "Teaching students in specialized subjects.",
                "Coordinating and monitoring a number of courses.",
                "Conducting research, tests and experiments on Nigerian dishes.",
                "Acting as team leader in examining students in catering subjects.",
                "Taking-charge of curriculum review and development."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Principal Instructor Grade II who has spent at least three years on the grade.",
                "Suitable persons in this grade will be required to attend courses leading to award of Certificate in Public Administration from a recognized Institution (ASCON)."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Instructor"
            }
          },
          {
            "Assistant Chief Instructor Grade Level 13": {
              "Duties": [
                "Assisting in liar administration of the school including planning courses and conducting examinations.",
                "Teaching students in one’s specialized subjects."
              ],
              "EntryRequirements": [
                "By promotion of a continued and suitable Principal Instructor Grade I whohas spent at least three years on the grade and successfully completed the trainingcourses leading to award of Certificate in Public Administration from a recognized Institution (ASCON)."
              ],
              "AdvancementPath": "Promotion to Chief Instructor"
            }
          },
          {
            "Chief Instructor Grade Level 14": {
              "Duties": [
                "Supervising the activities of a minimum number of eight Stewards/Senior Stewards."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Chief Instructor who has spent at least three years on the grade and successfully completed the training courses leading to award of Certificate in Public Administration from a recognized Institution (ASCON)."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      }
    ],

    "SectionMetadata": {
      "TotalCadres": 28,
      "Categories": [
        "Media and Communication",
        "Cultural Heritage",
        "Archival",
        "Creative Arts",
        "Technical Support"
      ],
      "TypicalGradeLevels": "GL 03 to GL 17 depending on cadre and seniority",
      "DepartmentFunctions": [
        "Information dissemination and public communication",
        "Cultural heritage preservation and management",
        "Archival records management and preservation",
        "Media production and creative arts development",
        "Cultural research and documentation"
      ],
      "KeySkills": [
        "Communication and media relations",
        "Cultural research and documentation",
        "Creative arts and production",
        "Heritage conservation and management",
        "Information management and dissemination"
      ],
      "TechnologyRequirements": [
        "Media production equipment",
        "Archival preservation systems",
        "Digital documentation tools",
        "Information management software",
        "Cultural heritage databases"
      ]
    }
  },
  "AgricultureAndRuralDevelopmentSection": {
    "Cadres": [
      {
        "Cadre": "Agricultural Field Attendant",
        "Grades": [
          {
            "Gardener Grade Level 02": {
              "Duties": [
                "Performing such horticultural duties as growing flowers, fruits and vegetables.",
                "Maintaining existing flowers/fruits’ gardens.",
                "Weeding or pruning flowers/fruits’ gardens.",
                "Repairing lawns"
              ],
              "EntryRequirements": [
                "By direct appointment cu a suitable able bodied candidate."
              ],
              "AdvancementPath": "Promotion to Head Gardener"
            }
          },
          {
            "Head Gardener Grade Level 03": {
              "Duties": [
                "Supervising the work of a number of Gardeners.",
                "Taking charge of the general cleanliness of premises"
              ],
              "EntryRequirements": [
                "By promotion, of a confirmed and suitable Gardener who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Washerman",
        "Grades": [
          {
            "Washerman Grade Level 02": {
              "Duties": [
                "Washing used textile materials and ironing them.",
                "Assisting in dry-cleaning non-washable textile materials."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing First School Leaving Certificate.",
                "By direct appointment of a candidate who can read and write plus at least two years’ cognate experience"
              ],
              "AdvancementPath": "Promotion to  Senior Washerman"
            }
          },
          {
            "Senior Washerman Grade Level 03": {
              "Duties": [
                "Keeping laundry records.",
                "Dry-cleaning non-washable textile materials."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Washerman who baa sent at least two years on the grade.",
                " By direct appointment of a candidate who can read and write plus at least two years’ post-qualification cognateexperience."
              ],
              "AdvancementPath": "Promotion to Head Washerman"
            }
          },
          {
            "Head Washerman Grade Level 04": {
              "Duties": [
                "Performing under supervision, routine and manual stores work"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Washerman who has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Kitchen Attendant/Cook",
        "Grades": [
          {
            "Kitchen Attendant Grade Level 01": {
              "Duties": [
                "Assisting generally in the preparation of meals.",
                "Washing and cleaning Kitchen and Kitchen Utensils.",
                "Cleaning the Kitchen surroundings."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing ability to read and write."
              ],
              "AdvancementPath": "Promotion to  Cook Grade Level 02"
            }
          },

          {
            "Cook Grade Level 02": {
              "Duties": [
                "Assisting in preparing meals.",
                "Cleaning and washing Kitchen and Kitchen utensils"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Kitchen Attendant who has spell least two years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications:First School Leaving Certificate. Ability to read and write simple English plus at least two years’ cognate experience."
              ],
              "AdvancementPath": "Promotion to Senior Cook"
            }
          },
          {
            "Senior Cook Grade Level 03": {
              "Duties": [
                "Preparing meals.",
                "Assisting in preparing special dishes.",
                "Keeping kitchen utensils."
              ],
              "EntryRequirements": [
                "By promotion of& confirmed and suitable Cook who has spent at least two on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications:First School Leaving Certificate. Ability to read and write simple English plus at least two years’ cognate experience."
              ],
              "AdvancementPath": "Promotion to Head Cook"
            }
          },

          {
            "Head Cook Grade Level 04": {
              "Duties": [
                "Preparing special dishes.",
                "Supervising the activities of a number of Cooks/Senior Cooks."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Cook who has spent at least twoyears on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Steward",
        "Grades": [
          {
            "Steward Grade Level 01": {
              "Duties": [
                "Serving meals and laying tables for meals.",
                "Serving drinks, beverages, cigars and cigarettes when required.",
                "Blending wine.",
                " Cleaning and washing linen, cooking utensils and other equipment/materials.",
                "Maintaining general cleanliness of dining/living rooms and halls.",
                "Keeping records of stocks of drinks, cigars and cigarettes."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing ability to read and write simple English Language."
              ],
              "AdvancementPath": "Promotion to Senior Steward"
            }
          },
          {
            "Senior Steward Grade Level 02": {
              "Duties": [
                "Assisting the Head Steward in the supervision of the activities ofjunior staff.",
                " A Senior Steward may he required to keep small records of foodstuffs supplied to cooks for preparation."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Steward who has spent at least years on the grade.",
                "By direct appointment of a candidate possessing the First School Lea Certificate."
              ],
              "AdvancementPath": "Promotion to Head Steward"
            }
          },
          {
            "Head Steward Grade Level 03": {
              "Duties": [
                "Supervising the activities of a minimum number of eight Stewards/Senior Stewards."
              ],
              "EntryRequirements": [
                "Bypromotion of a confirmed and suitable Senior Steward who has spent at two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Catering Assistant",
        "Grades": [
          {
            "Catering Assistant Grade Level 04": {
              "Duties": [
                "Performing, under supervision, routine catering duties in a large staff canteen hospital, college or V.I.P. Guest House, etcetera.",
                " Taking charge of an out-station Catering Rest House, Guest House or Restaurant.",
                "Serving as a Warden in a Student Nurses and Student Midwives hostels or college, for example, assisting to enforce hostel rules."
              ],
              "EntryRequirements": [
                " By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary School Certificate or West African School Certificate General Certificate of Education (Ordinary Level) obtained with four credits at one sitting or five credits at two sittings. Evidence of completion of a full course in a Government approved Secondary School or S. 75 or Junior Secondary School Certificate plus Certificate in Catering Studies obtained after completion of a year’s course in a recognized institution for example, Kaduna Polytechnic (one year course)."
              ],
              "AdvancementPath": "Promotion to Senior Catering Assistant Grade II "
            }
          },
          {
            "Senior Catering Assistant Grade II Grade Level 05": {
              "Duties": [
                "Taking charge of a large out-station Government Rest House, Guest House or Restaurant.",
                "Taking charge of a small hostel for Student Nurses, Student Midwives or Pupils.",
                "Supervising and training junior staff."
              ],
              "EntryRequirements": [
                "Bypromotion of a confirmed and suitable Catering Assistant who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing Teachers’ Grade II Certificatein a relevant subject",
                "By direct appointment of a candidate possessing any of the following qualifications: Senior Secondary School Certificate or West African School Certificate General Certificate of Education (Ordinary Level) obtained with four credits at one sitting or five credits at two sittings. Evidence of completion of a full course in a Government approved Secondary School or S. 75 or Junior Secondary School Certificate plus Certificate in Catering Studies obtained after completion of a year’s course in a recognized institution for example, Kaduna Polytechnic (one year course).",
                "By direct appointment of a candidate who has successfully completed a two- years certificate course in Home Economics from a recognized Institution."
              ],
              "AdvancementPath": "Promotion to Senior Catering Assistant Grade I"
            }
          },
          {
            "Senior Catering Assistant Grade I Grade Level 06": {
              "Duties": [
                "Assisting in inspecting Government out-station Catering institutions. ",
                " Taking charge of a very large out-station Government Rest House, Guest House or Restaurant."
              ],
              "EntryRequirements": [
                " By promotion of a confirmed and suitable Senior Catering Assistant Grade II who has spent at least two ‘ears on the grade.",
                "By direct appointment of a candidate possessing a Diploma in Catering Stu obtained on completion of a two-year course in a recognised institution, example, the Kaduna Polytechnic."
              ],
              "AdvancementPath": "Promotion to Chief Catering Assistant"
            }
          },

          {
            "Chief Catering Assistant Grade Level 07": {
              "Duties": [
                "Coordinating the activities of a number of subordinate officers.",
                "Inspecting Government out-station Catering Institutions to ensure high standards."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Catering Assistant Grade II has spent at least two years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Catering Officer",
        "Grades": [
          {
            "Assistant Catering Officer Grade Level 06": {
              "Duties": [
                "Planning daily menus.",
                "Supervising the preparation and serving of food.",
                "Ensuring clean1inss and orderliness.",
                "Taking charge ofthe welfare of students student-nurses/midwives inhostel and enforcing hostel rules.",
                "Checking daily sales to ensure proper accounts."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association. Ordinary National Diploma in Hotel Keeping and Catering."
              ],
              "AdvancementPath": "Promotion to Catering Officer"
            }
          },
          {
            "Catering Officer Grade Level 07": {
              "Duties": [
                "Taking charge of the catering services of a hospital",
                "Organizing school meals.",
                "Performing the duties ofa Housekeeper in a State house, which include: Planning menus. Making purchases of food-stuff. Supervising the State House kitchen staff Ensuring cleanliness and orderliness."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Assistant Catering Officer who has spent at least two years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least two years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Higher Catering Officer"
            }
          },
          {
            "Higher Catering Officer Grade Level 08": {
              "Duties": [
                "Taking charge of the Catering Department of a large institution.",
                "Takingchargeof V.I.P. Guest Houses",
                "Teaching in Catering Schools."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Catering Officer who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least five years’ post-qualification cognate experience. or By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.  plus o least three years post-qualification cognate experience",
                "By direct appointment of a candidate possessing Higher National Diploma Dietetics of Kaduna Polytechnics plus Registration with the State Registered Dieticians."
              ],
              "AdvancementPath": "Promotion to Senior Catering Officer "
            }
          },
          {
            "Senior Catering Officer Grade Level 09": {
              "Duties": [
                "Taking charge of food stuffs and ensuring proper storage",
                "Taking charge of the Catering Department of a very large Institution.",
                "Coordinating the activities of a number of Catering Rest Houses/Guest House."
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable higher Catering Officer who has spent at least three years of the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least eight years’ post-qualification cognate experience. or By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.  plus at least six years post-qualification cognate experience By direct appointment of a candidate possessing Higher National Diploma Dietetics of Kaduna Polytechnics plus Registration with the State Registered Dieticians. plus at least three years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Catering Officer"
            }
          },
          {
            "Principal Catering Officer Grade Level 10": {
              "Duties": [
                "Taking charge of the training programmes of staff",
                "Giving lectures to Student nurses and catering staff",
                "Supervising and coordinating the activities of a number of subordinates"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Senior Catering Officer who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate of City and Guilds of London Institute in Catering-Trade Basic Training (Number 147) and in Cookery for Hotels and Catering Establishments (Numbers 150 and 151). Certificate in institutional House-Keeping and Catering of the Institutional Managements Association.Ordinary National Diploma in Hotel Keeping and Catering.  plus at least eleven years’ post-qualification cognate experience. or By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management.  plus at least nine years post-qualification cognate experience By direct appointment of a candidate possessing Higher National Diploma Dietetics of Kaduna Polytechnics plus Registration with the State Registered Dieticians. plus at least six years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Catering Officer "
            }
          },
          {
            "Assistant Chief Catering Officer Grade Level 12": {
              "Duties": [
                "Inspecting Catering Departments of Institutions to ensure high standards.",
                "Assisting the Chief Catering Officer in the formulation of policies on cateringmatters.",
                "Participating in seminars and conferences on matters relating to catering services."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Principal Catering Officer who has spent at leastthree years on the grade."
              ],
              "AdvancementPath": "Promotion to Chief Catering Officer"
            }
          },
          {
            "Chief Catering Officer Grade Level 13": {
              "Duties": [
                "Advising on catering services.",
                "Assisting in the formulation of policies on catering services including trainingprogrammes.",
                "Developing catering services.",
                "Implementing Government policies on catering.",
                "Taking charge of catering staff."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Chief Catering Officer who has spent at least three years on the grade."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      },

      {
        "Cadre": "Instructor(Catering)",
        "Grades": [
          {
            "Instructor Grade Level 07": {
              "Duties": [
                "Teaching catering subjects.",
                "Preparing notes of lessons.",
                "Keeping class attendance register and oilier relevant records.",
                "Setting questions and marking test papers.",
                "Assisting in maintaining discipline and cleanliness in the school."
              ],
              "EntryRequirements": [
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics."
              ],
              "AdvancementPath": "Promotion to Higher Instructor"
            }
          },
          {
            "Higher Instructor Grade Level 08": {
              "Duties": [
                "Teaching catering subjects.",
                "Preparing notes of lessons.",
                "Keeping class attendance register and other relevant records.",
                "Setting questions and marking test papers.",
                "Assisting in organizing group-work and educational visits for students.",
                "Assisting in maintaining discipline and cleanliness in the school"
              ],
              "EntryRequirements": [
                "By promotion of a confirmed and suitable Instructor who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics. plus at least three years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Senior Instructor"
            }
          },
          {
            "Senior Instructor Grade Level 09": {
              "Duties": [
                "Teaching Catering Subjects",
                "Preparing notes of lesson and supervising junior instructors in the preparation of lessons, experiments and demonstrations.",
                "Setting questions and marking test papers.",
                "Maintaining discipline and cleanliness in the school.",
                "Keeping class attendance register and other relevant records."
              ],
              "EntryRequirements": [
                " By promotion of a confirmed and suitable Higher Instructor who has spent at least three yearson the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics. plus at least six years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Instructor Grade II "
            }
          },
          {
            "Principal Instructor Grade II Grade Level 10": {
              "Duties": [
                "Teaching catering subjects",
                "Coordinating and monitoring a number of courses.",
                " Acting as a team leader in examining students in catering subjects.",
                "Assisting in conducting research tests and experiments on Nigerian dishes."
              ],
              "EntryRequirements": [
                "Bypromotion of a confirmed and suitable Senior Instructor who has spent at least three years on the grade.",
                "By direct appointment of a candidate possessing any of the following qualifications: Certificate in Institutional and Catering Management. Higher National Diploma in Institutional Management. Higher National Diploma in Hotel and Catering Management. National Certificate of Education in Catering Management,Domestic Science or Home Economics. plus at least nine years’ post-qualification cognate experience."
              ],
              "AdvancementPath": "Promotion to Principal Instructor Grade I"
            }
          },
          {
            "Principal Instructor Grade I Grade Level 12": {
              "Duties": [
                "Teaching students in specialized subjects.",
                "Coordinating and monitoring a number of courses.",
                "Conducting research, tests and experiments on Nigerian dishes.",
                "Acting as team leader in examining students in catering subjects.",
                "Taking-charge of curriculum review and development."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Principal Instructor Grade II who has spent at least three years on the grade.",
                "Suitable persons in this grade will be required to attend courses leading to award of Certificate in Public Administration from a recognized Institution (ASCON)."
              ],
              "AdvancementPath": "Promotion to Assistant Chief Instructor"
            }
          },
          {
            "Assistant Chief Instructor Grade Level 13": {
              "Duties": [
                "Assisting in liar administration of the school including planning courses and conducting examinations.",
                "Teaching students in one’s specialized subjects."
              ],
              "EntryRequirements": [
                "By promotion of a continued and suitable Principal Instructor Grade I whohas spent at least three years on the grade and successfully completed the trainingcourses leading to award of Certificate in Public Administration from a recognized Institution (ASCON)."
              ],
              "AdvancementPath": "Promotion to Chief Instructor"
            }
          },
          {
            "Chief Instructor Grade Level 14": {
              "Duties": [
                "Supervising the activities of a minimum number of eight Stewards/Senior Stewards."
              ],
              "EntryRequirements": [
                "By promotion of a suitable Assistant Chief Instructor who has spent at least three years on the grade and successfully completed the training courses leading to award of Certificate in Public Administration from a recognized Institution (ASCON)."
              ],
              "AdvancementPath": ""
            }
          }
        ]
      }
    ],

    "SectionMetadata": {
      "TotalCadres": 28,
      "Categories": [
        "Media and Communication",
        "Cultural Heritage",
        "Archival",
        "Creative Arts",
        "Technical Support"
      ],
      "TypicalGradeLevels": "GL 03 to GL 17 depending on cadre and seniority",
      "DepartmentFunctions": [
        "Information dissemination and public communication",
        "Cultural heritage preservation and management",
        "Archival records management and preservation",
        "Media production and creative arts development",
        "Cultural research and documentation"
      ],
      "KeySkills": [
        "Communication and media relations",
        "Cultural research and documentation",
        "Creative arts and production",
        "Heritage conservation and management",
        "Information management and dissemination"
      ],
      "TechnologyRequirements": [
        "Media production equipment",
        "Archival preservation systems",
        "Digital documentation tools",
        "Information management software",
        "Cultural heritage databases"
      ]
    }
  }
}

