
{
 
  "chapters": [
    {
      "chapter_number": 1,
      "title": "Introduction",
      "rules": [
        {
          "rule_number": "010101",
          "title": "Application",
          "content": "It shall be the duty of every officer to acquaint himself/herself with the Public Service Rules, other regulations and extant circulars. These Public Service Rules apply to all officers except where they conflict with specific terms approved by the Federal Government and written into the contract of employment or letters of appointment. In so far as the holders of the offices of: The President; The Vice President; Chief Justice of Nigeria; Justices of the Supreme Court; President and Justices of the Court of Appeal; Chief Judge and Judges of the High Court of the Federal Capital Territory; Grand Khadi and Khadis of the Sharia Court of Appeal of the Federal Capital Territory; President and Judges of the Customary Court of Appeal of the Federal Capital Territory; The Chairmen and Members of the following statutory bodies, namely: The Code of Conduct Bureau; The Federal Civil Service Commission; The Independent National Electoral Commission; The Federal Character Commission; The Code of Conduct Tribunal; The Revenue Mobilisation, Allocation and Fiscal Commission; The National Population Commission; The Police Service Commission; The Auditor-General for the Federation; And any other similar organs that derive their appointments from the Constitution of the Federal Republic of Nigeria are concerned, these Rules apply only to the extent that they are not inconsistent with the provisions of the Constitution of the Federal Republic of Nigeria in so far as their conditions of service and any other law applicable to these officers are concerned."
        },
        {
          "rule_number": "010102",
          "title": "Special Definitions",
          "content": "The special meanings with which various words and terms are used for the purpose of particular Chapters and Sections in these Public Service Rules are quoted at the beginning of such Chapters or Sections."
        },
        {
          "rule_number": "010103",
          "title": "General Definitions",
          "content": "Except where otherwise indicated by the context or in special definitions for particular Chapters the following words and terms are used with the following meanings wherever they occur in these Public Service Rules.",
          "definitions": [
            {
              "term": "Accredited Representative of the Federal Republic of Nigeria",
              "definition": "means the Diplomatic or Consular Representative of the Federal Republic of Nigeria within the area."
            },
            {
              "term": "Emolument",
              "definition": "is the total remuneration package as conveyed in the letter of appointment."
            },
            {
              "term": "Child(of a Public Servant)",
              "definition": "means a child who: (a) is under the age of 18 years; and (b)(i) is the officer's biological off-spring; or (ii) the officer's step-child being the biological offspring of a spouse of the officer; or (iii) a child adopted by the officer in accordance with any statutory provision; and (c) is entirely dependent on the officer."
            },
            {
              "term": "Civil Service",
              "definition": "is a body or organ which enjoys continuity of existence. Essentially, it covers Ministries and Extra-Ministerial Offices."
            },
            {
              "term": "Classified Correspondence",
              "definition": "means correspondence which has been graded Restricted, Confidential, Secret or Top Secret."
            },
            {
              "term": "Established Post",
              "definition": "means a post provided for under the Personal Emoluments sub-head of the estimates."
            },
            {
              "term": "Gazette",
              "definition": "means the Federal Republic of Nigeria Official Gazette"
            },
            {
              "term": "General Executive Cadre",
              "definition": "Comprises Officers holding post of: Chief Executive Officer, GL.14; Assistant Chief Executive Officer GL.13; Principal Executive Officer I, GL.12; Principal Executive Officer II, GL.10; Senior Executive Officer, GL.09; Higher Executive Officer, GL.08; Executive Officer, GL.07; Assistant Executive Officer, GL.06. It also includes officers holding corresponding\"Executive\" posts, e.g. Executive Officer(Accounts)."
            },
            {
              "term": "Head of Department",
              "definition": "means a Permanent Secretary/Head of Extra-Ministerial Office."
            },
            {
              "term": "Junior Officer",
              "definition": "means a pensionable officer on GL. 06, and below."
            },
            {
              "term": "Junior Posts",
              "definition": "are posts in Ministries/ Extra Ministerial Offices attracting emoluments on Grade Level 06 and below."
            },
            {
              "term": "Ministry",
              "definition": "includes Extra-Ministerial Offices."
            },
            {
              "term": "Monthly-Rated",
              "definition": "means employment on monthly rates of pay."
            },
            {
              "term": "Nigerian Home Place",
              "definition": "means the place in Nigeria accepted in writing by Government as the place to which a staff would naturally wish to return when spending his leave in Nigeria."
            },
            {
              "term": "Nigerian Officer",
              "definition": "means an officer other than an expatriate."
            },
            {
              "term": "Officer",
              "definition": "when used without qualification means staff in an established post, either on pensionable or contract terms"
            },
            {
              "term": "Expatriate Officer",
              "definition": "means a staff who ranks as such for the purpose of pension in accordance with the Pension Reform Act 2004"
            },
            {
              "term": "Secretarial Pool",
              "definition": "is a pool of stenographic officers for posting to any ministry or extra-ministerial office as required. It is controlled by the Permanent Secretary, Public Service Office, Office of the Head of Civil Service of the Federation"
            },
            {
              "term": "Senior Posts",
              "definition": "are posts attracting emoluments on Grade Level GL.07 and above and other posts attracting fixed emoluments of equivalent Grade Levels in Ministries/Extra-Ministerial Offices."
            },
            {
              "term": "Staff",
              "definition": "means a person employed by the Federal Government."
            },
            {
              "term": "Temporary Officer",
              "definition": "means a staff employed temporarily in an established post on non-pensionable terms."
            },
            {
              "term": "Trainee",
              "definition": "means a person appointed to a training post in any grade; it includes\"pupil\"."
            },
            {
              "term": "Wife/Husband(of an officer)",
              "definition": "means a spouse married under the Marriage Act, Customary Law or Islamic Law."
            },
            {
              "term": "Interdiction",
              "definition": "When a serious case that may lead to dismissal has been instituted against an officer, the Permanent Secretary may interdict and place him on half pay pending the determination of the case."
            },
            {
              "term": "Suspension",
              "definition": "When disciplinary proceeding for a criminal case has been instituted or is about to be instituted against an officer, he shall be suspended from office without salary pending the determination of the case."
            }
          ]
        },
        {
          "rule_number": "010104",
          "title": "Application",
          "content": "Nothing in these Public Service Rules shall be construed as limiting the powers of the Federal Government to amend or revoke any of its provisions at any time."
        },
        {
          "rule_number": "010105",
          "title": "Application of Public Service Rules to Female Servants",
          "content": "Notwithstanding that throughout the Public Service Rules the terms'Officer' and'Staff are referred to in the masculine gender, the provisions of the Rules apply equally to Female Public Servants."
        },
        {
          "rule_number": "010106",
          "title": "Public Service Rules to form part of inventory items",
          "content": "A copy of the Public Service Rules shall form part of the inventory of items in all offices of the Public Service."
        }
      ]
    },
    {
      "chapter_number": 2,
      "title": "Appointments and Leaving the Service",
      "sections": [
        {
          "section_number": "01",
          "title": "GENERAL APPOINTMENT",
          "rules": [
            {
              "rule_number": "020101",
              "title": "Authority for Appointment",
              "content": "Appointments to public offices in the Federal Civil Service are made on the authority of the Federal Civil Service Commission. These appointments are made either: (a) by letter written under the direction of the Federal Civil Service Commission; or (b) by formal agreement between the officer and the Federal Government or its appointed agents. Subject to Rules 020205, 020206 and 020207- Permanent Secretaries/Heads of Extra-Ministerial Offices are authorized to appoint eligible candidates to posts in respect of which the powers of appointment have been delegated to them."
            },
            {
              "rule_number": "020102",
              "title": "Appointment by Federal Civil Service Commission",
              "content": "(i) The Federal Civil Service Commission shall make appointment to posts graded GL.12- 17. Such appointment shall be made as the need arises into the available vacancies after advertisement. Officers intending to transfer their services shall take part in the annual Public Service Examinations for post GLS 07-10. (ii) Subject to modalities to be prescribed by the Federal Civil Service Commission from time to time, each Ministry/Extra-Ministerial Office shall select from the pool of successful candidates at the Civil Service Examination prescribed in Rule 020102. (iii) This shall be handled by the appropriate committees of each Ministry with the representatives of the Federal Civil Service Commission and Head of the Civil Service of the Federation at the meeting of the committees. (iv) There shall be an annual competitive Civil Service Entry Examination for posts graded GL. 07-10 for new entrants and serving Officers wishing to transfer from other scheduled services. This examination shall be conducted by the Federal Civil Service Commission in conjunction with the Office of the Head of Civil Service of the Federation, Administrative Staff College of Nigeria, and the Public Service Institute of Nigeria. (v) To qualify for this examination candidates must possess an Honours Degree or Higher National Diploma not below upper credit in relevant disciplines as provided for in the Schemes of Service. Final selection shall be made by the line Ministries/Extra Ministerial Offices in line with their requirements."
            },
            {
              "rule_number": "020103",
              "title": "Appointments into posts GL.06 and below",
              "content": "(a) Each Ministries/Extra Ministerial Office shall appoint Junior Staff on GL. 06 and below. This shall be handled by the Junior Staff Committee of each Ministry/Office, with a representative of the Federal Civil Service Commission and the Head of the Civil Service of the Federation at any meeting of the committee, subject to the approval of the Permanent Secretary/Head of Extra Ministerial offices, (b) Appointment in the Federal Ministries/Extra-Ministerial Offices in the States shall be from the residents of that State who possess the qualifications prescribed in the approved Schemes of Service; (c) Each Ministries/Extra-Ministerial Office shall work out the actual establishment or requirements for each State Office. The Junior Staff Committee(Local) shall conduct the interview to appoint the officers, subject to approval of the Permanent Secretary/Head of Extra Ministerial offices."
            },
            {
              "rule_number": "020104",
              "title": "Promotions to all Posts",
              "content": "Promotions to all posts in the Federal Public Service other than those of Permanent Secretaries are vested in the Federal Civil Service Commission which, has however, authorized Permanent Secretaries/ Heads of Extra- Ministerial Offices to promote eligible candidates to posts in respect of which the powers of appointment have been delegated."
            },
            {
              "rule_number": "020105",
              "title": "Incremental Date",
              "content": "The incremental date of an officer appointed or promoted to a post in the Federal Public Service shall be 1st January of every year provided such officer has spent at least six(6) months on the Grade with good performance before enjoying the increment."
            },
            {
              "rule_number": "020106",
              "title": "Seniority",
              "content": "Seniority in any department shall be determined by the entry date/the assumption of duty certified by an authorized officer as reflected in the appropriate register."
            },
            {
              "rule_number": "020107",
              "title": "Unpaid Staff Prohibited",
              "content": "The employment of unpaid staff is prohibited."
            },
            {
              "rule_number": "020108",
              "title": "Personal Records",
              "content": "(i) Permanent Secretaries/Heads of Extra-Ministerial Offices shall keep an up-to-date record of every officer under their control. Staff Record. Form Gen 60 shall be used and one copy must be sent to the Central Staff Records Office in the Office of the Head of Civil Service of the Federation, Offices of the Accountant General of the Federation and Auditor General for the Federation, National Pension Commission within one month of the appointment. Form Gen 60 shall be completed in ink. (ii) Date of birth recorded on appointment by an officer shall not be changed throughout the career of the officer. Any contravention shall be regarded as an act of serious misconduct"
            }
          ]
        },
        {
          "section_number": "02",
          "title": "RECRUITMENT",
          "rules": [
            {
              "rule_number": "020201",
              "title": "Definition",
              "content": "\"Recruitment\" means the filling of vacancies by the appointment of persons not already in the Public Service of the Federal Republic of Nigeria. It, however, excludes the transfer of officers from other Public Service in the Federation to the Federal Public Service."
            },
            {
              "rule_number": "020202",
              "title": "Types of Appointment",
              "content": "Direct appointment to the Federal Public Service may be in any of the following categories: (a) as trainees or pupils, (b) on probation in a pensionable post; (c) on non-pensionable contract to a non-pensionable post, or against a pensionable post for a specified period. (d) on temporary basis other than(c). When posts prove difficult to fill, they shall normally be advertised."
            },
            {
              "rule_number": "020203",
              "title": "Trainee",
              "content": "(a) When a candidate for employment requires additional professional experience before he can be regarded as fully qualified for appointment to a specific post, the candidate may be appointed as a trainee or pupil for a normal service of two years in the post. This period may however, be reduced in special circumstances. On completion of the \"trainee period\" the pupil may be appointed to the full grade on probation and will not be eligible for confirmation in the service until he/she has fulfilled the conditions laid down in Rule 020302 where applicable. (b) A confirmed officer who is advanced to the training grade for the purpose of acquiring the necessary experience to qualify him/her for substantive promotion to a senior post will be treated as if he/she had been seconded thereto and the period of such secondment will not normally exceed the period laid down for the training except with the special advice of the Office of Establishments and Pension."
            },
            {
              "rule_number": "020204",
              "title": "Probation",
              "content": "Except where the Federal Civil Service Commission decides otherwise, all first appointments to the pensionable establishment in posts other than trainee post(see Rule 020203) will be on probation. An officer confirmed in a lower pensionable office will not however be regarded as on probation in a higher post to which he/she is promoted nor will an officer seconded or transferred as confirmed officer from pensionable service elsewhere."
            },
            {
              "rule_number": "020205",
              "title": "Eligibility for Appointment",
              "content": "To be eligible for appointment into the Federal Public Service, every applicant must: (a) not be less than 18 years and not more than 50 years of age; (b) possess such minimum qualification as may be specified from time to time including computer literacy.; (c) be certified by an authorized HealthCare Provider as medically fit for Government Service; (d) possess a testimonial of good conduct from last employer or if not previously employed, from the last school or college attended; and (e) possess requisite qualifications as provided for in the scheme of service. (f) No officer shall be appointed into the Federal Public Service without authorization for appointment from the Office of the Head of the Civil Service of the Federation and supervisory Boards in the case of Parastatals."
            },
            {
              "rule_number": "020206",
              "title": "Prior Approval in Certain Cases",
              "content": "(a) no candidate shall be appointed to any post in the Federal Public Service without the prior specific approval of the Federal Civil Service Commission if: (i) the candidate has been convicted of a criminal offence; or (ii) he/she has previously been employed in government Service and been dismissed or called upon to resign or retire there from. Such approval must always be obtained irrespective of any delegation of the Commission's powers (iii) In view of Rule(a) above, every applicant for employment by Government must state: (i) Whether he/she has been convicted of a criminal offence; (ii) all employment he/she has engaged in; and (a) if he/she has left any employment, why he/ she did so; or (b) if he/she is still in any employment and whether he/she is under any obligation to remain in it; (iii) whether he/she is free from financial embarrassment."
            },
            {
              "rule_number": "020207",
              "title": "Procedure for Appointment",
              "content": "(a) All applicants for senior posts shall complete form FC.2 to be submitted to the Federal Civil Service Commission. The Commission shall process these forms and publish short listed names for the examination prescribed in Rule 020102(iii). (b) For appointment to pensionable establishment. Form No. Gen. 60 should accompany the copy of Form No. Gen 69C sent to the Office of the Head of the Civil Service of the Federation, offices of the Accountant of the Federation and Auditor-General for the Federation and National Pensions Commission."
            },
            {
              "rule_number": "020208",
              "title": "Personal Particulars",
              "content": "Immediately a newly appointed officer assumes duty, he/she shall be required to enter his/her personal particulars on Form Gen. 60 (Staff Records Form) a copy of which shall be attached to the appropriate documents forwarded to the Pension Fund Administrator/National Pension Commission and other relevant Offices/Departments."
            },
            {
              "rule_number": "020209",
              "title": "Oath of Secrecy",
              "content": "It is the duty of every Permanent Secretary/Head of Extra Ministerial Office to ensure that all officers/staff in his/her Ministry/Extra-Ministerial Office sign an Oath of Secrecy on Security Form 1 and that the oath so signed are carefully preserved."
            },
            {
              "rule_number": "020210",
              "title": "Secret Society Prohibition of Membership",
              "content": "No public officer shall become a member of any secret society. Any public officer who is a member of such society shall renounce his membership forthwith by making a statutory declaration to that effect, or resign his appointment, or retire from the service."
            },
            {
              "rule_number": "020211",
              "title": "Contravention",
              "content": "Contravention of Rule 020210 shall be regarded as an act of serious misconduct and shall attract appropriate disciplinary action which may include dismissal from service."
            }
          ]
        },
        {
          "section_number": "03",
          "title": "RULES FOR APPOINTMENT ON PROBATION",
          "rules": [
            {
              "rule_number": "020301",
              "title": "Period of Probation",
              "content": "Officers on probation will be required to serve for two years before being confirmed in the service. This period may however be reduced to not less than six months by deduction of any previous period of Public Service rendered satisfactorily in posts of cognate status involving similar duties. The period of probation shall not exceed two years unless an extension is approved by the Federal Civil Service Commission; such extension may result in the incremental penalty referred to in Rule 040206, if the Commission so decides."
            },
            {
              "rule_number": "020302",
              "title": "Compulsory Examination",
              "content": "Within his probationary period an officer is required to pass the prescribed examination appropriate to his appointment. (a) For officers holding senior posts, the prescribed examinations are those described in Chapter 6 and such other examinations as may be specified in individual offer of appointment. (b) For clerical grade officers, the prescribed examination is the promotion/confirmation examination. (c) The examinations for technical grades are those prescribed in the Scheme of Service applicable to the particular post."
            },
            {
              "rule_number": "020303",
              "title": "Confirmation or Termination at the end of probationary period",
              "content": "To be eligible for confirmation in the Permanent Establishment, an officer appointed on probation is required to pass the prescribed examination, if any, during his probationary period and to complete his probationary period to the satisfaction of the authority empowered to appoint him. At the end of the period of probation the officer will, unless his probationary appointment is terminated or extended, be confirmed in his appointment."
            },
            {
              "rule_number": "020304",
              "title": "Confirmation of Officer holding Senior Post",
              "content": "Recommendations of Permanent Secretaries/Heads of Extra Ministerial Offices regarding the confirmation of all officers holding senior posts shall be made in the progress report prescribed in Chapter 5 of the Rules."
            }
          ]
        },
        {
          "section_number": "04",
          "title": "RULES FOR APPOINTMENT ON CONTRACT",
          "rules": [
            {
              "rule_number": "020401",
              "title": "Definition",
              "content": "A contract appointment is a temporary appointment(which does not provide for the payment of a pension) to a post of the level to which appointment is made by the Federal Civil Service Commission for a specific period as opposed to appointment on pensionable terms and temporary employment. The contract appointment must be recorded in a formal document of agreement."
            },
            {
              "rule_number": "020402",
              "title": "Rules for Appointment on Contract",
              "content": "(a) The conditions of service of a contract officer are those provided for in his/her contract and the privileges, emoluments or allowances described in these Rules do not apply to him/her unless they are specifically so stated in the contract itself. Any question of the interpretation of a contract affecting his/her conditions of service should be referred to the Office of the Head of the Civil Service of the Federation. (b)(i) Contract appointments may be offered to expatriates only when suitable Nigerians are not available. Nigerians may be appointed on contract terms if: (a) they are pensioners; (b) they are 50 years of age or over at the time they are being appointed; (c) they specifically request to be employed on contract terms and it is deemed in the best interest of the service; and (d) the candidate possesses specialized competencies or skills and provided such posts are duly advertised in at least three national newspapers. (ii) For non-Nigerians, the provisions of the Public Service Rules regarding contract appointments shall apply in all cases, except for those persons married to Nigerians (See Appendix 1). (iv) Spouses married to Nigerians should remain on contract until granted Nigerian citizenship before being considered for appointment.(See Appendix I)"
            },
            {
              "rule_number": "020403",
              "title": "Duration of Appointment",
              "content": "The duration of a contract appointment is limited to the period specified in the contract itself and any further employment of the officer concerned must be made subject of a new contract."
            },
            {
              "rule_number": "020404",
              "title": "Termination during current contract",
              "content": "(a) An appointments on contract may be terminated by the Government at any time in accordance with the terms specified in the contract itself. A recommendation to the Federal Civil Service Commission for the termination of the appointment of a contract officer shall be accompanied by a full statement of the consideration which has prompted it. On receipt of the recommendation, the Federal Civil Service Commission will decide in its discretion whether the appointment shall be terminated forthwith in accordance with the terms of the contract or whether the officer should be offered an opportunity, to submit any formal representation if he/she so wishes before a final decision is taken. (b) The termination of contract appointment by the holder is subject to the terms of the contract and any question concerning the waiving of any of the penalty under a contract agreement shall be referred to the Office of the Head of Civil Service of the Federation."
            },
            {
              "rule_number": "020405",
              "title": "Re-engagement (responsibility of Contract officer)",
              "content": "An officer serving on contract who desires re-engagement, shall so inform the government in writing through the Permanent Secretary/Head of Extra- Ministerial Office not less than four months before his/her leave is due. In the absence of such notification it may be assumed that an officer serving on contract does not desire re-engagement."
            },
            {
              "rule_number": "020406",
              "title": "Re-engagement (responsibility of Permanent Secretary)",
              "content": "On receipt of such notification expressing an officer's wish to be re-engaged, the Permanent Secretary/Head of Extra- Ministerial Office will obtain the consent of the Office of the Head of the Civil Service of the Federation to the re-engagement before forwarding recommendation to the Federal Civil Service Commission enclosing an up-to-date confidential report on the officer(unless such report has been forwarded within the previous two months). In reply the Permanent Secretary/Head of Extra-Ministerial Office will receive any of the following: (a) authority to inform the officer that arrangements will be made to offer him re-engagement during the course of his leave, and the details of the terms proposed. The Permanent Secretary/Head of Extra-Ministerial Office shall inform the officer accordingly without delay. (b) the original and duplicate of the re-engagement contract duly signed on behalf of government. In this case the Permanent Secretary/Head of Extra-Ministerial Office shall obtain the officer's witnessed signature to both copies, deliver the duplicate to the officer, and return the original to the Office of the Head of the Civil Service of the Federation."
            },
            {
              "rule_number": "020407",
              "title": "Earlier Notification of Non-Re-engagement",
              "content": "As soon as it is clear to a Permanent Secretary/Head of Extra -Ministerial Office that he/she will be unable for whatever reasons, to recommend the re-engagement of an officer serving on contract, he will seek the approval of the Federal Civil Service Commission to inform the officer that he/she will not be re-engaged and, on receipt of such approval, will inform the officer without delay."
            },
            {
              "rule_number": "020408",
              "title": "Continuity of Contract Service",
              "content": "Provided re-engagement is completed by the signing of a new contract before the end of vacation leave granted under an expiring contract, service under the new contract will be treated as continuous."
            },
            {
              "rule_number": "020409",
              "title": "Deferred Leave",
              "content": "If a re-engaged contract officer is required to return to duty under his new contract before the expiration of the leave due under the former contract, the leave foregone will be treated as deferred leave to be enjoyed under the conditions of the new contract."
            },
            {
              "rule_number": "020410",
              "title": "Incremental Date",
              "content": "When an officer on contract is re-engaged in his/her former office without a break in service and on the same emoluments, he will retain the incremental date enjoyed under his/her former contract. In other cases of re-engagement without break in service, the incremental date of a re-engaged contract officer will be fixed in accordance with such rules as may be applicable in the circumstance on the basis that the commencing date of the new contract is the date on which he/she resumes duty there under."
            },
            {
              "rule_number": "020411",
              "title": "Appointment of retired officers on contract",
              "content": "Retired officers may only be re-engaged into career posts on grade levels immediately below that on which they retired,"
            },
            {
              "rule_number": "020412",
              "title": "Promotion",
              "content": "Reference should be made to Rule 020708."
            }
          ]
        },
        {
          "section_number": "05",
          "title": "TRANSFERS AND SECONDMENTS",
          "rules": [
            {
              "rule_number": "020501",
              "title": "Definition",
              "content": "(a) Transfer is the permanent release of an officer from one Scheduled service to another or from one class to another within the same service. (b) Secondment means the temporary release of an officer to the service of another Government, approved body or any recognized International Organisation or body for a specified period."
            },
            {
              "rule_number": "020502",
              "title": "Procedure for Transfer/Secondment",
              "content": "Inter-Service Transfer/Secondment: The following procedures shall apply in processing inter- service transfer and secondment: (i) Applications for Transfer/Secondment to posts graded GL06 and below shall be determined by the Ministry/Extra-Ministerial Office of the applicant's choice. (ii) That applicant for Transfer/Secondment to post graded GL 07-10 in any Ministry/Extra-Ministerial Office shall be determined by the Federal Civil Service Commission. Since GL 07- 10 is an entry point, Officers seeking transfer from scheduled establishments are required to sit for the Annual Competitive Civil Service Entry Examination. (iii) Confidential reports covering the last three years(or whole service if less than three years) of the officer's service shall be furnished. (iv) Secondment of an officer to the service of another Government, or Approved Body or recognized International Organization at his own request shall be for a maximum period of two years in the first instance after which the officer must apply for extension, seek for transfer or return to his former post. All extensions must be approved by the appropriate Committees and the Federal Civil Service Commission. The total period of such secondment must not exceed four(4) years. (v) If it is in the public interest to second an officer to the service of another Government, approved body or recognized International Organisation, the period of secondment shall not be limited and the officer shall continue to hold his substantive post and be entitled to increment and promotion and will be treated as having been posted on special duty. (vi) During the period of such Secondment the benefiting organization shall be responsible for the officer ' s personal emoluments."
            },
            {
              "rule_number": "020503",
              "title": "Inter-Departmental Transfers",
              "content": "(a) Senior Posts- Transfers from one senior post to another or from one class to another within the Federal Public Service require the prior approval of the Federal Civil Service Commission and an officer must have served for a minimum period of 6 months in his original Department before seeking transfer to another Department, An application for such transfer must be submitted to the Permanent Secretary/Head of Extra-Ministerial Office of the applicant and must state the applicant's reasons for desiring a transfer and his qualifications for the work to be undertaken. Such application should be forwarded to the Federal Civil Service Commission by the Permanent Secretary/Head of Extra-Ministerial Office together with a statement as to: (i) how the applicant has performed his/her duties; (ii) whether the applicant is considered to be well qualified for the post desired; (iii) recommendations as to the grant or refusal of the application. (b) Junior Posts- Transfers from one junior post to another within the Federal Public Service or from one Department to another may be arranged, with the consent of the officers being considered for transfer, at the mutual discretion of their Permanent Secretaries/Heads of Extra-Ministerial Offices."
            },
            {
              "rule_number": "020504",
              "title": "Transfer from Clerical Assistant to Clerical Officer",
              "content": "To be eligible for transfer from the post of Clerical Assistant to the Clerical Officer Grade, an officer must have: (a) obtained the full minimum educational qualifications for direct appointment to the Clerical Officer Grade; or (b) passed the Clerical Confirmation/Promotion test at promotion level."
            },
            {
              "rule_number": "020505",
              "title": "Salary on Transfer",
              "content": "The emoluments and incremental date at which a Clerical Assistant enters the scale of the Clerical Officer Grade on transfer is governed by Rule 040103."
            },
            {
              "rule_number": "020506",
              "title": "Condition to be met for transfer",
              "content": "(i) No applicant shall be considered for. transfer- on-promotion to any Ministry/Extra-Ministerial Office except in response to an advertised post.(i) An applicant shall be considered for transfer: (a) if he/she has been confirmed in his previous service and his qualifications, experience and career progression are in accordance with the scheme of service of the grade; (b) provided the contemplated transfer would in no way jeopardize the promotion prospects of serving officers; (c) where the Ministry is satisfied that there are vacancies not only in the relevant grade but also in the applicant's discipline or area of specialty; (d) if he has served in his current grade for the stipulated minimum number of years prescribed for promotion to an advertised post. (ii) Posting of officers within the Ministry to posts outside their professional cadres should be prohibited."
            }
          ]
        },
        {
          "section_number": "06",
          "title": "ACTING APPOINTMENT",
          "rules": [
            {
              "rule_number": "020601",
              "title": "When made",
              "content": "When it is necessary that a particular duty post(of status not lower than Senior Clerical Officer) should continue to be filled at a time when no officer of corresponding substantive rank is available for posting thereto, some other officer may, with the approval of the Federal Civil Service Commission, be formally appointed, by notice in the gazette, to act in the duty post and assume either fully or in part, the duties and responsibilities thereof."
            },
            {
              "rule_number": "020602",
              "title": "Not made Unless Necessary",
              "content": "The mere fact that the substantive holder of a duty post will be absent there from for a short period(e.g. on casual leave or on sick leave) does not in itself justify an acting appointment; there may however be circumstances(such as compliance with statutory provisions) which necessitate the making of an acting appointment for a relatively brief period. The decision whether an acting appointment is necessary or desirable in any particular case will rest with the Federal Civil Service Commission."
            },
            {
              "rule_number": "020603",
              "title": "Not a form of trial promotion",
              "content": "Acting appointments are not intended as a means of testing the suitability of officers for promotion; they will normally be made only in order to fill posts that are temporarily vacant and their duration should be limited accordingly."
            },
            {
              "rule_number": "020604",
              "title": "Procedure",
              "content": "Recommendations for acting appointments must be forwarded to the Federal Civil Service Commission on General Form 66 and must include thereon a certificate to the effect that the acting officer will assume the full duties and responsibilities of the post in question. Approved acting appointment will be gazetted by the Federal Civil Service Commission but it will on no account be back-dated to a period in excess of six months of the date of receipt of the recommendation by the Commission"
            },
            {
              "rule_number": "020605",
              "title": "Date of Commencement",
              "content": "The date on which an acting appointment commences will be indicated in the gazette notice authorizing the appointment. Normally the gazette date of commencement will be that on which the acting officer takes over the duties and responsibilities of the post, except that if he takes over from the substantive holder the gazetted date of commencement will not be earlier than that on which the latter, after handing over: (a) leaves the station or the post (b) takes over substantively or himself commences to act in another post in the same station, or (c) commences vacation leave in the same station, whichever'is applicable according to circumstances."
            },
            {
              "rule_number": "020606",
              "title": "Date of Cessation",
              "content": "The date on which an acting appointment ceases will be indicated in the gazette notice reverting the officer's appointment. Normally, the gazetted date of cessation will be that on which the acting officer relinquishes the duties and responsibilities of the post, except that if he hands over to the substantive holder, the gazetted date of cessation will not normally be later than the date on which the latter, before taking over: (a) arrives the station, (b) ceases to hold substantively, or act in another post in the same station, (c) ceases vacation leave in the same station, whichever is applicable according to circumstances; and (d) Ministries shall be required to notify the Federal Civil Service Commission when officers revert from acting appointments by completion of Form No. Gen. 15A which shall be forwarded not less than two weeks before cessation of the acting appointment."
            },
            {
              "rule_number": "020607",
              "title": "Effect of Casual or Special Leave",
              "content": "An acting officer will not be regarded as relinquishing the duties and responsibilities of his acting appointment by proceeding on casual or special leave within the country, provided he spends such leave in Nigeria(or on a sea voyage between Nigerian ports) and provided it is not necessary during any such leave to appoint another officer to act in the duty post in question."
            }
          ]
        },
        {
          "section_number": "07",
          "title": "PROMOTIONS",
          "rules": [
            {
              "rule_number": "020701",
              "title": "Eligibility",
              "content": "(a) Except where powers of appointment or promotion have been delegated, no promotion shall become effective until they have been approved by the Federal Civil Service Commission. (b) All officers who fall within the field of selection for any promotion exercise shall be considered except those who are under disciplinary action. The minimum number of years that an officer must spend in a post before being considered eligible for promotion shall be as follows: Grade Level of Staff 06 and below - Minimum of 2 years; 07-14 - Minimum of 3 years; 15-17 - Minimum of 4 years (c) Promotions shall be made strictly on the basis of competitive merit from amongst all eligible candidates. (i) In assessing the merit of officers, a clear distinction shall be made between their records of performance or efficiency in lower grades and their potential for promotion, i.e. ability and competence to perform the duties and responsibilities of the higher post efficiently. (ii) Seniority and previous records of performance will be taken into account in choosing between candidates with equal potential for promotion. (iii) In all cases, however, a generally satisfactory record of conduct shall also be considered. (d) The responsibility for the promotion of officers shall be as follows: (i) GL.06 and below- by the Ministry/Extra-Ministerial Office. (ii) GL.07- 14- by the Ministry/Extra-Ministerial Office or the relevant Staff pool subject to confirmation by Federal Civil Service Commission. (iii)GL.15- 17- by the Federal Civil Service Commission on recommendation from Ministry/Extra-Ministerial Office or the relevant pool routed through the Head of the Civil Service. (e) All promotions are subject to satisfying minimum requirements declared by Federal Civil Service Commission and availability of vacancies."
            },
            {
              "rule_number": "020702",
              "title": "Procedure",
              "content": "Before each promotion exercise, the appropriate office shall compile a list of all eligible candidates to be considered, the list being prepared on the basis of the job requirement or set of criteria established for the post by the Office of the Head of the Civil Service of the Federation, e.g. qualification/experience, age, training, performance, etc., as contained in the scheme of service. Furthermore: (a) There shall be structured and sustained training for career progression in the service including continuous professional training and development. (b) Officers shall qualify for promotion to higher grade after acquiring the skill and competence as provided in the scheme of service for the particular cadre."
            },
            {
              "rule_number": "020703",
              "title": "From junior to Senior post",
              "content": "The appropriate committee shall meet to interview and consider to officers holding junior appointments in the Ministry/Extra-Ministerial Office who may be recommended to the Federal Civil Service commission which shall examine the suitability of the officers so recommended and offer them promotion to existing vacancies."
            },
            {
              "rule_number": "020704",
              "title": "Effective Date",
              "content": "The effective date of all promotions shall be 1st January of the year for which the promotion exercise was conducted or as may be determined by the Federal Civil Service Commission."
            },
            {
              "rule_number": "020705",
              "title": "From one junior post to another",
              "content": "Permanent Secretaries/Heads of Extra-Ministerial Offices shall fill one junior vacancies on posts on GL. 06 and below on the recommendation of the Junior post Staff Committee."
            },
            {
              "rule_number": "020706",
              "title": "Officers on leave of absence, secondment etc. to sit for promotion examination",
              "content": "Officers on approved Leave of Absence, Secondment, approved Leave with Pay, Special Assignment, etc., shall not be granted notional promotion. Such officers shall sit for promotion interviews/examinations at designated centres nearest to them."
            },
            {
              "rule_number": "020707",
              "title": "Notional Promotions",
              "content": "An Officer who has passed the compulsory examination for confirmation in the service shall be eligible for promotion notwithstanding the fact that he has not completed the probationary period specified in Rule 020301."
            },
            {
              "rule_number": "020708",
              "title": "Promotion of a Contract Officer",
              "content": "Under normal circumstances, no contract officer will be considered for promotion except where there is no suitable pensionable officer available or where he possesses exceptional qualification and suitable experience. He could, however, be considered for an enhanced appointment during the renegotiation of his contract."
            }
          ]
        },
        {
          "section_number": "08",
          "title": "LEAVING THE SERVICE",
          "rules": [
            {
              "rule_number": "020801",
              "title": "Termination of appointment during probationary period",
              "content": "If within his probationary period it is established to the satisfaction of the authority empowered to appoint an officer that he is not qualified for efficient service, his appointment may be terminated by that authority at any time without any further compensation than free transport to the place from which he was engaged and such free transport will be granted only if his conduct has been good. Provided the termination is not due to misconduct on the officer's part, it will be effected by means of a month's notice and, subject to the same proviso, if the officer is eligible for vacation leave in respect of his/her service to date, such leave may be granted together with(if the officer so desires) normal vacation leave transport grant in lieu of the free transport mentioned above. Such leave, if any, shall be so arranged as to take place within the period of notice and, if possible, to expire on the same day as the notice. The position regarding the refund of the cost of any training given the officer is governed by the bond relating to such training."
            },
            {
              "rule_number": "020802",
              "title": "Relinquishment of Appointment during probation period",
              "content": "If an officer relinquishes his/her appointment within the period of his/her probationary service he may be required to refund any expenditure by government in transporting him, his/her family, servant and baggage to and from the place at which he/she has been employed and he/she will not be eligible for any facilities from government towards transport from the station at which he/she is then serving. The position regarding the refund of the cost of any training given the Officer is governed by the bond relating to such training"
            },
            {
              "rule_number": "020803",
              "title": "Termination",
              "content": "The appointment of an officer on probation who fails to secure confirmation in the pensionable establishment at the expiration of his/her probationary period, including such extension thereof as prescribed under Rule 020301, may be terminated in the manner specified in Rule 020801."
            },
            {
              "rule_number": "020804",
              "title": "Resignation",
              "content": "(a) An Officer who resigns will be liable to: (i) forfeit all claims to vacation leave; any vacation leave or passage privileges granted will be ex-gratia; (ii) refund to the Government in full any sum of money which he/she may be owing to Government or which, under the provisions of other Rules or agreements entered into with Government, is refundable to Government for his/her not discharging the obligations set out in such agreement; provided that any or all of such refunds may be waived at the discretion of the Government. (b) By virtue of the provisions of Regulation 15 of the Pension Reform Act 2004, all previous pensionable service is forfeited on resignation and cannot be taken into account for pension purposes if the officer is subsequently re-employed except where, under certain circumstances, such a break in service has been condoned by the Office of Establishments and Pension."
            },
            {
              "rule_number": "020805",
              "title": "Leaving the Service during a leave year",
              "content": "An Officer who leaves the service other than by resignation or dismissal will be eligible for proportionate leave in accordance with Rule 100211. If he/she has enjoyed more leave during the leave year than he/she is eligible to receive under that Rule, he/she will be required to refund salary at the rate at which it was paid for the number of working days' leave enjoyed in excess of what he/she was eligible to receive, the days in respect of which salary is refunded being treated as leave without pay for pension purposes. This provision will be waived in the case of an officer who dies in the service"
            },
            {
              "rule_number": "020806",
              "title": "Leaving the Service on grounds of failing an examination or abolition of office or reorganisation",
              "content": "(i) Officers who fail promotion examination on three(3) consecutive attempts on the same grade and whose on-the-job performance has been assessed to be below average shall be required to leave the service, (ii) An Officer whose service is no longer required in the event of abolition of office, re-organisation of the office or redundancy shall be required to leave the service."
            },
            {
              "rule_number": "020807",
              "title": "Compulsory Contributions",
              "content": "All Pensionable officers shall participate in the Contributory Pension Scheme as provided for in the Pension Reform Act, 2004."
            },
            {
              "rule_number": "020808",
              "title": "Processing of retirement benefits",
              "content": "In order to ensure that officers receive their retirement benefits promptly, Departmental Pension Officers are required to forward the up-to-date record of service of these officers accompanied with the under-listed documents: (a) Pension Form Gen. 62(in duplicate) with two recent colour passport photographs; (b) Birth certificate or sworn Declaration of Age; (c) Record of Service; (d) Acceptance of retirement letter; (e) Letter of Appointment or Gazette Publication of First Appointment; (f) Letter of Confirmation of Appointment or gazette publication; (g) Clearance Certificate signed by the Director of Administration/ Personnel Management; (h) Clearance Certificate of Non-Indebtedness signed by the Director of Administration/Personnel Management; (i) Evidence of last promotion (j) Current Personnel Emolument Card/Last Pay Certificate; (k) Evidence of Transfer of Service(where applicable); (l) Evidence of condonation and merger of Service(where applicable); (m) Carbon copy of audited computation sheet of terminal benefits; (n) Signed payment voucher for receipt of gratuity(if applicable); and (o) Stamped Death Certificate(for deceased officers)."
            },
            {
              "rule_number": "020809",
              "title": "Forwarding of Departmental Files",
              "content": "Forwarding of Departmental Files and other documents not expressly mentioned in Rule 020808 shall no longer be a condition for processing of retirements benefits."
            },
            {
              "rule_number": "020810",
              "title": "Compulsory retirement",
              "content": "(i) The compulsory retirement age for all grades in the Service shall be 60 years or 35 years of pensionable service whichever is earlier. (ii) No officer shall be allowed to remain in service after attaining the retirement age of 60 years or 35 years of pensionable service whichever is earlier. (iii) The provision of(i) and(ii) of the Rule is without prejudice to prevailing requirements for Judicial officers and Academic Staff of Universities who retire at 70 and 65 years respectively. (iv) Provided the officer would not have attained the retirement age of 60 years or spent 35 years of pensionable service, whichever is earlier; (a) a Director shall compulsorily retire upon serving eight years on the post; and (b) a Permanent Secretary shall hold office for a term of four years and renewable for a further term of four years, subject to satisfactory performance, and no more."
            }
          ]
        },
        {
          "section_number": "09",
          "title": "CERTIFICATES OF SERVICE",
          "rules": [
            {
              "rule_number": "020901",
              "title": "Application",
              "content": "All officers including those on non-pensionable appointments shall be issued, on leaving the service, Certificate of Service."
            },
            {
              "rule_number": "020902",
              "title": "Authority",
              "content": "Certificates of Service should be issued to officers holding senior posts on GL. 07 and above, require the countersignature of the Permanent Secretary of the retiring officer, Permanent Secretary, Federal Civil Service Commission; those to be issued to officers holding junior posts GL. 06 and below, require the countersignature of the Permanent Secretary of the retiring officer and the Permanent Secretary Establishments and Pension Office."
            },
            {
              "rule_number": "020903",
              "title": "Object",
              "content": "The main purpose of a Certificate of Service is that it may be used as a reference covering the holder's public service when seeking other employment. Accordingly, a Permanent Secretary/Head of Extra Ministerial Office should, when completing a Certificate give in it that information which he himself, were he in a position of a prospective employer, might fairly expect to obtain from the person who has previously employed the holder."
            },
            {
              "rule_number": "020904",
              "title": "Forms",
              "content": "Certificate of Service shall be rendered in triplicate on the approved Forms as follows: For Officers on G.L. 07 and above- Form Gen. 58; For Officers on G.L. 06 and below- Forms Gen. 58A"
            },
            {
              "rule_number": "020905",
              "title": "Timing",
              "content": "Action to complete the issue of a Certificate of Service should be taken in time for the Certificate to be handed to the recipient before he proceeds on leave prior to leaving the service. If it is necessary to include in the Certificate of Service of any Officer any adverse comment on his work or conduct, the Certificate of Service must be completed and handed to him in time to permit him to make, before leaving the service, any representations on the subject that he may desire to put forward for Government ' s consideration"
            }
          ]
        },
        
{

  "section_number": "10",
  "title": "Schedule of Contract Terms for Engaged Personnel",
  "clauses": [
    {
      "clause_number": 1,
      "title": "Terms of Engagement",
      "subclauses": [
        {
          "id": "1(i)",
          "content": "The term of the engagement of the person engaged is [number] years, commencing from the date of assumption of duty."
        },
        {
          "id": "1(ii)",
          "content": "The term of the engagement shall be deemed to be completed on the date on which any leave granted to the person engaged in respect of such tour of service expires."
        }
      ]
    },
    {
      "clause_number": 2,
      "title": "Duties",
      "subclauses": [
        {
          "id": "2(i)",
          "content": "The duties of the person engaged shall include the usual duties of the office to which he/she is appointed and any other duties which the Government may call upon him/her to perform."
        },
        {
          "id": "2(ii)",
          "content": "The person engaged shall reside in such place and occupy himself/herself in such manner as the Government, through its duly authorized officers, shall direct, and he/she will not, either directly or indirectly be engaged in or concerned with any other service or business whatsoever or receive commission or profits of any kind, but will devote the whole of his/her time and attention to the service of the Government. He/She will conform to the Public Service Regulations of the Government."
        }
      ]
    },
    {
      "clause_number": 3,
      "title": "Emoluments",
      "subclauses": [
        {
          "id": "3(i)",
          "content": "The term 'Emoluments' wherever it appears in this Schedule (except in clause 4) shall be deemed to include contract addition where this is payable under the Agreement."
        },
        {
          "id": "3(ii)",
          "content": "Increments of emoluments, if any, shall be calculated as from the first day of the month in which the person engaged takes up his/her appointment."
        },
        {
          "id": "3(iii)",
          "content": "Increments of emoluments shall not be granted unless the efficiency, conduct and diligence of the person engaged during the year immediately preceding have been satisfactory. An increment shall not be withheld except on the decision/recommendation to that effect by the Permanent Secretary/Head of Extra-Ministerial Office."
        },
        {
          "id": "3(iv)",
          "content": "The salary of the person engaged may be liable to deduction under clause 8."
        }
      ]
    },
    {
      "clause_number": 4,
      "title": "Travelling Allowance",
      "content": "When travelling on duty away from duty post, the person engaged shall be subject to such regulations with regard to the provisions of transport and travelling allowance as the Government may decide."
    },
    {
      "clause_number": 5,
      "title": "Ill-health",
      "subclauses": [
        {
          "id": "5(i)",
          "content": "If the person engaged is compelled by reason of ill-health (not caused by his/her own negligence) to resign his/her appointment, or if at any time it shall be certified by a duly qualified HealthCare Provider employed by the Government that he/she is incapable by reason of any infirmity of mind or body of rendering further efficient service, the Government shall pay such salary as may be due up to the date of such resignation or the date on which a certificate in that respect was issued."
        },
        {
          "id": "5(ii)",
          "content": "A certificate duly signed by a qualified HealthCare Provider employed by the Government, shall be conclusive evidence on the question whether or not the person engaged was compelled to resign his/her appointment by reason of ill-health within the meaning of this clause."
        }
      ]
    },
    {
      "clause_number": 6,
      "title": "Dismissal",
      "content": "If the person engaged shall at any time neglect or refuse or from any cause (except ill-health not caused by his/her own negligence) become unable to perform any of his/her duties or to comply with any order, or shall disclose any information in respect of the affairs of the Government to any unauthorized person, or shall in any manner misconduct himself/herself, the Government may dismiss him/her, and on such dismissal all rights and advantages reserved to him/her by this Agreement shall cease."
    },
    {
      "clause_number": 7,
      "title": "Termination of Engagement",
      "subclauses": [
        {
          "id": "7(i)",
          "content": "The Government may at any time terminate the engagement of the person engaged by giving three months' notice in writing or by paying one month's salary in lieu of notice."
        },
        {
          "id": "7(ii)",
          "content": "The person engaged may, at any time after the expiration of three months of service terminate his/her engagement by giving to the Government three month's notice in writing, or by paying to the Government one month's salary in lieu of notice."
        }
      ]
    },
    {
      "clause_number": 8,
      "title": "Liability to Make Good Damage",
      "content": "In the event of any pecuniary damage arising from the person engaged disregarding or failing to comply with any order, standing order or departmental instruction or from any neglect of duty whatsoever on his/her part, he/she may be liable to a deduction from his/her salary to make good the damage or any part thereof, the amount of which shall be fixed by his/her Permanent Secretary/Head of Extra-Ministerial Office."
    },
    {
      "clause_number": 9,
      "title": "Further Employment",
      "content": "Four months before the date of expiration of agreement, the person engaged shall give a written notice to Government stating desire to remain in its employment and Government shall thereupon decide whether it will offer him/her further employment. If Government decides in favour, his/her re-engagement shall be on such terms and for such a period as may be mutually agreed."
    },
    {
      "clause_number": 10,
      "title": "Gratuity",
      "content": "The person engaged will be eligible for a gratuity on the satisfactory completion of a tour of service at the rate of 15% of his/her basic salary, provided that his/her engagement is not terminated as under clause 7 and provided that he/she not in receipt of, nor eligible for, any other retiring benefits."
    },
    {
      "clause_number": 11,
      "title": "Leave",
      "content": "While leave of absence is not a legal right included in the contract, the person engaged, after a tour of service, or if declared invalid before completing the tour, or his/her engagement is terminated by reason of ill-health in accordance with the provisions of clause 5 hereto, leave may be granted under the rules in force from time to time, applicable to Nigerian officers of a similar grade level so far as exigencies of the Public Service permit."
    }
  ]
}

      ]
    },
    {
     "chapter_number": 3,
  "title": "DISCIPLINE",
  "sections": [
    {
      "section_number": "01",
      "title": "INTRODUCTION",
      "rules": [
        {
          "rule_number": "030101",
          "title": "Knowledge of Disciplinary Rules",
          "content": "It shall be the duty of every officer to acquaint himself/herself with the disciplinary rules and any other regulations in force."
        },
        {
          "rule_number": "030102",
          "title": "Authority and Delegation",
          "content": "The power to dismiss and to exercise disciplinary control over officers in the Federal Public Service is vested in the Federal Civil Service Commission. This power may be delegated to any member of the Commission or any officer in the Federal Civil Service."
        },
        {
          "rule_number": "030103",
          "title": "Delegated Powers",
          "content": "The Federal Civil Service Commission has delegated full disciplinary powers to Permanent Secretaries and Heads of Extra-Ministerial Offices in respect of officers on Salary G.L. 13 and below with the exception of the power of dismissal which has been delegated only from G.L. 06 and below."
        }
      ]
    },
    {
      "section_number": "02",
      "title": "GENERAL INEFFICIENCY",
      "rules": [
        {
          "rule_number": "030201",
          "title": "Definition",
          "content": "General inefficiency consists of a series of omissions or incompetence the cumulative effect of which shows that the officer is not capable of discharging efficiently the duties of the office he holds."
        },
        {
          "rule_number": "030202",
          "title": "Drawing Attention To Shortcoming",
          "content": "It shall be the duty of every superior officer, as soon as he/she observes any fault or shortcoming in the work of an officer subordinate to him/her, to bring it to the officer's notice and to record that such has been done, with a view to improving the officer's usefulness and efficiency in the service."
        },
        {
          "rule_number": "030203",
          "title": "Removal for General Inefficiency",
          "content": "Before the proceedings for the removal of an officer for general inefficiency may be commenced, he/she must have been warned on three occasions in writing."
        },
        {
          "rule_number": "030204",
          "title": "Performance of Duties",
          "content": "No female public servant shall be required to resign her appointment or retire by reason of pregnancy alone, but if her condition interferes with the efficient performance of her duties, she may at the discretion of Management be given lighter duties."
        },
        {
          "rule_number": "030205",
          "title": "Removal of Temporary Staff for Inefficiency",
          "content": "Permanent Secretaries/Heads of Extra-Ministerial Offices are authorized, subject to the provisions of the Labour Act(Cap. 198) and of individual letters of consideration for appointment(Form Gen. 69 and Gen. 69A), to terminate the employment of temporary staff at their discretion provided that prior to the termination of any such staff the officer has been informed of the grounds on which it is proposed to terminate his/her appointment and has been given an opportunity to submit representations on why he or she should not be terminated. Similarly, prior to the termination of the officer's service for inefficiency, such staff shall be warned of his/her shortcomings and given opportunity to improve or to offer a satisfactory explanation of his/her failure to perform his duties efficiently."
        },
        {
          "rule_number": "030206",
          "title": "Withholding of Increment: Delegated Powers",
          "content": "(a) Immediately a Permanent Secretary/Head of Extra-Ministerial Office, in the exercise of his/her delegated powers, decides to withhold or defer the increment of an officer, he/she shall so inform the officer in writing, stating the reason and, in the case of deferment, the period of deferment. (b) Where the powers are not delegated, and the Permanent Secretary/Head of Extra-Ministerial Office considers that the increment of an officer should be withheld or deferred he/she shall report the circumstances and his/her recommendations as to the withholding or period of deferment to the appropriate committee for a decision. If the decision is that the increment should be withheld or deferred, the Permanent Secretary/Head of Extra-Ministerial Office will thereupon inform the officer in writing, stating the reason and, in the case of deferment, the period of deferment. If the committee decides that the increment should be granted, the Permanent Secretary/Head of Extra-Ministerial Office will take action in accordance with Rule 030307. (c) In all cases of withholding or deferment of increment, the Permanent Secretary/Head of Extra-Ministerial Office shall inform the Accountant-General of the Federation and the Auditor-General for the Federation."
        },
        {
          "rule_number": "030207",
          "title": "Notification of Defects",
          "content": "Immediately on deciding to grant an increment despite some defects in the service of an officer, a Permanent Secretary/Head of Extra-Ministerial Office should bring the defect to the notice of the officer."
        },
        {
          "rule_number": "030208",
          "title": "Effective Date of Termination for Inefficiency",
          "content": "In all cases of termination for inefficiency, notice of termination shall be given. The period of notice shall be one calendar month unless other period is appropriate in the light of a particular officer's terms of service. If it is decided that the officer shall leave the service immediately, he/she shall be paid emolument equivalent to the period of the notice. The period of notice shall include any leave to which the officer is entitled. If the leave is longer than the period of notice, the officer shall be sent on leave and the period of notice absorbed by the leave."
        }
      ]
    },
    {
      "section_number": "03",
      "title": "MISCONDUCT",
      "rules": [
        {
          "rule_number": "030301",
          "title": "Definition",
          "content": "Misconduct is defined as a specific act of wrong-doing or an improper behaviour which is inimical to the image of the service and which can be investigated and proved. It can also lead to termination and retirement. It includes: (a) Scandalous conduct such as: (i) Immoral behaviour; (ii) Unruly behaviour; (iii) Drunkenness; (iv) Foul language; (v) Assault; (vi) Battery; (b) Refusal to proceed on transfer or to accept posting; (c) Habitual lateness to work; (d) Deliberate delay in treating official document; (e) Failure to keep records; (f) Unauthorized removal of public records; (g) Dishonesty; (h) Negligence; (i) Membership of cults; (j) Sleeping on duty; (k) Improper dressing while on duty; (l) Hawking merchandise within office premises; (m) Refusal to take/carry out lawful instruction from superior officers; (n) Malingering; (o) Insubordination; (p) Discourteous behaviour to the public."
        },
        {
          "rule_number": "030302",
          "title": "Issuing Query",
          "content": "As soon as a superior officer becomes dissatisfied with the behaviour of any officer subordinate to him/her, it shall be his/her duty so to inform the officer in writing giving details of unsatisfactory behaviour and to call upon him/her to submit within a specific time such written representation as he/she may wish to make to exculpate himself/herself from disciplinary action. After considering such written representations as the officer may make within the specified time the superior officer shall decide whether: (a) the officer has exculpated himself/herself in which case, he/she shall be so informed in writing and no further action shall be necessary or (b) the officer has not exculpated himself/herself but it is considered that he/she should not be punished in which case the appropriate formal letter of advice shall be issued to him/her and he/she shall be required to acknowledge its receipt in writing, or (c) the officer has not exculpated himself/herself and deserves some punishment, in which case Rule 030304 shall apply."
        },
        {
          "rule_number": "030303",
          "title": "Recommendations of Tribunals Inquiry",
          "content": "Where a Tribunal of Inquiry set up by the Government makes recommendations of a disciplinary nature on an officer, the Federal Civil Service Commission shall not act on such recommendations until it has called upon the affected officer to reply to the allegations made against him/her by the Tribunal of Inquiry. If the officer refuses or neglects to reply to the allegations within a reasonable time or at all, the Federal Civil Service Commission or its agent shall proceed to accept and enforce the recommendations of the Tribunal of Inquiry and take such disciplinary action against the officer as it shall deem appropriate."
        },
        {
          "rule_number": "030304",
          "title": "Reporting Misconduct",
          "content": "(a) It shall be the duty of every officer to report any case of misconduct that comes to his/her notice to an officer superior to the officer involved. (b) When an officer's misconduct is brought to the notice of his/her superior officer, it shall be the duty of that superior officer to report it to the Permanent Secretary/Head of Extra-Ministerial Office without delay. If he/she considers it necessary that the officer should be interdicted, such recommendations shall be made in the report. (c) On receiving the report, the Permanent Secretary/Head of Extra-Ministerial Office shall take action in accordance with Rule 030306 as appropriate and, if necessary, shall interdict the officer. (d) At the appropriate point in the investigation, the officer may be suspended in accordance with Rule 030405."
        },
        {
          "rule_number": "030305",
          "title": "Disciplinary Procedure for Misconduct and Serious Misconduct",
          "content": "If it is represented to the Federal Civil Service Commission that an officer has been guilty of misconduct and the Commission does not consider the alleged misconduct serious enough to warrant proceedings under Rule 030306 with a view to dismissal, it may cause an investigation to be made into the matter in such a manner as it considers proper and the officer shall be entitled to know the whole case made against him/her, and shall have adequate opportunity of making his/her defence. If as a result the Commission decides that the allegation is proved, it may inflict any other punishment upon the officer such as reduction in rank, withholding or deferment of increment or otherwise."
        },
        {
          "rule_number": "030306",
          "title": "Postponement of Disciplinary Proceedings",
          "content": "Any disciplinary proceedings against a female staff which might otherwise have been taken during the period of her maternity leave shall be postponed until the leave has expired. Such postponement, however, shall not in any way prejudice the proceedings against her."
        },
        {
          "rule_number": "030307",
          "title": "Notification in Writing",
          "content": "Unless the method of dismissal is otherwise provided for in these Rules, an officer in the Federal Public Service may be dismissed by the Federal Civil Service Commission only in accordance with this Rule. (i) The officer shall be notified in writing of the grounds on which it is proposed to discipline him/her. The query should be precise and to the point. It must relate the circumstances of the offence, the rule and regulation which the officer has broken and the likely penalty. In serious cases which are likely to result in dismissal, the officer should be given access to any such document(s) or report(s) used against him/her and he/she should be asked to state in his/her defence that he/she has been given access to documents. The officer shall be called upon to state in writing, within the period specified in the query any grounds upon which he/she relies to exculpate himself/herself; (ii) The query, or preliminary letter, shall be in the format shown in Appendix II; (iii) If the officer submits his/her representations and the Federal Civil Service Commission is not satisfied that he/she has exculpated himself/herself, and considers that the officer should be dismissed, it shall take such action accordingly. Should the officer however fail to furnish any representations within the time fixed, the Commission may take such action against the officer as it deems appropriate; (iv) If upon considering the representations of the officer the Commission is of the opinion that the officer does not deserve to be dismissed from the Service but deserves some other punishment, it shall impose on the officer such punishment as it considers appropriate; (v) Where necessary, the Commission may set up a board of inquiry which shall consist of not less than three persons one of whom shall be appointed chairman by the Commission. The members of the board shall be selected with due regard to the status of the officer involved in the disciplinary case and to the nature of the complaint which is the subject of inquiry. The head of the officer's department shall not be a member of the board; (vi) The officer shall be informed that, on a specific day, the question of his/her dismissal shall be brought before the board and he/she shall be required to appear before it to defend himself/herself and shall be entitled to call witnesses. His/her failure to appear shall not invalidate the proceedings of the board; (vii) Where witnesses are called by the board to give evidence before it, the officer shall be entitled to put questions to the witnesses and no documentary evidence shall be used against the officer unless he/she has previously been supplied with a copy thereof or given access thereto; (viii) If during the course of the inquiry further grounds for dismissal are disclosed, and the Federal Civil Service Commission thinks it fit to proceed against the officer upon such grounds, the officer shall, by the direction of the Commission, be furnished with a written statement thereof and the same steps shall be taken as prescribed above in respect of the original grounds; (ix) The board having inquired into the matter shall make a report to the Commission. If the Commission considers that the report should be amplified in any respect or that further inquiry is desirable, it may refer any matter back to the board for further inquiry or report. The Commission shall not itself hear witnesses; (x) If upon considering the report of the board together with the evidence and all material documents relating to the case, the Commission is of the opinion that the officer should be dismissed, such action shall immediately be taken; (xi) If the Commission does not approve the officer's dismissal and does not consider that any penalty should be imposed, the officer shall be reinstated forthwith and be entitled to the full amount of salary denied him/her if he/she was interdicted or suspended; (xii) If upon considering the report of the board the Commission is of the opinion that the officer does not deserve to be dismissed but that the proceedings disclosed grounds for requiring him/her to retire, the Commission shall, without further proceedings, direct accordingly; and (xiii) All disciplinary procedures must commence and be completed within a period of 60 days except where it involves criminal cases."
        },
        {
          "rule_number": "030308",
          "title": "Working for Institutions or Government Agencies during Office Hours",
          "content": "No officer may render professional assistance to institutions or Government Agencies during working hours or accept remuneration for it, except with the written permission of the Permanent Secretary/Head of Extra-Ministerial Office which could be granted if it is in the public interests to do so. The amount of the remuneration must be paid into the Treasury on deposit until the orders of Government as to the share, if any, which may be received by the officer is known."
        },
        {
          "rule_number": "030309",
          "title": "Fines",
          "content": "No fine shall be imposed on any officer as a punishment for an offence committed in the course of his/her duties."
        },
        {
          "rule_number": "030310",
          "title": "Powers to Surcharge",
          "content": "(a) If at any time the public revenue sustains a loss by reason of the neglect or fault of an officer, he/she will be liable to be surcharged with the amount and any sums due to him/her from Government may be withheld in satisfaction of such surcharge. (b) Officers defined as workers in Section 2 of the Labour Act(Cap. 198) may be surcharged if the circumstances warrant such action, but all papers relevant to the case must be submitted in accordance with the Act, to the warrant of the Federal Ministry of Labour and Productivity for approval of the surcharge."
        },
        {
          "rule_number": "030311",
          "title": "Money Lending",
          "content": "An officer shall not lend money at interest, whether on mortgage or otherwise, or guarantee or stand as surety for money lent on interest, to any other person. Nothing in this rule shall be deemed to prevent members of registered co-operative societies or approved benefit societies from standing as sureties for loans made by the societies, or shall it be deemed to prevent any officer from placing money in a deposit account in any bank or standing surety for money lent by Government to another officer."
        },
        {
          "rule_number": "030312",
          "title": "Hawking Merchandise on Duty",
          "content": "Officers are prohibited from hawking merchandise or engaging in any other form of trading on office premises during working hours."
        },
        {
          "rule_number": "030313",
          "title": "Dress Code",
          "content": "No officer shall appear in the office or anywhere in his official capacity dressed in a manner considered inappropriate or immodest."
        },
        {
          "rule_number": "030314",
          "title": "Unofficial Testimonials",
          "content": "In order to prevent the irregular use by non-officials of letters of recommendations or certificates of character, officers are prohibited from giving, in their official capacities, letters or certificates whether on official stationery or otherwise."
        }
      ]
    },
    {
      "section_number": "04",
      "title": "SERIOUS MISCONDUCT",
      "rules": [
        {
          "rule_number": "030401",
          "title": "Definition",
          "content": "Serious misconduct is a specific act of very serious wrongdoing and improper behaviour which is inimical to the image of the service and which can be investigated and if proven, may lead to dismissal."
        },
        {
          "rule_number": "030402",
          "title": "Examples",
          "content": "Serious acts of misconduct include: (a) Falsification of records; (b) Suppression of records; (c) Withholding of Files; (d) Conviction on a criminal charge(other than a minor traffic or sanitary offence or the like); (e) Absence from duty without leave; (f) False claims against Government Officials; (g) Engaging in partisan political activities; (h) Bankruptcy/serious financial embarrassment; (i) Unauthorized disclosure of official information; (j) Bribery; (k) Corruption; (l) Embezzlement; (m) Misappropriation; (n) Violation of Oath of Secrecy; (o) Action prejudicial to the security of the State; (p) Advance Fee Fraud (Criminal Code 419); (q) Holding more than one full-time paid job; (r) Nepotism or any other form of preferential treatment; (s) Divided loyalty; (t) Sabotage; (u) Wilful damage to Public property; (v) Sexual Harassment; and (w) Any other act unbecoming of a Public Officer."
        },
        {
          "rule_number": "030403",
          "title": "Procedure",
          "content": "Disciplinary procedure for serious misconduct shall be in accordance with Rules 030302 to 030306."
        },
        {
          "rule_number": "030404",
          "title": "Interdiction",
          "content": "(i) When a serious case that may lead to dismissal has been instituted against an officer, the Permanent Secretary/Head of Extra-Ministerial Office may interdict him/her on not more than half pay pending the determination of the case. (ii) Recommendations to the Commission for interdiction shall be made only if it is against the public interest that the officer should continue to perform any of the duties of his/her rank. When the charge against him/her is such that the continued performance of his/her present duties is against the public interest or prejudicial to the investigation of the charge against him/her, consideration shall be given to putting him/her on alternative duties. Interdiction shall only be resorted to when this is not possible. (iii) When an officer is interdicted, he/she shall cease to report for duty. In the letter informing the officer of his/her interdiction it shall be indicated that the proportion of emoluments he/she is to receive while on interdiction shall be 50% of his/her emoluments. (iv) If proceedings under Rule 030404(i) reveal that he/she is not guilty of the charge made against him/her, the officer shall immediately be reinstated and shall receive the full amount of his/her emoluments denied him/her while he/she was interdicted. (v) If the officer is found guilty but is not dismissed, he/she may be refunded such portion of the emoluments denied him/her as the Commission may determine."
        },
        {
          "rule_number": "030405",
          "title": "Responsibility of Interdicted Officer",
          "content": "(a) An officer who is under interdiction or suspension shall notify his/her Permanent Secretary/Head of Extra-Ministerial Office of his/her intention to leave his/her station. He/she shall however not leave the country without the specific approval of the Head of the Civil Service of the Federation. (b) An officer under interdiction is also responsible for keeping his/her Ministry/Extra-Ministerial Office informed of the address at which instructions to him/her can be delivered. (c) If he/she fails to comply with the instructions delivered to him/her at such address within seven days of such delivery, he/she will be regarded as absent from duty without leave."
        },
        {
          "rule_number": "030406",
          "title": "Suspension",
          "content": "Suspension should not be used as a synonym for interdiction. It shall apply where a prima facie case, the nature of which is serious, has been established against an officer and it is considered necessary in the public interest that he/she should forthwith be prohibited from carrying out his/her duties. Pending investigation into the misconduct, the Federal Civil Service Commission or the Permanent Secretary/Head of Extra-Ministerial Office(if within his/her delegated powers) shall forthwith suspend him/her from the exercise of the powers and functions of his/her office and from the enjoyment of his/her emolument."
        },
        {
          "rule_number": "030407",
          "title": "Dismissal and its Effects",
          "content": "The ultimate penalty for serious misconduct is dismissal. An officer who is dismissed forfeits all claims to retiring benefits, leave or transport grant etc subject to the provisions of the Pension Reform Act 2004."
        },
        {
          "rule_number": "030408",
          "title": "Effective Date of Dismissal",
          "content": "When an officer is dismissed, no notice or emolument in lieu shall be given to him/her and his/her dismissal shall take effect from the date on which he/she is notified thereof. This date shall be notified by the Permanent Secretary/Head of Extra-Ministerial Office concerned to the Federal Civil Service Commission and to the Office of Establishments and Pension, as soon as possible. Where the officer concerned seeks to evade this official notification, the effective date shall be: (a) that on which he/she is served with the notification, even though he/she may refuse to acknowledge receipt; or (b) the date on which the notification is delivered by messenger to his/her recorded address, even though the officer concerned does not himself/herself acknowledge receipt of such delivery; or (c) the date on which the notification is sent by post to his/her last known or normal address in accordance with the definition of \"service by post\" in Section 26 of the Interpretation Act(Cap. 192)."
        },
        {
          "rule_number": "030409",
          "title": "Officer to Report Criminal Charge and its Outcome",
          "content": "An officer must, under pain of disciplinary action, promptly report to his/her Permanent Secretary/Head of Extra-Ministerial Office whenever he/she is charged of criminal offence, and must report the outcome of the charge."
        },
        {
          "rule_number": "030410",
          "title": "Effect of Criminal Proceedings",
          "content": "If an officer is convicted on a criminal charge, the Commission shall consider the proceedings of the court and if it is of the opinion that the officer should be dismissed or subjected to some lesser penalty on account of the offence for which he/she has been convicted, the officer may thereupon be dismissed or otherwise punished without any of the procedures prescribed in Rule 030306 being followed."
        },
        {
          "rule_number": "030411",
          "title": "Effect of Criminal Proceedings",
          "content": "(a) Nothing shall prevent disciplinary action being taken or continued against an officer whether or not: (i) Criminal proceedings have been instituted with respect to such a person in any court of law in Nigeria or elsewhere or are about to be instituted or are contemplated; or (ii) the grounds upon which any criminal charge are based or are to be based are substantially the same as those upon which the disciplinary proceedings were or are to be instituted; (b) An officer acquitted of a criminal offence shall not be penalized for any charge of which he/she has been acquitted, but nothing in this rule shall prevent him/her being dismissed or otherwise punished on any other charges arising out of his/her conduct in the matter, provided that such charges do not raise substantially the same issue as those of which he/she has been acquitted. If the Commission thinks fit, the usual procedure may be followed for the purpose."
        },
        {
          "rule_number": "030412",
          "title": "Suspension of Convicted Officers",
          "content": "An officer convicted of criminal offence(other than a minor traffic or sanitary offence and the like) shall be suspended with effect from the date of conviction, pending determination of his/her case by the Commission."
        },
        {
          "rule_number": "030413",
          "title": "Absence Without Leave",
          "content": "Any officer who absents himself/herself from duty or travels out from Nigeria without leave renders himself/herself liable to be dismissed from the service and the onus shall rest on him/her, to show that the circumstances do not justify the imposition of the full penalty."
        },
        {
          "rule_number": "030414",
          "title": "Serious Financial Embarrassment",
          "content": "(1) For the purpose of these rules, the expression \"serious financial embarrassment\" means the state of an officer's indebtedness which, having regard to the amount of debts incurred by him/her, has actually caused serious financial hardship to him/her, and, without prejudice to the general meaning of the said expression, an officer shall be deemed to be in serious financial embarrassment: (a) if the aggregate of his/her unsecured debts and liabilities at any given time exceed the sum of three times his/her monthly emoluments; (b) where he/she is a judgement debtor, for as long as the judgement debt remains unsettled; or (c) where he/she is adjudged bankrupt or insolvent wage earner, for as long as he/she remains an undischarged bankrupt or as the case may be for as long as any judgement against him/her in favour of the official assignee remains unsatisfied. (2) Serious financial embarrassment from whatever cause shall be regarded as necessarily impairing the efficiency of an officer and rendering him/her liable to disciplinary action. (3) If such embarrassment is caused by imprudence or other reprehensible cause, the officer concerned shall be liable to immediate dismissal and the onus shall rest on him/her to show that the circumstances do not justify the imposition of the full penalty. (4) It shall be the duty of the Registrars of all courts of competent jurisdiction to report to the appropriate Permanent Secretary/Head of Extra-Ministerial Office that the officer has become a judgement debtor. (5) When the fact that an officer has become a judgement debtor or a party to accommodation bills or promissory notes is brought to the notice of his/her Permanent Secretary/Head of Extra-Ministerial Office, the latter shall call upon him/her to submit a statutory declaration in the prescribed form(Gen. 74) disclosing all his/her liabilities. (6) Otherwise a Permanent Secretary/Head of Extra-Ministerial Office may take such action as appears to him/her necessary when an officer becomes financially embarrassed; and if he/she considers it undesirable that the officer should be retained in the Civil Service, he/she shall initiate the appropriate disciplinary proceedings. (7) As long as an officer is in serious financial embarrassment, he/she shall be disqualified from promotion or acting in a higher appointment."
        },
        {
          "rule_number": "030415",
          "title": "Oath of Secrecy",
          "content": "It shall be the duty of every Permanent Secretary/Head of Extra-Ministerial Office to ensure that all officers, employees and temporary staff in his/her Ministry/Extra-Ministerial Office who have access to classified or restricted papers have signed the Oath of Secrecy in the appropriate form before they are granted such access and that the declarations so signed are safely preserved. To facilitate this action in respect of officers holding junior posts, the Oath of Secrecy is incorporated in the revised Form No. Gen. 75."
        },
        {
          "rule_number": "030416",
          "title": "Unauthorized Disclosure of Official Information",
          "content": "Every officer is subject to the Official Secrets Act,(Cap. 335)(reproduced as Appendix at the end of this Rule or Chapter) and is prohibited from disclosing to any person, except in accordance with official routine or with the special permission of Government, any article, note, document or information entrusted to him/her in confidence by any person holding office under any Government in the Federal Republic of Nigeria, or which he/she has obtained in the course of his/her official duties. Similarly, every officer shall exercise due care and diligence to prevent the knowledge of any such article, note, document or information being communicated to any person against the interest of the Government."
        },
        {
          "rule_number": "030417",
          "title": "Abstraction or Copying of Official Documents",
          "content": "Every officer is prohibited from abstracting or copying official minutes, records or other documents except in accordance with official routine or with special permission of his Permanent Secretary/Head of Extra-Ministerial Office."
        },
        {
          "rule_number": "030418",
          "title": "Secret Personal Records",
          "content": "Officers shall not, as a general rule, have access to official and secret records relating personally to themselves."
        },
        {
          "rule_number": "030419",
          "title": "Removal of Public Records",
          "content": "No officer may, on leaving the public service take with him/her any public record without the written permission of the Permanent Secretary in the Office of Establishments and Pension."
        },
        {
          "rule_number": "030420",
          "title": "Removal of Historical Documents",
          "content": "Historical manuscripts or other documents of public interest which may be discovered by any officer in the course of his/her official duties may not be appropriated to his/her own use, but their existence must be reported to Government in order that steps may be taken for their examination and preservation."
        },
        {
          "rule_number": "030421",
          "title": "Publication and Public Utterances",
          "content": "(i) Except in pursuance of his/her official duties, no officer shall, without the express permission of his/her Permanent Secretary/Head of Extra-Ministerial Office, whether on duty or on leave of absence: (a) act as the editor or take part directly or indirectly in the management of or in any way make financial contribution to any newspaper, magazine or journal except the following: (i) Departmental or staff magazine; (ii) Professional journal; (iii) Publication of voluntary organization; (b) contribute to, whether anonymously or otherwise, or publish in any newspaper, magazine or periodical, or otherwise publish, cause to be published in any manner anything which may reasonably be regarded as of a political or administrative nature; (c) speak in public or broadcast on any matter which may reasonably be regarded as of a political or administrative nature; (d) allow himself/herself to be interviewed or express any opinion for publication on any question of a political or administrative nature or on matters affecting the administration, public policy, defence or military resources of the Federation or any other country. (ii)(a) In considering whether or not permission for the proposed publication is to be granted, the Permanent Secretary/Head of Extra-Ministerial Office shall have regard to the interest of the Government and the public, and may, if he/she considers it necessary, seek the opinion of other appropriate Permanent Secretaries/Heads of Extra-Ministerial Offices. (b) On the submission to the Permanent Secretary/Head of Extra-Ministerial Office of a brief outline of the scope of the proposed publication and the method of the treatment to be applied thereto, the Permanent Secretary/Head of Extra-Ministerial Office, may give a provisional permission for the proposed publication; provided that not final permission thereof shall be granted unless a full and complete manuscript thereof shall have been submitted to the Permanent Secretary/Head of Extra-Ministerial Office, and he/she is satisfied that the proposed publication is not against the interest of the Government or the public. (iii) Nothing in this Rule shall be deemed to prevent an officer from publishing in his own name, by writing, speech or broadcast, matters relating to a subject of general interest which does not contain a criticism of any officer, Minister, official and Ministerial statements or actions, or which can be regarded as of a political or administrative nature; provided that in so publishing any matter compiled with Government sanction from official records, he/she gives prominence to a disclaimer of Government responsibility for its accuracy."
        },
        {
          "rule_number": "030422",
          "title": "Political Activities",
          "content": "No officer shall, without express permission of the Government, whether on duty or leave of absence: (a) hold any office, paid or unpaid, permanent or temporary, in any political organization; (b) offer himself/herself or nominate anyone else as a candidate for any elective public office including membership of a Local Government Council, State or National Assembly; (c) indicate publicly his support of or opposition to any party, candidate or policy; (d) engage in canvassing in support of political candidates; (e) Nothing in this rule shall be deemed to prevent an officer from voting at an election."
        },
        {
          "rule_number": "030423",
          "title": "Resignation Before Seeking Elective Office",
          "content": "Resignation is necessary before seeking elective public office. Howbeit, any officer wishing to engage in partisan political activities or seek elective public office shall resign his/her appointment forthwith."
        },
        {
          "rule_number": "030424",
          "title": "Investments",
          "content": "(a) Public officers are not prohibited from holding shares in both public and private companies operating in Nigeria or abroad except that they must not be Directors in private companies, and may only be Directors in public companies if nominated by Government. (b) A public Officer, whenever required to do so by his/her Permanent Secretary/Head of Extra-Ministerial Office, shall disclose within three working days, in confidence, full information about any investments held by him/her or his/her immediate family whether held in their own names or the names of other persons or otherwise. Where an officer is called upon to divest himself/herself of investments which are likely to lead to public scandal or are likely to be construed as an indication that the officer has abused his/her public position for his/her private advantage, and he/she fails to comply within six months, the matter shall be reported to the Federal Civil Service Commission for necessary action."
        },
        {
          "rule_number": "030425",
          "title": "Prohibition of Private Practice",
          "content": "In accordance with the provisions of the Regulated and other Professions Private Practice Prohibition Act,(Cap.390) Part II, no officer shall engage in private practice. However, exemptions shall be granted to private Medical Practitioners and Law Lecturers in the Universities."
        },
        {
          "rule_number": "030426",
          "title": "Mineral Discoveries",
          "content": "It is the duty of every officer to report to Government any discovery of what he/she considers to be valuable minerals. Officers are prohibited, under pain of dismissal, from giving any information on such valuable discoveries to any syndicate, company or individual and deriving any benefit there from. Upon the report of such discovery, it shall be within the discretion of the Government to make the report public or to withhold it."
        },
        {
          "rule_number": "030427",
          "title": "Seeking Influence of Prominent Persons",
          "content": "No officer shall seek the influence of prominent persons or any other person for ensuring the due consideration of his/her claims in matters connected with discipline or with a view to obtaining consideration for appointment, transfer, promotion or postings."
        },
        {
          "rule_number": "030428",
          "title": "Posting and Residence",
          "content": "Every officer shall discharge any duties assigned to him/her by Government and accept liability of being stationed wherever his/her presence is considered to be most useful."
        },
        {
          "rule_number": "030429",
          "title": "Paid Appointment During Leave",
          "content": "An officer on leave of absence shall not accept any paid employment without previously obtaining the express approval of the Office of Establishments and Pension."
        },
        {
          "rule_number": "030430",
          "title": "Private Agency",
          "content": "No officer shall undertake any private agency in any matter connected with the exercise of his/her public duties."
        },
        {
          "rule_number": "030431",
          "title": "Statement on Appointment",
          "content": "Concealment of any of the facts which an applicant for Government employment is required to make in compliance with Rule 020207 or any false statement in that regard or in any application for employment shall be regarded as sufficient grounds for non-employment or for subsequent termination of appointment without notice if the falsehood is detected after engagement."
        },
        {
          "rule_number": "030432",
          "title": "Borrowing Money",
          "content": "(1) No officer may borrow money either as principal or as surety or in any manner which places himself/herself under a financial obligation to a person whether in the public service of the Federation or a State or otherwise, being a person: (a) who is directly or indirectly subject to his/her official authority; (b) who resides, possesses land or carries on business within the local limits of his official authority; (c) with whom the officer has or is likely to have official dealings; or (d) who is a registered money-lender. For the purpose of this rule, the word \"person\" shall include a body or persons corporate or non-corporate. (2) An officer may, however, borrow from banks, insurance companies, cooperative societies or incur debts through acquiring goods by means of a hire-purchase agreement provided that: (a) the bank, insurance companies, co-operative societies from which the officer borrows or the person with whom he/she signs a hire-purchase agreement are not directly or indirectly subject to his/her official authority and do not have such official dealings with the officer as may lead to public scandal or be construed as an abuse of his/her public position for his/her private advantage; and (b) the aggregate of his/her debts does not or is not likely to cause him/her serious financial embarrassment as defined under Rule 030414. (3) Subject to paragraph (2) above an officer may incur the following debts, provided that the aggregate of his/her debts is not likely to cause him/her serious financial embarrassment: (a) sums borrowed on the security of land charged or mortgaged, where the said sums do not exceed the value of the said land; (b) overdrafts allowed by banks; (c) sums borrowed from insurance companies on security of policies; (d) sums borrowed from Government or co-operative societies; or (e) sums due on goods acquired by means of hire-purchase agreement."
        },
        {
          "rule_number": "030433",
          "title": "Presents in Recognition of Service",
          "content": "(a) No officer or his family shall accept gifts or presents, whether in the form of money or otherwise, from any person in recognition or anticipation of service rendered or to be rendered by virtue of his/her official position. These rules shall not be regarded as applying to small personal gifts such as may be exchanged between colleagues and friends. If an officer is in doubt as to the propriety of receiving and retaining a gift, he/she may consult his Permanent Secretary/Head of Extra-Ministerial Office. (b) Gifts from traditional rulers, Chiefs and other persons which cannot be refused without giving offence shall be handed over to the Government. When presents are received on behalf of the Government in ceremonial intercourse they shall be handed over to the Government and any returned presents shall be given at Government expense."
        },
        {
          "rule_number": "030434",
          "title": "Prohibition of Bribery and Corruption",
          "content": "In order to improve Public Service management, and enhance accountability and transparency, no officer shall receive any bribe or engage in corrupt practices."
        }
      ]
    },
    {
      "section_number": "05",
      "title": "CONDUCT PREJUDICIAL TO THE SECURITY OF THE STATE",
      "rules": [
        {
          "rule_number": "030501",
          "title": "Conduct Prejudicial to State Security",
          "content": "Where a Committee comprising members from the Federal Ministry of Justice, Office of Establishments and Pension is satisfied that an officer has committed a misconduct involving the security of the State or prejudicial to it the officer shall be subject to the normal disciplinary procedure provided that the punishment for such misconduct shall be aggravated."
        }
      ]
    },
    {
      "section_number": "06",
      "title": "RETIREMENT IN PUBLIC INTEREST",
      "rules": [
        {
          "rule_number": "030601",
          "title": "Retirement in Public Interest",
          "content": "Notwithstanding the provisions of this Chapter, if the Federal Civil Service Commission considers that it is desirable in the Public interest that an officer should be required to retire from service on grounds which cannot suitably be dealt with by the procedures laid down in rule 030305, it shall call for a full report from the Permanent Secretary/Head of Extra-Ministerial Office in which the Officer has served; and if, considering that report and giving the Officer an opportunity of submitting a reply to the complaints by reason of which his retirement is contemplated, the Commission is satisfied, having regard to the conditions of service, the usefulness of the Officer thereto and all other circumstances of the case, that it is desirable in the public interest to do so, it shall retire the Officer and the Officer's service shall accordingly terminate on such date as the Commission may specify. In every such case, the question of pension and gratuity will be dealt with under the Pensions Reform Act, 2004."
        }
      ]
    }
  ]
},
{
  "chapter_number": 4,
  "title": "EMOLUMENTS AND INCREMENT",
  "sections": [
    {
      "section_number": "01",
      "title": "EMOLUMENTS",
      "rules": [
        {
          "rule_number": "040101",
          "title": "Payment of Emoluments",
          "content": "Financial Regulations contain guidance on the payment of emoluments and wages."
        },
        {
          "rule_number": "040102",
          "title": "Emoluments on appointment",
          "content": "On first appointment, emolument shall, as a general rule be paid as from the date of assumption of duty."
        },
        {
          "rule_number": "040103",
          "title": "Emoluments on transfer from other Government",
          "content": "On transfer from another Government to the Federal Public Service a staff shall be eligible for the emolument attached to his/her new office with effect from the day he/she assumes duty."
        },
        {
          "rule_number": "040104",
          "title": "Emoluments on promotion within incremental scales",
          "content": "Except in a case of a promotion from a non-pensionable to a pensionable office, the following rules shall apply where an officer is promoted in the ordinary course within Federal Public Service to an office carrying emolument on an incremental scale:\n(i) If the officer is promoted to a Grade Level that does not overlap his/her old Grade Level, he/she will be placed at the minimum point of his/her new Salary Grade Level.\n(ii) If his/her emolument in the former post is higher than the minimum point of the new Salary Grade Level, he/she will be placed on the next point, higher than his/her former emolument after taking into consideration the increment he/she would have earned if he/she had not been promoted."
        }
      ]
    },
    {
      "section_number": "02",
      "title": "INCREMENT RULES",
      "rules": [
        {
          "rule_number": "040201",
          "title": "Definition",
          "content": "Increment is a predetermined amount added to the annual emolument of an officer every calendar year."
        },
        {
          "rule_number": "040202",
          "title": "Earned Increments",
          "content": "An officer on an incremental Grade Level shall normally be granted an increment unless he/she is on interdiction/suspension or has a disciplinary action pending against him/her or on account of poor performance."
        },
        {
          "rule_number": "040203",
          "title": "Incremental Date",
          "content": "The incremental date of an officer appointed or promoted to a post in the Federal Public Service shall be 1st January of the year following at least six months of service or promotion."
        },
        {
          "rule_number": "040204",
          "title": "Ground for withholding or deferring",
          "content": "The grant of an increment may be deferred or withheld in accordance with the provisions of Chapter 4. In deciding which penalty to impose or recommend, a Permanent Secretary/Head of Extra-Ministerial Office will take into account the gravity of the shortcoming and the quality of the officer's previous service, bearing in mind that to withhold an increment is a more serious penalty than to defer it."
        },
        {
          "rule_number": "040205",
          "title": "Deferred increment",
          "content": "An officer's increment is deferred when the decision as to whether or not it shall be granted is postponed for a increment specific period. The period must be fixed at the time the increment is deferred and must not be less than three months nor more than six months. If less than six months in the first instance, it may, if necessary, be increased to six months by additional specific deferment. If a deferred increment is eventually granted it does not become effective until the day following the expiration of the specific period of deferment. However, the recipient retains his/her original incremental date for subsequent increments. If a deferred increment is not granted at or before the expiration of six months from the date it was originally due it must be withheld.\n\nExample: if an officer who is due to proceed from N147,968 to N152,950 per annum on 1-1-2005 had his increment deferred for three months his salary shall remain at N147,968 until 31-3-2005 when his/her Permanent Secretary/Head of Extra-Ministerial Office must decide whether or not to grant the deferred increment. If he/she grants it, the officer draws monthly emolument at N152,950 for the period 1-4-2005 to 31-12-2005(i.e. the remaining nine months) and retains his/her original incremental date of 1st January for consideration of his next increment to N157,932."
        },
        {
          "rule_number": "040206",
          "title": "Withheld increment",
          "content": "An officer's increment is withheld when it is decided not to grant it and that he/she shall cease to be eligible thereof until his/her next incremental date. The withholding of an increment thus results in the emolument of the officer in question remaining for the rest of his incremental service one increment behind what it would have been had the increment not been withheld(unless the Federal Civil Service Commission exercises the authority described in Rule 040208).\n\nExample: An officer due to proceed from N147,968 to N152,950 per annum on 1-1-2005 had his/her increment withheld. His/her emolument should remain at N147,968 throughout the period 1-1-2005 to 31-12-2005 and he/she cannot proceed to N152,950 until 1-1-2006, his/her next incremental date."
        },
        {
          "rule_number": "040207",
          "title": "Special Increments to mitigate lasting effect of withheld increment",
          "content": "An increment deferred or withheld cannot be restored with retrospective effect in consequence of improved service during a later increment-earning period."
        },
        {
          "rule_number": "040208",
          "title": "Special Increments to mitigate lasting effect of withheld increment",
          "content": "When an officer's increment has been withheld under Rule 040206, the Federal Civil Service Commission, may at any subsequent incremental date, grant one or more special increments having the effect of raising the salary of the officer to or towards the level it would have reached if the previous withholding had not occurred."
        }
      ]
    }
  ]
},

{
  "chapter_number": 5,
  "title": "ANNUAL PERFORMANCE EVALUATION REPORTS(APER) AND CERTIFICATE OF SERVICE",
  "sections": [
    {
      "section_number": "01",
      "title": "GENERAL",
      "rules": [
        {
          "rule_number": "050101",
          "title": "Reporting Officer",
          "content": "A reporting Officer must not only be at least one substantive grade above the officer being reported on, but also be the immediate Superior Officer under whom the officer being reported on directly works. Where an officer has served in more than one Department before his report is rendered, the Reporting Officer shall be the immediate Superior Officer under whom he worked for the substantial part of the normal period a report shall cover. It is necessary that a countersigning officer should assess every report judiciously before countersigning."
        },
        {
          "rule_number": "050102",
          "title": "Reports to be Full and Candid",
          "content": "It is essential for the general efficiency of the service that Annual Reports on officers shall be detailed and candid. Reporting officers must realize that their own capabilities are discernible from the reports they write on their subordinates, bearing in mind that they hold their offices as much by virtue of their administrative ability as well as their professional ability."
        },
        {
          "rule_number": "050103",
          "title": "Communication of Reports to the Officer",
          "content": "The substance of any adverse comment on an officer's work or conduct included in a report shall be conveyed to him in writing by the reporting Permanent Secretary/Head of Extra-Ministerial Office in sympathetic terms and with the object of enabling and encouraging him to overcome his short-comings. The fact that this action has been taken shall be stated in the report itself. A copy of the letter addressed to the officer as well as a copy of his acknowledgement should be attached to the Report. Attention is however drawn to the provisions of Chapter 4 of these Rules."
        },
        {
          "rule_number": "050104",
          "title": "Reports on Seconded Officers - Secondment to Ministry/Extra Ministerial Office",
          "content": "When an officer is seconded to another Ministry/Extra Ministerial Office, the Permanent Secretary/Head of the Extra-Ministerial Office to which he/she is seconded is responsible for furnishing the reports on the officer as required by this Chapter."
        },
        {
          "rule_number": "050105",
          "title": "Reports on Seconded Officers - Secondment to Corporations, State or State owned Companies",
          "content": "Arrangements shall be made with Corporations, States or State-owned Companies to which officers are seconded to furnish the reports on the officers so seconded as required by this Chapter as though such bodies were Government Departments. It shall be the responsibility of the Permanent Secretary/Head of Extra-Ministerial Office from which an officer has been seconded to request the Corporation, State or State-owned company concerned, two months before the due date, to furnish the required report, on appropriate annual Report Forms which shall be supplied to the establishment for this purpose."
        }
      ]
    },
    {
      "section_number": "02",
      "title": "PROGRESS REPORTS ON OFFICERS",
      "rules": [
        {
          "rule_number": "050201",
          "title": "Object",
          "content": "Progress reports are meant to provide in respect of officers on probation or initial contract, a full record of each officer's work, conduct and capabilities on which to judge his/her suitability for confirmation or re-engagement(whichever is appropriate) and to ensure that in cases where an officer's suitability for continued employment is in doubt he is given timely warning of his faults and reasonable opportunity to correct them."
        },
        {
          "rule_number": "050202",
          "title": "Timing - Normal",
          "content": "Permanent Secretaries/Heads of Extra-Ministerial Offices are responsible for rendering Progress Reports at intervals of six months with effect from the date of first appointment. The final Progress Report shall be rendered not later than two months before an officer's probationary period or second tour of the contract is due to expire."
        },
        {
          "rule_number": "050203",
          "title": "Timing - In Special Cases",
          "content": "If for any reason an officer's probationary period is due to expire at a time when he/she will be on leave, the final Progress Report should be rendered not later than two months before he/she proceeds on such leave, in order that a decision as to the confirmation, deferment of confirmation or termination of his/her appointment may be taken and communicated to him/her before his/her departure. In the case of an officer on contract, if an adverse opinion of his/her suitability has been formed before progress report shall be rendered not later than two months before he/she so proceeds, in order that Government's decision as to whether he/she should be allowed to return for a further tour may be taken and communicated to him/her before he/she departs, and that the officer may have the opportunity of deciding before he/she departs whether, in the light of the adverse opinion already formed, it is in his/her own interest to return."
        },
        {
          "rule_number": "050204",
          "title": "Procedure",
          "content": "Permanent Secretaries/Heads of Extra-Ministerial Offices should address progress reports to the Permanent Secretary, Federal Civil Service Commission or the Permanent Secretary, Public Service Office, as appropriate under personal and confidential cover. The final Progress Report rendered after 21 months' service shall include a definite recommendation as to whether the officer's appointment should be confirmed or terminated or whether his/her contract should be renewed."
        }
      ]
    },
    {
      "section_number": "03",
      "title": "ANNUAL PERFORMANCE EVALUATION REPORTS ON SENIOR OFFICERS",
      "rules": [
        {
          "rule_number": "050301",
          "title": "Object",
          "content": "The object of Annual Performance Reports(APER) is to provide a full record of each officer's work, conduct and capabilities from which his/her suitability for promotion may be judged by the Federal Civil Service Commission. In order that the Commission may be in a position to weigh, in connection with a particular vacancy, the merits of officers, it is important that it should know precisely what work the officer has been engaged upon and the judgment formed on that work. It is no less important that the Federal Civil Service Commission should receive an indication of each officer's suitability for appointment/promotion to a senior grade in which he/she would have to perform administrative or supervisory duties. It may be that the officer's work in the appointment which he/she holds gives the fullest satisfaction but that he/she is unsuitable for more responsible duties, and the Federal Civil Service Commission particularly desires to have a record or expression of opinion as to each officer's suitability for promotion when, by his/her seniority, he/she may be regarded as eligible to be considered for such advancement."
        },
        {
          "rule_number": "050302",
          "title": "Period",
          "content": "Annual Performance Reports should be rendered on all officers at the end of each calendar year. However, confidential reporting system should be adopted for officers on Grade Level 15-17."
        },
        {
          "rule_number": "050303",
          "title": "Action by Officers",
          "content": "Thirty days before the end of the year, every officer on whom an Annual Performance Report is required shall, subject to any departmental instructions which may be issued to supplement this Rule, complete and sign the relevant pages of the appropriate number of copies of the Form and forward them, unfolded, through departmental channels to the Permanent Secretary/Head of Extra-Ministerial Office. Officers who will be on leave on the due date should take this action before proceeding on leave."
        },
        {
          "rule_number": "050304",
          "title": "Departmental Routine",
          "content": "Every Permanent Secretary/Head of Extra-Ministerial Office shall make such departmental arrangements as he/she considers necessary to ensure that thirty days before the due date, an officer serving in his/her Ministry/Extra-Ministerial Office, on whom a Report is required, takes the action indicated in the preceding Rule and that the Forms thus completed by individual officers are forwarded to the appropriate reporting officers who shall complete the appropriate Sections of the report which shall then be transmitted to the Permanent Secretary/Head of Extra-Ministerial Office."
        },
        {
          "rule_number": "050305",
          "title": "Action by Permanent Secretary/Head of Extra Ministerial Office",
          "content": "Permanent Secretaries shall forward copies of officers' APER to the Federal Civil Service Commission not later than 31st January of each year and the provisions of the Public Service Rule(PSR) on this matter should be strictly adhered to."
        },
        {
          "rule_number": "050306",
          "title": "Action by Permanent Secretary by forwarding copies of officers' APER",
          "content": "Permanent Secretaries shall forward copies of officers' APER to the Federal Civil Service Commission not later than 31st January of each year and the provisions of the Public Service Rule (PSR) on this matter should be strictly adhered to."
        }
      ]
    },
    {
      "section_number": "04",
      "title": "ANNUAL PERFORMANCE EVALUATION REPORT ON JUNIOR OFFICERS",
      "rules": [
        {
          "rule_number": "050401",
          "title": "Progress Reports on Unconfirmed Officers",
          "content": "In order to provide a full record of the work, conduct and capabilities on which to judge the suitability of an officer holding a junior post for confirmation, and to ensure that in cases where his/her suitability for confirmation is in doubt he/she is given timely warning of his/her faults and reasonable opportunity to correct them, the Permanent Secretary/Head of Extra-Ministerial Office shall arrange for progress reports on such officers to be rendered annually by responsible departmental officers."
        },
        {
          "rule_number": "050402",
          "title": "Annual Performance Evaluation Reports",
          "content": "In order to provide a full record of the work, conduct and capabilities on which to judge the suitability for promotion of officers holding junior posts, the Permanent Secretary/Head of Extra-Ministerial Office shall arrange for annual performance evaluation reports on such officers to be rendered on them by responsible departmental officers at the end of each calendar year. The reports on all eligible candidates shall be made available when the Junior Staff Committee meets to select candidates for promotion from one junior post to another."
        }
      ]
    }
  ]
},

{
  "chapter_number": 6,
  "title": "EXAMINATIONS IN LAW AND OFFICIAL PUBLICATIONS",
  "sections": [
    {
      "section_number": "01",
      "title": "GENERAL",
      "rules": [
        {
          "rule_number": "060101",
          "title": "Compulsory Confirmation Examination",
          "content": "(i) All officers joining the service or transferring from one establishment to another who are not yet confirmed are required to pass confirmation examination in addition to undergoing an Induction Course. The examination shall comprise the following:\n(a) Combined Confirmation/Promotion Examination for Junior Staff;\n(b) Compulsory Confirmation Examination for Senior Staff;\n\n(ii) The following compulsory examination shall be conducted in the Public Service:\n(a) Combined Confirmation/Promotion Examination;\n(b) Compulsory Confirmation Examination for Senior Staff."
        }
      ]
    },
    {
      "section_number": "02",
      "title": "COMBINED CONFIRMATION/PROMOTION EXAMINATIONS",
      "rules": [
        {
          "rule_number": "060201",
          "title": "Responsibility for conduct and supervision of Examinations",
          "content": "It is the responsibility of the Manpower Development Office (MDO) in the Office of the Head of Civil Service of the Federation to conduct and supervise the examination."
        },
        {
          "rule_number": "060202",
          "title": "Examination Board",
          "content": "There shall be established an Examination Board which shall be responsible for the conduct and supervision of the examinations. The Board shall comprise the following:\n(a) Manpower Development Office (OHCSF) - Chairman\n(b) Establishment & Pensions Office (OHCSF) - Member\n(c) Federal Civil Service Commission - Member\n(d) Federal Ministry of Education - Member\n(e) Federal Ministry of Justice - Member\n(f) Office of the Accountant-General of the Federation - Member\n(g) Any other line Ministry/Office a particular examination may relate to - Member"
        },
        {
          "rule_number": "060203",
          "title": "Failure to pass Confirmation Examination",
          "content": "An officer who fails the examination after three consecutive attempts shall by virtue of such failures be required to resign or withdraw from the service. The Permanent Secretary/Head of Extra-Ministerial Office shall ensure compliance."
        },
        {
          "rule_number": "060204",
          "title": "Failure to take confirmation examination",
          "content": "An officer who fails to take the confirmation examination after 3 years of first appointment shall be required to resign from the service."
        },
        {
          "rule_number": "060205",
          "title": "Time of holding Confirmation Examinations",
          "content": "Confirmation examination shall be held once a year in the last quarter of every year."
        },
        {
          "rule_number": "060206",
          "title": "Use of Text Books at Confirmation Examination",
          "content": "During the confirmation examination an officer is allowed to make reference to the Public Service reference books or any other related sources of information. However, textbooks and reference books are not allowed for the examinations in General Paper, Office Procedure/Routine or Special Paper. All officers on GL.06 and below must take the confirmation examination within two years from the date of taking up their appointments in the Ministry/Extra-Ministerial Office."
        },
        {
          "rule_number": "060207",
          "title": "Reference books allowed to be used in Confirmation Examination",
          "content": "The reference books allowed to be used in confirmation examination in the Ministry/Extra-Ministerial Office are:\n(a) GL.06 and below: Public Service Rules, Financial Regulations, Civil Service Handbook, Notes for Guidance Nos. 1, 2 and 5;\n(b) GL. 07 and above: Public Service Rules, Financial Regulations, Civil Service Handbook, Federal Establishment Circulars, Notes for Guidance Nos. 1, 2 and 5 etc;"
        },
        {
          "rule_number": "060208",
          "title": "Exemption for Law Qualified Officers",
          "content": "An Administrative Officer/Professional who possesses law qualification obtained from a Nigerian University or has been called to the Nigerian Bar shall be exempted, at the discretion of the Government, from taking Group A of the examination."
        },
        {
          "rule_number": "060209",
          "title": "Prescribed Examinations for Administrative Officers/Professionals",
          "content": "The following are the prescribed examinations for Administrative Officers/Professionals except otherwise reviewed.\n\nGROUP A - LAW EXAMINATION This examination consists of two papers, on the following subjects:\n1. (a) Nigerian Legal System;\n   (b) Ministerial Government Procedure based on:\n      (i) Lagos (Administrative and Executive Functions) Act No.1 of 1958\n      (ii) Ministers' Statutory Powers and Duties (Miscellaneous Provisions) Act, Cap. 228, Laws of the Federation of Nigeria, 1990.\n      (iii) Legislative Houses (Powers and Privileges) Act, Cap.208, Laws of the Federation of Nigeria, 1990.\n      (iv) Transfer of Functions (Lagos) Order L.N.257 of 1959.\n      (v) Transfer of Functions (Federation) Order L.N.258 of 1959.\n      (vi) Chapter VI, Part 1, Section A of the Constitution of the Federal Public of Nigeria 1999.\n\n2. The main provisions of the following legislations:\n   (a) The Constitution of the Federal Republic of Nigeria, 1999;\n   (b) The following Chapters of the Laws of the Federal Republic of Nigeria, 1990 and the subsidiary legislation made there under:\n      Chapter 447 - Commissions and Tribunals of Inquiry Act.\n      513 - Illiterates Protection Act\n      192 - Interpretation Act.\n      331 - Notaries Public Act.\n      333 - Oaths Act, 1963.\n      335 - Official Secrets Act, 1962.\n      503 - Federal Capital Territory Act.\n      IV of the 1999 Constitution - Fundamental Human Rights.\n      VIII Part I of 1999 Constitution - Federal Capital Territory.\n\nGROUP B - EXAMINATION IN OFFICIAL PUBLICATIONS\nThis examination consists of two papers:\n(i) Public Service Rules.\n(ii) Financial Regulations."
        }
      ]
    },
    {
      "section_number": "03",
      "title": "COMPULSORY EXAMINATIONS FOR EXECUTIVE OFFICERS",
      "rules": [
        {
          "rule_number": "060301",
          "title": "Officers who are required to pass",
          "content": "Unless specially exempted by the Government the following Executive Officers are required to pass the examinations prescribed in Rule 060302 within two years of the date of taking up their appointment in the Federal Public Service:\n(a) Officers appointed direct on first appointment as Executive Officers.\n(b) Unconfirmed Assistant Executive Officers promoted from junior posts.\n(c) Executive Officers transferred from other Scheduled Services who at the date of transfer are under the age of forty years and have not satisfied the conditions for confirmation."
        },
        {
          "rule_number": "060302",
          "title": "Syllabuses of examination",
          "content": "The following are the prescribed examinations for Executive Officers:\n(i) Public Service Rules.\n(ii) Financial Regulations."
        }
      ]
    },
    {
      "section_number": "04",
      "title": "COMPULSORY EXAMINATION FOR ADMINISTRATIVE OFFICERS AND PROFESSIONALS",
      "rules": [
        {
          "rule_number": "060401",
          "title": "Officers Required to Pass",
          "content": "Unless exempted by the Government the following Administrative Officers/Professionals are required to pass the examinations prescribed in Rule 060302 within two years from the date of taking up their appointments in the Federal Public Service:\n(a) Administrative Officers/Professionals appointed direct to the Federal Public Service on first appointment.\n(b) Administrative Officers/Professionals promoted from unconfirmed junior posts.\n(c) Administrative Officers/Professionals transferred from other Scheduled Service who at the date of transfer are under the age of forty years and have not satisfied conditions for confirmation.\n(d) For further advancement beyond GL. 10 officers shall attend Administrative Staff College of Nigeria (ASCON) or any other approved institutions and pass the prescribed examination."
        }
      ]
    },
    {
      "section_number": "05",
      "title": "FEES FOR INVIGILATORS AND EXAMINERS",
      "rules": [
        {
          "rule_number": "060501",
          "title": "Examination Fees",
          "content": "\"Fees shall be paid to examiners and invigilators at rates which may be determined from time to time by Government\"."
        }
      ]
    }
  ]
},

{
  "chapter_number": 7,
  "title": "MEDICAL AND DENTAL PROCEDURES MEDICAL TREATMENT",
  "sections": [
    {
      "section_number": "01",
      "title": "GENERAL",
      "rules": [
        {
          "rule_number": "070101",
          "title": "Definitions",
          "content": "\"HealthCare Provider(HCP)\" means duly HealthCare Provider in accordance with the National Health Scheme.\n\"Hospital\" means a medical facility run by a duly approved HealthCare Provider(HCP).\n\"Medical Officer\" is a medical practitioner who is authorised to run a HealthCare.\n\"Private Practitioner\" means any other Registered Medical or Dental Practitioner, outside the National Health Insurance Scheme(NHIS)."
        },
        {
          "rule_number": "070102",
          "title": "Medical Examination in Service",
          "content": "An officer on first appointment shall be examined by a duly appointed HealthCare Provider, who will certify that the officer is sound in health for employment in the pensionable establishment. Thereafter, every five(5) years an officer shall present himself to a HealthCare Provider for examination to certify that the officer is sound in health and fit to continue in service, without bias to government policy on the right of individuals as this pertains to specific diseases from time to time."
        },
        {
          "rule_number": "070103",
          "title": "Medical documents to be treated as confidential",
          "content": "The medical certificates, reports of medical boards, dental treatment records, reports of private practitioners and confidential health reports mentioned in this Chapter will be treated as strictly confidential. No copies of these reports except those mentioned in this Chapter shall be furnished, except that this rule shall not preclude the keeping of an officer's health record in the Ministry of Health or the transfer of such record to the corresponding office when a staff is transferred to the service of another Government."
        },
        {
          "rule_number": "070104",
          "title": "Medical Examination on appointment",
          "content": "Every person selected for appointment either in a temporary or in a permanent capacity shall be required to present himself/herself for examination to a Healthcare Provider(or one so approved by Government) with a view to being ascertained whether he/she is physically fit for service. Unless otherwise provided in the offer of appointment, the fee for such examination shall be paid by the Federal Government. If the candidate is not finally passed as physically fit for service, his/her appointment shall not be proceeded with."
        },
        {
          "rule_number": "070105",
          "title": "Special medical tests",
          "content": "The Permanent Secretary/Head of Extra-Ministerial Office may at any time(and shall, if the officer so requests) call upon an officer to present himself/herself to an approved Healthcare Provider, or to a duly constituted Medical Board with a view to ascertaining whether the officer is physically capable of performing the duties of his appointment or of any appointment to which it may be proposed to transfer him."
        },
        {
          "rule_number": "070106",
          "title": "Medical test for officer on leave-of absence",
          "content": "An officer on leave of absence may be required or at his own request may be permitted by the Federal Government or its accredited representative, to present himself for examination to an approved Healthcare Provider, with a view to obtaining a report as to the officer's physical fitness to return to his duties or to take up a fresh appointment."
        },
        {
          "rule_number": "070107",
          "title": "Procedure",
          "content": "In the case of examinations under either of the two preceding Rules:\n(a) any fees in respect of the examination shall in the absence of any special regulations or arrangement to the contrary, be paid by the Government;\n(b) the person or persons appointed to conduct the examination shall have discretion to call a specialist into consultation and any fee due to the specialist for assistance in rendering a report to the Government shall be paid from public funds;\n(c) the report of the examination shall be furnished to the Government and communicated to the officer concerned by the Healthcare Provider; if he/she so desires.\n(d) the officer shall, however, be informed at the earliest possible date of the decision reached upon his case by the Government after consideration of the report; and if the officer is dissatisfied with that decision he shall be at liberty to make representation to this effect, in which event the Government shall decide at its discretion whether any further medical evidence shall be called for."
        },
        {
          "rule_number": "070108",
          "title": "Leave to visit Medical Specialist/Dentist",
          "content": "An Officer may be granted leave by his Permanent Secretary/Head of Extra-Ministerial Office for the purpose of visiting a Medical Specialist/Dentist, but only if it is certified by the HealthCare Provider that he/she is unable to deal with the case himself/herself and that it will definitely affect the health of the officer if consultation is postponed.\nAn officer granted leave in such circumstances will be treated for the purpose of free transport facilities(but not for travelling allowance) as travelling on duty. If no medical certificate is given, it will be open to an officer to apply for casual leave under Rule 100214."
        }
      ]
    },
    {
      "section_number": "02",
      "title": "FACILITIES FOR MEDICAL TREATMENT",
      "rules": [
        {
          "rule_number": "070201",
          "title": "Government facilities in Nigeria",
          "content": "The medical facilities in Nigeria provided to all officers and their families and the scale of charges will be determined by the National Health Insurance Scheme(NHIS)."
        },
        {
          "rule_number": "070202",
          "title": "Patients bears expenses",
          "content": "A staff who prefers to be treated by a private practitioner instead of availing himself/herself of services of authorised Healthcare Provider must himself/herself bear all expenses incurred through such treatment."
        },
        {
          "rule_number": "070203",
          "title": "Officers Embarked as Invalids",
          "content": "If an officer is embarked by Government or its accredited representative in a sea-going vessel as an invalid and placed in the charge of the ship's Surgeon, the latter's fees for medical attendance on the officer during the voyage will be payable by the Government."
        },
        {
          "rule_number": "070204",
          "title": "Officers falling seriously ill on voyage to or from Nigeria",
          "content": "(i) Government will consider claims for the refund of medical expenses incurred by officers and their families during voyages duly authorized by the Government in cases of serious illness occurring en route and provided that the illness is not attributable to the officer's or his family's negligence. Claims for petty bills incurred on board ships/aircraft will not, however, be entertained.\n(ii) In the case of Ministers, Permanent Secretaries and other officials of Government that are involved in frequent overseas engagements, provision for an annual International Medical Insurance should be made."
        },
        {
          "rule_number": "070205",
          "title": "Medical expenses during overseas leave or on duty",
          "content": "The Federal Ministry of Health may authorize a refund of medical expenses(including charges for maintenance) incurred by an officer while overseas on leave or on duty provided:\n(a) the illness was not due to the Officer's own negligence;\n(b) the illness was attributable to conditions or the climate overseas;\n(c) the officer sought to avail himself of the services of the local National Health Service(where applicable) and could not obtain the requisite attention there under within a reasonable time.\n(d) the officer informed the nearest accredited representative of the Federal Government of Nigeria at the earliest date possible that he was unable to obtain the requisite attention through the National Health Service; and\n(e) the officer showed reasonable diligence, expedition and economy in seeking and obtaining medical attention."
        },
        {
          "rule_number": "070206",
          "title": "Medical Treatment Overseas",
          "content": "(a) Approval for journeys outside Nigeria for medical treatment will only be granted by the Head of the Civil Service of the Federation. The Federal Ministry of Health should be informed of such approvals accordingly. This will be confined to, based on the recommendation of the approved HealthCare Provider, serious cases where a patient's life is in danger or where the examination is necessary for diagnosis of difficult cases or to ensure that a patient is fully recovered and able to undertake the duties of his office. Where the officer is treated as an out-patient, he will be entitled to estacode allowance at the appropriate rate.\n(b) In exceptional cases where dependants of officers are compelled to travel abroad for medical treatment/check-up, government involvement will be limited to half of estimated expenses.\n(c) Every application for medical treatment abroad must be supported by a consultant's report from an authorized HealthCare Provider.\n(d) Conditions for Spouse accompanying ailing officers: Permission may be granted an Officer's spouse to accompany him/her at Government expense where the ailing officer is considered to be in 'life or death' condition.\n(e) Medical check-up approvals are required from appropriate authorities based on officer grade level.\n(f) Officers on Salary Grade Level 16 and above shall undertake mandatory medical check-ups locally once a year. Officers on Grade Level 12 to Grade Level 15 are entitled to medical check-ups locally once in two years."
        }
      ]
    },
    {
      "section_number": "03",
      "title": "ABSENCE FROM DUTY ON ACCOUNT OF ILLNESS",
      "rules": [
        {
          "rule_number": "070301",
          "title": "Notice to Employer",
          "content": "If an officer is ill and unable to report for duty, he/she shall notify his/her Ministry/Agency in writing or by any other means of communication. Any prolonged absence from duty on ground of illness should be supported with any of the following documents:\n(a) Excuse Duty Certificate;\n(b) Light Duty Certificate;\n(c) Medical Certificate of Treatment duly authorized by the Healthcare Provider.\nAn officer who is receiving medical treatment within his/her duty post shall report to his/her employer, his/her absence within 24 hours. An officer who is receiving medical treatment outside his/her duty post shall report to his/her employer, his/her absence within 48 hours."
        },
        {
          "rule_number": "070302",
          "title": "Responsibility of Health Care Provider",
          "content": "When an officer presents himself/herself to duly authorized Healthcare Provider for medical examination, the latter shall examine and treat him/her and if necessary, give him/her either of the certificates listed in Rule 070301 and if he/she is admitted as an in-patient, the Healthcare Provider shall inform his/her Ministry/Extra-Ministerial Office."
        },
        {
          "rule_number": "070303",
          "title": "Seeking Medical attention for sick officer",
          "content": "When a Ministry/Extra-Ministerial Office reports to a Healthcare Provider that an officer of the Ministry/Extra-Ministerial Office is so ill that he/she is physically unable to present himself/herself for medical examination, the Healthcare Provider shall, as appropriate, either arrange for the officer to be brought to hospital for examination and treatment or visit the officer to examine and treat him/her. If the examination results in the officer being admitted to a Hospital as an in-patient, the Healthcare Provider will so inform the officer's Ministry/Extra-Ministerial Office, otherwise he/she shall give the officer whichever of the Certificates listed in Rule 070301 as appropriate."
        },
        {
          "rule_number": "070304",
          "title": "Private Medical Practitioner's Report",
          "content": "When an officer forwards to a Healthcare Provider a report on his/her sickness by the private practitioner attending to him/her, the Healthcare Provider will, after due consultation with the private practitioner, issue whichever of the certificates listed in Rule as appropriate.\nThe period of excuse or light duty entered on the first certificate issued shall not exceed three days unless the Healthcare Provider has examined the patient, in which case the period may be for up to seven days. Each period of extension, thereto, shall not exceed seven days and not more than a total of forty-two calendar days sick leave may be allowed on such extension. If the officer is still not fit for duty after forty-three calendar days sick leave, he/she shall be examined by a Medical Board."
        },
        {
          "rule_number": "070305",
          "title": "Reports to Ministries and Extra Ministerial Offices",
          "content": "On any of the occasions listed in this Rule, the Healthcare Provider shall report the circumstances to the officer's Ministry/Extra-Ministerial Office:\n(a) When an officer is admitted to and when he is discharged from a Hospital.\n(b) When an officer refuses to carry out or in the opinion of the HealthCare Provider is neglecting to carry out, the medical advice he has been given.\n(c) When in the opinion of the Healthcare Provider an officer is feigning ill-health."
        },
        {
          "rule_number": "070306",
          "title": "Duty to attend medical board and comply with recommendations",
          "content": "If for any valid reason it is decided that an officer should be examined by a Medical Board, he must present himself for examination; the place and time instructed, and must afterwards comply with recommendation of the Board which will supercede any medical advice already given to him/her by a Healthcare Provider. An officer who fails comply with this rule shall render himself/herself liable to be treated as having been absent without leave."
        },
        {
          "rule_number": "070307",
          "title": "Who is responsible",
          "content": "The Permanent Secretary/Head of Extra-Ministerial Office will arrange for the responsibilities described in the four Rules to be allocated to appropriate officers."
        },
        {
          "rule_number": "070308",
          "title": "Recording of addresses",
          "content": "In each Ministry/Extra-Ministerial Office the Administration/Personnel Management Offices must maintain an up-to-date record of the residential addresses of the officers and staff employed there."
        },
        {
          "rule_number": "070309",
          "title": "Enquiries about absentees",
          "content": "If an officer's absence from duty is not explained by him/her within 24hours, enquiry shall be made at his recorded address to ascertain the cause of absence."
        },
        {
          "rule_number": "070310",
          "title": "Reporting of Staff's sickness",
          "content": "Whenever an officer becomes so ill that he/she is physically unable to present himself/herself for medical examination, the circumstances and his/her where about should be reported by his Ministry/Extra-Ministerial Office to nearest Healthcare Provider."
        },
        {
          "rule_number": "070311",
          "title": "Instructions to staff reporting sick",
          "content": "When an officer reports that he is prevented from performing his/her duties, he/she should(unless Rule 070310 applies) be instructed or authorized as explained in Rule 070304 and be provided with a note requesting the Healthcare Provider to examine and treat him/her."
        },
        {
          "rule_number": "070312",
          "title": "Appointment of Medical Board",
          "content": "When it is desirable to appoint a Medical Board, it is the responsibility of the Permanent Secretary/Head of Extra-Ministerial Office to initiate action in that regard."
        },
        {
          "rule_number": "070313",
          "title": "Responsibility of Healthcare Provider",
          "content": "When an officer presents himself/herself to a Healthcare Provider for examination, the later shall examine and treat him/her and give him/her either of the certificates listed in Rule 070301 as the Healthcare Provider considers appropriate or, if he/she admits him/her to hospital as an in-patient, inform his/her Ministry/Extra-Ministerial Office."
        },
        {
          "rule_number": "070314",
          "title": "Sick Leave Rules - Patient Unable to Attend",
          "content": "An officer not being on leave of absence who is absent from duty on the grounds of ill-health will, provided such absence is covered by proper authority, be regarded as being absent on sick leave."
        },
        {
          "rule_number": "070315",
          "title": "When Patient Send Private Practitioner's Report",
          "content": "An officer on vacation leave who is prevented from resuming duty at the expiration of his/her authorized leave by reason of ill-health duly certified by an approved Healthcare Provider may be granted an extension of leave. An Officer shall be granted sick leave at the expiration of his/her annual leave."
        },
        {
          "rule_number": "070316",
          "title": "Aggregate Sick leave",
          "content": "(i) The maximum aggregate sick leave which can be allowed an officer, who is not hospitalized, during any period of twelve months shall be forty-two(42) calendar days. Where such an officer has been absent from duty on the ground of ill-health for an aggregate period in excess of forty-two(42) calendar days within twelve calendar months, the officer should be made to appear before a Medical Board with a view to ascertain whether he/she should be invalidated from service. Any period of absence on ground of ill-health in excess of the prescribed aggregate will be without pay and will not be reckoned for purpose of increment for pension.\n(ii) An officer who is incapacitated as a result of injury sustained in the course of his official duties shall be entitled to draw full emolument until he/she is discharged from sick leave or permanently invalidated."
        },
        {
          "rule_number": "070317",
          "title": "Invalidating Sick Leave Rules",
          "content": "(a) An officer who is recommended by a Medical Board or a HealthCare Provider to be permanently invalided will forthwith commence vacation leave prior to retirement in accordance with Rule 100239(b).\n(b) Where an officer who is incapacitated in the course of his official duties has not completed the minimum qualifying service and is not, on the termination of his service, eligible for pension under the Pensions Reform Act 2004, the appropriate authority responsible for pension matters, may in lieu of gratuity stipulated in the relevant pension Schedule, grant to such officer, in addition to injury pension stipulated in Table C of the Pensions Act and in the said Schedule, pension calculated at the rate of 2% of the officer's accrued pension from the date of the officer's retirement."
        },
        {
          "rule_number": "070318",
          "title": "Sick leave rules",
          "content": "Sick leave for a period up to three months in the first instance may be allowed on the certificate of an approved HealthCare Provider to an officer who is hospitalized. If at the end of that period the officer is still hospitalized, his Permanent Secretary/Head of Extra-Ministerial Office must make an arrangement for him to be examined by a Medical Board with a view to ascertaining whether he should be invalidated from the service or allowed further paid sick leave."
        }
      ]
    },
    {
      "section_number": "04",
      "title": "COMPENSATION FOR INJURIES",
      "rules": [
        {
          "rule_number": "070401",
          "title": "Death of An Officer/Spouse Overseas",
          "content": "The Government shall repatriate, at the request of the deceased's family, the corpse of a Nigerian officer who dies abroad while on official duty tour or course of instruction, or the corpse of the spouse of the official who was duly authorized to accompany him/her on the duty tour or course of instruction. Government's responsibility shall be limited to the following:(a)(i) Preparation of the body(embalmment) (ii) Purchase of a reasonable priced coffin or casket including inner zinc and wooden coffin as stipulated by Airline Regulations; (iii) Transportation of the corpse to the officer's home town at reasonable cost;\n(iv) Payment of the cost to the family of the deceased, not exceeding one full page advert in one National Newspaper for the publication of obituary, at the prevailing rates. (b) When a pensionable officer dies in the service of the Government, it shall be the responsibility of the Government to provide the following:\n(i) Cost of burial expenses including; Preparation of the body and embalmment; settlement of mortuary bills; and provision of coffin/Casket subject to the following maximum amount:\n(a) GL 01-06 N100,000.00\n(b) GL 07-14 N200,000.00\n(c) GL 15-17 N300,000.00\n(d) Consolidated N500,000.00\n(ii) Payment to the family of the deceased, cost for one full page advert in one National Newspaper for the publication of obituary at the prevailing rates.\n(iii) Transportation of the corpse to officer's home town at reasonable cost."
        }
      ]
    }
  ]
},

{
  "chapter_number": 8,
  "title": "COMPENSATION AND INSURANCE",
  "sections": [
    {
      "section_number": "01",
      "title": "LOSS OF PROPERTY",
      "rules": [
        {
          "rule_number": "080101",
          "title": "Loss of Private Property",
          "content": "Officers will not, in general, be entitled to compensation from public funds, for loss of property in circumstances arising outside of their services, and as such officers may consider the possibility of insuring their property against any type of loss or damage."
        }
      ]
    },
    {
      "section_number": "02",
      "title": "LOSS OF LIFE",
      "rules": [
        {
          "rule_number": "080201",
          "title": "Death in Service",
          "content": "Where an officer dies after the completion of the minimum period of qualifying service, there shall be paid to his/her legal representative or any person designated by him/her during his/her life time as his/her Next of Kin, his entitlements under the life insurance policy maintained under Section 9 of Sub-Section(3) of the Pension Reform Act 2004."
        },
        {
          "rule_number": "080202",
          "title": "Motor Vehicle",
          "content": "(a) If the motor vehicle of an officer, whilst being used for official duties, is damaged as the direct result of civil disturbances, Government will accept responsibility for such damage. For the purpose of this Rule, \"Official duties\" will be deemed to include journeys between house and office.\n(b) If an officer's private vehicle while being used for official duties is damaged beyond repairs as a result of accident, the government shall accept responsibility to the extent of the difference between the indemnity covered by the insurance and the cost of replacing the vehicle."
        },
        {
          "rule_number": "080203",
          "title": "Insurance at Government Expense",
          "content": "The following persons when travelling by air, land or sea at Government expense will be eligible for free insurance cover to be provided by the Ministry/Extra-Ministerial Office of the staff concerned as follows:\nTraveller                Capital Benefits\nStaff                    N2,000,000\nWife of Staff            N1,000,000\nChild of Staff           N1,000,000\nNon-Official             N1,000,000\nNYSC                     N1,000,000"
        },
        {
          "rule_number": "080204",
          "title": "Responsibility for Insurance",
          "content": "A passenger travelling to and from any destination inside or outside Nigeria with the authority of Government, free insurance cover for the capital benefits, prescribed in Rule 080203, will be automatic and will not require the completion of any formalities by the passenger. If the passenger wishes to arrange excess of the capital benefits provided by Government he must do so privately and at his own expense."
        },
        {
          "rule_number": "080205",
          "title": "Stop-over Facilities",
          "content": "The free cover referred to in Rule 080204 above is provided for a period of normal travel time only, though this is automatically extended when the passenger is delayed due to no fault of his own. Where a traveller takes advantage of \"stop over\" facilities and so does not reach his destination during the normal travel time, the insurance cover lapses at the first place of stop-over. All officers to whom Rule 080204 applies and who make stop-over en route to or from a country outside Nigeria should therefore make their own arrangements for insurance from the place of stop-over onwards. Refunds of the extra premium so incurred will only be made in respect of the capital benefits prescribed in Rule 080203."
        }
      ]
    }
  ]
}
,
  {
      "chapter_number": 9,
      "title": "PETITIONS AND APPEALS",
      "sections": [
        {
          "section_number": 1,
          "title": "GENERAL",
          "rules": [
            {
              "rule_number": "090101",
              "title": "Procedure",
              "content": "Every officer who has any representations of a public or private nature to make to the Government should address them to: (a) The Chairman, Federal Civil Service Commission, in respect of matters relating to appointments(including acting appointments), promotion, transfer and discipline; or (b) The Head of Civil Service of the Federation on matters relating to other conditions of service, e.g. leave, passages, allowances, pensions, gratuities, etc."
            },
            {
              "rule_number": "090102",
              "title": "Petition to Head of Government",
              "content": "Any Officer in the Federal Public Service may address the Head of Government, in which case he/she must transmit such communication, unsealed and in triplicate to any of the channels mentioned in the preceding rule requesting that the petition be forwarded in due course to the Head of Government. Every letter, or document which may be received by the Head of Government otherwise than through the proper channel will be returned to the writer."
            }
          ]
        },
        {
          "section_number": 2,
          "title": "PETITION RULES",
          "rules": [
            {
              "rule_number": "090201",
              "title": "Definition/Application",
              "content": "(i) For the purpose of this Section a 'petition' is a formal appeal to ultimate authority, that is to the Head of Government for special consideration of a matter affecting an officer personally. (ii) Without prejudice to their constitutional rights, officers should as much as possible exhaust all avenues provided in the Public Service Rules and Circulars for redress before proceeding to courts."
            },
            {
              "rule_number": "090202",
              "title": "Application",
              "content": "Petitions by an officer(or by an ex-officer on matters relating to his/her conditions of employment as an officer or his/her condition as a pensioner of Government) must be submitted in accordance with the rules set out in this Section."
            },
            {
              "rule_number": "090203",
              "title": "Outside influence",
              "content": "An Officer must not attempt to bring political or other outside influence to support his individual claims. If he/she is dissatisfied, his/her proper course is to make representations to his/her immediate superior officer or Permanent Secretary/Head of Extra-Ministerial Office."
            },
            {
              "rule_number": "090204",
              "title": "Routing of petition",
              "content": "A petition must be submitted through the proper departmental channels, namely through the petitioner's immediate superior officer and the Permanent Secretary/Head of Extra-Ministerial Office, who will forward the petition with his/her comments and recommendations to the Chairman of the Federal Civil Service Commission or the Head of the Civil Service of the Federation."
            },
            {
              "rule_number": "090205",
              "title": "Number of copies",
              "content": "A petition addressed to any of the channels mentioned in the preceding rule must be submitted in duplicate, and an advance copy may be sent direct to the appropriate authority. In either case, one copy will be retained by the Permanent Secretary/Head of Extra-Ministerial Office."
            },
            {
              "rule_number": "090206",
              "title": "Identity of petitioner",
              "content": "A petition must bear the full name, staff number, signature and address of the petitioner. When written by a person other than the petitioner, the signature and address of the writer must be included."
            },
            {
              "rule_number": "090207",
              "title": "Petition submitted on behalf of an illiterate person",
              "content": "When a person submits a petition above his/her own signature on behalf of an illiterate, the petition should contain a statement that he/she has been asked to write on behalf of the illiterate."
            },
            {
              "rule_number": "090208",
              "title": "Disqualifications",
              "content": "(a) A petition will not be entertained if it: (i) does not comply with Rule 090201; (ii) deals with a case in which legal action is pending in a Court of Law; (iii) is illegible or meaningless; (iv) is worded in abusive, improper, or foul language; or (v) merely repeats the substance of a previous petition without introducing new relevant matter. (b) A petition submitted more than six months after the decision complained of has been given, will also not be entertained, unless such delay is supported by valid reasons."
            },
            {
              "rule_number": "090209",
              "title": "Conclusion of petition",
              "content": "A petition should conclude by stating concisely the nature of the redress sought, and a petition which exceeds in length two pages of foolscap must also include a summary of the reasons adduced in support of the redress sought."
            }
          ]
        }
      ]
    },
    {
      "chapter_number": 10,
      "title": "LEAVE",
      "sections": [
        {
          "section_number": 1,
          "title": "GENERAL",
          "rules": [
            {
              "rule_number": "100101",
              "title": "Definition",
              "content": "'Leave' is the authorized absence of an officer from duty for specific period as provided for in this Chapter."
            },
            {
              "rule_number": "100102",
              "title": "Leave address",
              "content": "'Leave Address' is a place where an officer could be reached during his/her leave period."
            },
            {
              "rule_number": "100103",
              "title": "Earned leave",
              "content": "'Earned Leave' is the leave due to an officer in a year for the service rendered to Government."
            },
            {
              "rule_number": "100104",
              "title": "Leave earning service",
              "content": "'Leave-Earning Service' IS a qualifying period of duty before officers could be granted leave."
            },
            {
              "rule_number": "100105",
              "title": "Date of resumption",
              "content": "'The Date of Resumption of Duty' is the date following the date of expiration of the leave."
            },
            {
              "rule_number": "100106",
              "title": "Leave year",
              "content": "'Leave Year' is the period between 1st January and 31st December."
            }
          ]
        },
        {
          "section_number": 2,
          "title": "TYPES OF LEAVE",
          "rules": [
            {
              "rule_number": "100201",
              "title": "Types of leave",
              "content": "The types of leave in the Federal Public Service are as follows: (a) Annual Leave; (b) Proportionate Leave(Pro-rata Leave); (c) Deferred Leave; (d) Casual Leave; (e) Sick Leave; (f) Maternity Leave; (g) Examination Leave; (h) Sabbatical Leave; (i) Study Leave with Pay; (j) Study Leave without Pay; (k) Leave on Compassionate Ground; (l) Pre-retirement Leave; (m) Leave of Absence; (n) Leave on Grounds of Urgent Private Affairs; (o) Leave for Cultural and Sporting Activities; (p) Leave to take part in Trade Union Activities;"
            },
            {
              "rule_number": "100202",
              "title": "Annual leave",
              "content": "Annual Leave is the absence of an officer from duty for a period specified in Rule 100203 as may be authorized by a superior officer."
            },
            {
              "rule_number": "100203",
              "title": "Qualifying period for annual leave",
              "content": "Annual Leave shall be granted to an officer in accordance with his grade level as follows: (a) GL 07 and above - 30 calendar days (b) GL04-06 - 21 calendar days (c) GL 03 and Below - 14 calendar days. An officer shall qualify for Annual Leave not less than six months after the previous leave within a leave earning service year."
            },
            {
              "rule_number": "100204",
              "title": "Annual leave roster",
              "content": "(a) It is the responsibility of the Head of the Department of Administration/Personnel to draw up the Annual Leave Roster for all officers in that Ministry/Extra-Ministerial Office; (b) It is the responsibility of every Permanent Secretary/Head of Extra-Ministerial Office to approve the Leave Roster for the coming year not later than the 31st December."
            },
            {
              "rule_number": "100205",
              "title": "Normal grant of annual leave",
              "content": "Leave will be granted at any time during the leave year. Normally, the full leave will be taken at one time but it may be taken in not more than two instalments. Any leave not taken within the calendar year concerned will be forfeited. No officer is allowed to accumulate leave."
            },
            {
              "rule_number": "100206",
              "title": "Annual leave abroad",
              "content": "An officer who desires to spend his/her annual leave abroad shall inform the Permanent Secretary/Head of Extra-Ministerial Office before proceeding on vacation and shall provide details of his/her address."
            },
            {
              "rule_number": "100207",
              "title": "Leave address",
              "content": "An officer spending his/her leave within or outside Nigeria must furnish the Permanent Secretary/Head of Extra-Ministerial Office with his/her intended destination or leave address before proceeding on leave."
            },
            {
              "rule_number": "100208",
              "title": "Date of resumption",
              "content": "An officer is required to resume duty after vacation on the date following the expiration of his/her authorized leave."
            },
            {
              "rule_number": "100209",
              "title": "Curtailment of leave",
              "content": "An officer may be required to return to duty before the expiration of his/her authorized leave by the Permanent Secretary/Head of Extra-Ministerial Office. Any portion of his/her leave so curtailed shall be taken immediately and not later than ninety(90) days of completion of the assignment."
            },
            {
              "rule_number": "100210",
              "title": "Procedure on return from leave",
              "content": "On return from annual leave, every officer must complete and submit a Resumption of Duty Certificate(Form L.10) to his/her Permanent Secretary/Head of Extra-Ministerial Office who will endorse and forward the form to the Office of the Head of Civil Service of the Federation(OHCSF) or to the relevant pool office."
            },
            {
              "rule_number": "100211",
              "title": "Proportionate leave",
              "content": "'Proportionate Leave'(Pro-rata) is a vacation granted to a new or retiring officer in proportion to the number of days he/she has put into the service. Any period of service under 30 days is not reckonable."
            },
            {
              "rule_number": "100212",
              "title": "Officers entitled to pro-rata leave",
              "content": "(a) An officer who joins the Federal Public Service during the course of the Leave Year will not normally be granted an annual leave but a proportionate leave. (b) Officers who attend courses of instruction/training over a period of six months shall be entitled to proportionate leave for the period they put in service. (c) An officer who is retiring within the period of Leave-Earning Service shall be entitled to proportionate leave."
            },
            {
              "rule_number": "100213",
              "title": "Deferred leave",
              "content": "(a) Deferred Leave is that which an officer is granted in exceptional circumstances by the Permanent Secretary or Head of Extra-Ministerial Office to carry forward to the next leave year because of exigency of duty. (b) Authorized deferred leave may be commuted to cash only where an officer has been made to retire prematurely and cannot spend all his/her deferred leave before his/her retirement."
            },
            {
              "rule_number": "100214",
              "title": "Casual leave",
              "content": "Casual Leave is the absence of an officer from duty for a short period not exceeding an aggregate of 5 working days within a leave year as may be authorized by a superior officer. The casual leave shall only be granted after an officer has exhausted his/her annual leave."
            },
            {
              "rule_number": "100215",
              "title": "Qualified period for Casual Leave",
              "content": "A maximum of seven days casual leave shall be granted in any leave year. Casual leave in excess of seven days in any leave year may be granted only by the Permanent Secretary/Head of Extra-Ministerial Office."
            },
            {
              "rule_number": "100216",
              "title": "Sick Leave",
              "content": "Sick Leave is the absence of an officer from duty on account of ill-health as authorized by a Healthcare Provider."
            },
            {
              "rule_number": "100217",
              "title": "Maternity Leave",
              "content": "Maternity Leave is the authorised absence from duty of a serving female officer granted by a superior officer on account of pregnancy covering the prenatal and postnatal periods."
            },
            {
              "rule_number": "100218",
              "title": "Sixteen Weeks Maternity Leave",
              "content": "A female staff that is pregnant is entitled to 16 weeks maternity leave at a stretch beginning not less than 4 weeks from the expected date of delivery with full pay. A medical certificate showing the expected date of confinement must be presented not less than two months before that date."
            },
            {
              "rule_number": "100219",
              "title": "Time Off for Nursing Mothers",
              "content": "Any female officer who is nursing a child shall be granted two hours off-duty every day. This facility shall be granted up to a maximum period of six months from the date she resumes duty from maternity leave."
            },
            {
              "rule_number": "100220",
              "title": "Leave for Compulsory Examination",
              "content": "An officer may be granted special leave for the purpose of taking an examination, which he/she is required to pass by the condition of his/her appointment."
            },
            {
              "rule_number": "100221",
              "title": "Leave for Non-Compulsory Examination",
              "content": "An officer may be allowed special leave with full pay to take an examination the passing of which is not a condition of his/her current appointment, provided that his/her Permanent Secretary/Head of Extra-Ministerial Office certifies the following: (a) that the passing of the examination is likely to enhance his/her value to the Service; (b) evidence of admission for the course; (c) evidence of a time-table for the examination."
            },
            {
              "rule_number": "100222",
              "title": "Sabbatical Leave",
              "content": "Sabbatical leave is the absence of an officer on GL.15 or equivalent and above from duty, for the purpose of research either within or outside Nigeria. The Officer on sabbatical leave shall be qualified to undertake properly organized study in areas relevant to the interest of the service or national development for a period of twelve months once in five years."
            },
            {
              "rule_number": "100223",
              "title": "Study Leave",
              "content": "Study Leave is the leave granted to a confirmed serving officer to undertake an approved course of study within or outside the country."
            },
            {
              "rule_number": "100224",
              "title": "Types of Study Leave",
              "content": "There are three types of study leave: (a) In-service Training; (b) Study leave with pay; (c) Study leave without pay."
            },
            {
              "rule_number": "100225",
              "title": "In-Service Training",
              "content": "Officers shall be granted in-service training for a period not exceeding two years with normal emoluments, allowances and course fees. The period of study shall count towards gratuity and pension."
            },
            {
              "rule_number": "100226",
              "title": "Study Leave With Pay",
              "content": "Study leave with pay shall be granted to an officer with normal emoluments and allowances. The duration of study leave with pay shall not exceed two years. If, however, an officer has a carry-over, the period of extension shall not be more than one year."
            },
            {
              "rule_number": "100227",
              "title": "Study Leave Without Pay",
              "content": "Officers are granted study leave without pay where the proposed courses of study are not contained in the approved training proposals for their Ministries/Extra-Ministerial Office."
            },
            {
              "rule_number": "100228",
              "title": "Conditions for Study Leave Without Pay",
              "content": "(a) officers on study leave without pay are not entitled to emoluments and allowances; (b) the duration of study leave without pay shall not be more than four years in the first instance, after which the officer can apply for one year extension if the need arises. (c) The period of study shall not be regarded as a break in Service."
            },
            {
              "rule_number": "100229",
              "title": "Leave for Religious Purpose",
              "content": "Officers going on religious pilgrimages other than Officials assigned to cover such activities should use part of their annual leave for such purposes."
            },
            {
              "rule_number": "100230",
              "title": "Leave On Compassionate Ground",
              "content": "An officer may be allowed special leave from duty on full pay on compassionate ground for a period up to two weeks for burial of spouse/child/parents/parents of spouse."
            },
            {
              "rule_number": "100231",
              "title": "Leave Of Absence",
              "content": "Leave of Absence is absence of an officer from duty authorized on grounds of public policy. All such leave shall be approved by the Head of Civil Service of the Federation, on the recommendation of the Permanent Secretary or Head of Ministerial Office."
            },
            {
              "rule_number": "100232",
              "title": "Types Of Absence",
              "content": "The various types of leave of absence are: (a) Leave of Absence to join spouse on course of instruction of not less than 9 months duration abroad. (b) Special Leave of Absence to join spouse on grounds of Public Policy. (c) Leave of Absence on grounds of Public Policy for Technical Aid Programme. (d) Leave of Absence for Special/Personal Assistant on grounds of Public Policy. (e) Leave of Absence for spouse of Presidents, Vice Presidents, Governors, Deputy Governors, on grounds of Public Policy"
            },
            {
              "rule_number": "100233",
              "title": "Leave Of Absence To Join Spouse On Course Of Instruction Abroad",
              "content": "An officer who is also a public servant shall be permitted to join his/her spouse proceeding abroad on a course of instruction. The officer is eligible for free passage at Government expense where the course of instruction is not less than nine(9) months"
            },
            {
              "rule_number": "100234",
              "title": "Special Leave Of Absence To Join Spouse On Grounds Of Public Policy",
              "content": "On grounds of public policy, the spouse of a serving officer may be granted without pay for a period not exceeding five years to enable him/her join his/her spouse on posting abroad on the following conditions: (a) that the officer's spouse be disallowed from taking up gainful employment; (b) that such leave be not regarded as break in service; (c) where such spouses improve themselves by acquiring additional qualifications, which will enhance their usefulness to the service, they shall be considered for advancement in consonance with the prevailing regulations; (d) the period a spouse can be on leave of absence shall be four years in the first instance and subject to an extension of not more than one year."
            },
            {
              "rule_number": "100235",
              "title": "Leave Of Absence for Technical Aid Corps Programme",
              "content": "A number of civil servants may be selected for the Technical Aid Corps Programme by the Ministry of Foreign Affairs. In order to preserve the terminal benefits of the officers so selected and ensure the continuity of their service, such officers shall be granted leave of absence on grounds of Public Policy."
            },
            {
              "rule_number": "100236",
              "title": "Leave Of Absence for Special Or Personal Assistants",
              "content": "Appointees of Federal Public Service who accept appointment as Special or Personal Assistants are required to apply to the Head of the Civil Service of the Federation for leave of absence on grounds of Public Policy if they intend to return to the service at the end of the assignment."
            },
            {
              "rule_number": "100237",
              "title": "Leave Of Absence for Spouses Of President, Vice President Governors and Deputy Governors",
              "content": "The spouses of the President, Vice President, Governors, Deputy Governors who are public servants are required to apply to the Head of the Civil Service of the Federation for leave of absence on grounds of Public Policy to join their spouses during their tenure of office."
            },
            {
              "rule_number": "100238",
              "title": "Three Months Pre-Retirement Leave",
              "content": "Officers are required to give three months notice to retire from service before the effective date of retirement. At the commencement of three months, officers should proceed immediately on the mandatory one-month pre-retirement workshop/seminar."
            },
            {
              "rule_number": "100239",
              "title": "Leave On Permanent Invalidation",
              "content": "When a Medical Board recommends that an officer is medically unfit to continue in service and for that reason be disengaged, he/she will forthwith commence vacation leave prior to retirement."
            },
            {
              "rule_number": "100240",
              "title": "Overstaying Leave",
              "content": "An officer who without an acceptable excuse fails to resume duty on the approved date after vacation leave will be regarded as absent without leave and without pay. The period of absence may not be set against any future leave."
            },
            {
              "rule_number": "100241",
              "title": "Dismissal",
              "content": "Officers who are dismissed shall not be entitled to any form of leave."
            },
            {
              "rule_number": "100242",
              "title": "Leave to be on Calendar Days",
              "content": "Annual vacation leave shall be based on calendar days only."
            },
            {
              "rule_number": "100243",
              "title": "Leave Inclusive of Saturdays, Sundays and Public Holidays",
              "content": "The period of any other leave such as casual leave, sick leave, maternity leave etc. granted under these rules shall be inclusive of Saturdays, Sundays and Public Holidays occurring therein."
            }
          ]
        }
      ]
    },
    {
      "chapter_number": 11,
      "title": "FREE TRANSPORT FACILITIES WITHIN NIGERIA",
      "sections": [
        {
          "section_number": 1,
          "title": "DEFINITIONS AND GENERAL",
          "rules": [
            {
              "rule_number": "110101",
              "title": "Definitions",
              "content": "In this Chapter the following terms are used with the meaning defined in this Rule: END OF TOUR, NIGERIAN DESTINATION, OVERSEAS LEAVE, RESUMPTION/ASSUMPTION OF DUTY, VACATION LEAVE. 'Cheaper point' means a place which may be substituted for an officer's Nigerian home place as the starting point or destination of a journey at Government expense."
            },
            {
              "rule_number": "110102",
              "title": "GENERAL ECONOMY IN USE OF TRANSPORT",
              "content": "The necessity for any journey at Government expense should be fully established before the use of transport at Government expense is authorized."
            },
            {
              "rule_number": "110103",
              "title": "Choice of route",
              "content": "(a) The transport and route authorized for a journey at Government expense must be determined by the cost and exigency of duty. (b) Air transport may only be used on journeys which justify its use."
            },
            {
              "rule_number": "110104",
              "title": "Authority for use of transport",
              "content": "Authority for the use of transport facilities at Government expense shall be given in writing by Permanent Secretaries/Heads of Extra-Ministerial Offices or their authorized representatives in accordance with the provisions of Financial Regulations."
            },
            {
              "rule_number": "110105",
              "title": "Must be specific and not exceed approved scales",
              "content": "The free transport facility ' authorized must not exceed that for which provision is made in these Public Services Rules. If an officer wishes to avail himself of transport facilities in excess of those provided by the Public Service Rules, or facilities not provided by the Rules, he must pay for such facilities himself in advance."
            },
            {
              "rule_number": "110106",
              "title": "Free transport facilities not transferable",
              "content": "Any officer who utilizes any part of the free transport facilities provided under these Public Service Rules for a purpose other than that for which it is authorized or who, having received a cash payment in advance to defray the cost of such facilities, fails to refund on demand any part thereof not used to defray the cost of the specific facility for which he received it, is guilty of gross misconduct."
            },
            {
              "rule_number": "110107",
              "title": "Transport of Orderlies or Personal Attendants",
              "content": "No staff may travel at Government expense in the capacity of Orderly or personal attendants to another officer unless the employment of such person has been authorized by the Office of Establishments and Management Services."
            }
          ]
        },
        {
          "section_number": 2,
          "title": "FREE TRANSPORT FACILITIES AVAILABLE",
          "rules": [
            {
              "rule_number": "110201",
              "title": "General",
              "content": "Subject to Rules 110102 and 110103, the free transport facilities for which officers are eligible are in respect of all journeys in Nigeria. Such journeys would entail the following: (a) the family passenger fare allowances are for one spouse and four children; (b) the baggage allowance includes and is not additional to the tariff baggage allowances of a passenger ticket holder."
            },
            {
              "rule_number": "110202",
              "title": "Duty journeys",
              "content": "For the purpose of the transport facilities specified in rule 110204 the following types of journeys will be regarded as being on duty: (a) all journeys undertaken in the course of an officer's duty on specific instructions; (b) journeys to obtain dental treatment; (c) journeys to consult a medical officer; (d) journeys to obtain hospital treatment; (e) journeys undertaken by spouse and children of an officer to obtain dental or hospital treatment; (f) health trips."
            },
            {
              "rule_number": "110203",
              "title": "Journeys to new station",
              "content": "For the purpose of these Rules journeys to new stations will be deemed to include: (a) Journeys undertaken when assuming duty on first appointment; (b) journeys undertaken when proceeding on retirement or for the purpose of repatriating the family and personal effects of deceased officers."
            },
            {
              "rule_number": "110204",
              "title": "Free transport facilities available for duty journeys",
              "content": "For journeys specified in Rule 110202, the following free transport facilities are available: (a) For journeys by air: tickets for the officer, one spouse and four children by the following class of travel: (i) Business Class for Permanent Secretaries, Ministers and above; (ii) Economy Class for officers on GL.07-17; (iii) Economy class for spouse and four children when travelling with the officer. (b) For journeys by Road or River Transport: Officers on GL.06 and below; either tickets or cash in lieu of tickets at rates laid down from time to time."
            },
            {
              "rule_number": "110205",
              "title": "Transport of Motor Vehicle and Auto Cycle for Repair",
              "content": "An officer, serving at a station where adequate motor repair facilities are not available, for whom a motor vehicle is necessary for the proper performance of the duties of his/her office, may be allowed, on the authority of his/her Permanent Secretary/Head of Extra-Ministerial Office, free transport for its motor vehicle or part thereof and from the nearest place where such facilities exist, for the purpose of effecting necessary repairs."
            },
            {
              "rule_number": "110206",
              "title": "Free transport for Motor Vehicles and Motor/Auto Cycle",
              "content": "Subject to the principles laid down in Rule 110102, free transport by train or boat for an officer's own motor vehicle may be granted by a Permanent Secretary/Head of Extra-Ministerial Office when an officer is purchasing a new vehicle. When an officer is assuming duty or is travelling on transfer, or on tour, or duty, free transport of his motor vehicle may be allowed by Government if the Permanent Secretary/Head of Extra-Ministerial Office is satisfied that: (a) the vehicle is necessary for the duty; and (b) the transport of the vehicle is connected with the most economical means of transporting the officer while performing the duty."
            }
          ]
        },
        {
          "section_number": 3,
          "title": "MISCELLANEOUS RULES REGARDING FREE TRANSPORT FACILITIES",
          "rules": [
            {
              "rule_number": "110301",
              "title": "Extra Equipment",
              "content": "When an officer requires to take with him loads which are necessary for the efficient performance of his/her duties(e.g. office equipment, survey instruments, tents, etc.) he/she may do so at the discretion of his Permanent Secretary/Head of Extra-Ministerial Office."
            },
            {
              "rule_number": "110302",
              "title": "Official documents etc by air",
              "content": "When it is necessary for the efficient performance of his/her duties, an officer travelling on duty by air may take with him/her at Government expense official documents, papers and office necessities up to maximum of 10 kilograms in addition to the tariff baggage allowances included in his/her passenger ticket."
            },
            {
              "rule_number": "110303",
              "title": "Use of Government transport from house to airport, motor parks, etc.",
              "content": "When proceeding on transfer an officer may be provided with free Government transport in his/her station between his/her house and airport, sea-port or motor park and vice versa on his arrival at his/her new station. Where Government transport cannot be provided, the officer may be reimbursed at rates approved by the appropriate authorities."
            }
          ]
        }
      ]
    },
    {
      "chapter_number": 12,
      "title": "COURSES OF INSTRUCTION WITHIN AND OUTSIDE NIGERIA",
      "sections": [
        {
          "section_number": 1,
          "title": "GENERAL",
          "rules": [
            {
              "rule_number": "120101",
              "title": "Application",
              "content": "This Chapter applies to occasions on which officers are required with prior approval of Government: (a) to undertake special duty abroad; (b) to discharge official duties during vacation leave abroad; (c) to be on a delegation or visit to an organization abroad for a short period; (d) to undertake course of instruction abroad including attachment to an organization abroad. In such an event, the officer shall be eligible for appropriate estacode allowance at the prevailing rates."
            },
            {
              "rule_number": "120102",
              "title": "Procedure/Obtaining approval",
              "content": "(i) Overseas duty tour by all Public servants and estacode allowance payable shall be subject to the approval of the Head of the Civil Service of the Federation on the recommendation of the Permanent Secretary/Head of Extra-Ministerial Office. (ii) Before an officer on leave outside Nigeria undertakes official visit, prior approval of the Head of the Civil Service of the Federation shall be obtained."
            },
            {
              "rule_number": "120103",
              "title": "Briefing of officer",
              "content": "An officer required to undertake duties or a course of instruction outside Nigeria must be furnished by his Permanent Secretary/Head of Extra-Ministerial Office with detailed instructions regarding such duties or course and be informed in advance and in writing of the allowances and travelling facilities for which he/she will be eligible at Government expense in connection therewith."
            },
            {
              "rule_number": "120104",
              "title": "Special Duty Visit: Effect On Leave",
              "content": "Where an officer is required during his/her vacation leave to undertake any duty, the period of duty will be leave-earning and not leave consuming. A period of duty outside Nigeria during an officer's tour will be regarded as part of his tour."
            },
            {
              "rule_number": "120105",
              "title": "Course of Instruction",
              "content": "The normal effect on the amount of leave due to an officer of his attending a course of instruction during his vacation leave is specified in Rule 100103."
            }
          ]
        },
        {
          "section_number": 2,
          "title": "DUTY VISITS OUTSIDE NIGERIA",
          "rules": [
            {
              "rule_number": "120201",
              "title": "Duty Visit Outside Nigeria",
              "content": "An officer on duty visit outside Nigeria shall be granted the following: (a) Passages: Air passage for himself only, but where the duration of an officer's duties is not less than 9 months, his wife may accompany him at Government expense. (b) Transport Reimbursement of actual expenditure or transport essential to the business of the visit."
            },
            {
              "rule_number": "120202",
              "title": "Discharging Duty During Vacation Leave",
              "content": "An officer who, with prior approval of Government, discharges official duties during vacation leave outside Nigeria and who is obliged to take accommodation away from his/her normal place of residence or home, will be treated as proceeding to such a destination on duty visit and will be eligible for duty allowance abroad."
            },
            {
              "rule_number": "120203",
              "title": "Refund of Daily Travelling Expenses Abroad",
              "content": "An officer for whom accommodation is provided and who, with the prior approval of Government, discharges official duties during his/her vacation leave outside Nigeria is eligible for a refund of daily travelling expenses necessarily incurred in the discharge of such duties plus a daily subsistence allowance at the appropriate rate."
            }
          ]
        },
        {
          "section_number": 3,
          "title": "COURSES OF INSTRUCTION OUTSIDE AND WITHIN NIGERIA",
          "rules": [
            {
              "rule_number": "120301",
              "title": "Condition",
              "content": "An officer who is permitted to attend a course of instruction is eligible for the benefits set out in this Section provided that he/she has signed an agreement to refund to Government all expenses connected therewith if he: (a) does not obtain a certificate of satisfactory attendance at the course, or (b) does not return to Nigeria; or (c) undertakes any other course of instruction without the specific approval of the Government, or resigns from service within a period of three years of his completing such a course."
            },
            {
              "rule_number": "120302",
              "title": "Passage",
              "content": "A senior officer sent overseas on a course of instruction will be eligible for free air passage for himself/herself only; but where the duration of the course of instruction is not less than nine months, his/her spouse may accompany him/her at Government expense."
            },
            {
              "rule_number": "120303",
              "title": "Courses with Rates",
              "content": "Special rates of allowance, etc. are prescribed from time to time for certain courses of instruction, and they apply to all officers attending the course in question."
            },
            {
              "rule_number": "120304",
              "title": "Courses Sponsored by Donor Agencies/Countries",
              "content": "Officers who with the prior approval of Government attend courses of instruction(other than one to which Rule 120303 applies) are entitled to be paid the difference between their normal estacode allowance and the allowance/facilities offered by the donor country where the latter is lower than the official estacode allowance."
            },
            {
              "rule_number": "120305",
              "title": "Overseas Employment During Training Courses",
              "content": "An officer undergoing a training course overseas who receives a salary from an employer in the overseas country will not be eligible for any emolument or allowance from the Federal Government except as may be specifically approved by the Permanent Secretary, Office of Establishments and Pension."
            },
            {
              "rule_number": "120306",
              "title": "Courses Within Nigeria",
              "content": "Course of instruction within Nigeria is a course which an officer takes locally but outside his/her station at any Federal Training Centre, University or approved Public Service training institution."
            },
            {
              "rule_number": "120307",
              "title": "Interruption of Training Courses",
              "content": "A female officer who is about to undertake a course of training of not more than six months duration shall be called upon to enter into an agreement to refund the whole or part of the cost of the course in the event of her course being interrupted on grounds of pregnancy."
            },
            {
              "rule_number": "120308",
              "title": "Externally Assisted Courses",
              "content": "Where training facilities under a foreign Government's technical assistance scheme is required, all application forms for the nominations of candidates will be forwarded to the National Planning Commission for processing."
            },
            {
              "rule_number": "120309",
              "title": "Courses Under Technical Assistance",
              "content": "Officers attending courses of instruction under a technical assistance scheme will continue to receive their emoluments while all other conditions of service will be decided in accordance with the existing arrangements between the donor government and the Federal Government."
            },
            {
              "rule_number": "120310",
              "title": "Certain Courses to be Granted as Leave Without Pay",
              "content": "Where an officer is permitted on the recommendation of his/her Permanent Secretary/Head of Extra-Ministerial Office to take a course of instruction at the officer's own request, special conditions may be imposed. These conditions will be decided by the Office of Establishments and Pension and may include the grant of leave without pay and the withdrawal of all or any of the allowances or other privileges prescribed in this Chapter."
            },
            {
              "rule_number": "120311",
              "title": "Post Graduate Courses",
              "content": "For postgraduate courses, in exceptional cases, officers shall be granted study leave with pay subject to a maximum of two years. However, officers engaged in private studies for higher degrees shall not be hindered provided their studies do not interfere with official duties."
            }
          ]
        }
      ]
    },
    {
      "chapter_number": 13,
      "title": "ALLOWANCES",
      "sections": [
        {
          "section_number": 1,
          "title": "ALLOWANCES",
          "rules": [
            {
              "rule_number": "130101",
              "title": "Definition/Allowances subject to periodic review/Resettlement allowance",
              "content": "(a) An allowance is a monetary benefit other than salary granted to an officer for a specific purpose. (b) All Allowances provided for in this Chapter shall be subject to periodic review by the National Salaries, Incomes and Wages Commission. (c) Resettlement Allowance previously known as Disturbance allowance should not be paid or treated as an emolument. It shall only be paid where an officer is posted or transferred in a circumstance that is established or confirmed that his/her living condition has been disturbed."
            },
            {
              "rule_number": "130102",
              "title": "Types of Allowances",
              "content": "The following allowances are payable to officers in the Federal Public Service: (a) Kilometres Allowance; (b) Disengagement Allowance; (c) Hotel Accommodation Allowance; (d) Duty Tour Allowance; (e) Transport and Local Running Allowance; (f) Estacode Allowance; (g) Estacode Supplementation Allowance; (h) Warm Clothing Allowance; (i) Local Course Allowance; (j) Books Allowance; (k) Projects Allowance; (l) Responsibility Allowance; (m) Overtime Allowance; (n) Uniform Allowance; (o) Call Duty Allowance (p) Acting Allowance; (q) Resettlement Allowance; (r) Teaching Allowance."
            },
            {
              "rule_number": "130103",
              "title": "Kilometer allowance",
              "content": "Kilometre allowance shall be paid to newly appointed officers reporting to their duty station; retiring officers from duty; officers undertaking responsibility using their cars and on transfer or posting at the rates specified in their extant circular."
            },
            {
              "rule_number": "130104",
              "title": "Disengagement allowance",
              "content": "Disengagement allowance shall be paid to an officer proceeding on retirement from service at uniform rates of 5% of annual basic emolument plus authorized allowance as stated in Rule 130103."
            },
            {
              "rule_number": "130105",
              "title": "Hotel accommodation allowances for newly appointed/newly posted officers",
              "content": "Officers on posting, transfer or on assumption of duty on new appointment at their new station, different from their city/town of domicile shall be entitled to transport fare for self, spouse and a maximum of four children. In addition, they shall be eligible for hotel accommodation for the first 28 days or an allowance for the first 28 days in lieu of hotel accommodation."
            },
            {
              "rule_number": "130106",
              "title": "Duty tour allowance",
              "content": "Duty Tour Allowance is granted to enable officers pay for lodging and feeding expenses during official tours duly approved by the official authority. The rates applicable are as may be specified in the extant circular."
            },
            {
              "rule_number": "130107",
              "title": "Transport and local running",
              "content": "(a) All officers are entitled to airfare depending on the exigencies and with the approval of the Accounting Officer. (b) Transport allowance shall be paid to all officers when travelling to towns and cities where air transport services do not exist at the rates of N20.00 per kilometre. (c) For the purpose of local running, officers shall be granted 30% of their duty tour allowance in addition to airport taxi, at the prevailing rates."
            },
            {
              "rule_number": "130108",
              "title": "Estacode allowance",
              "content": "(a) Officers shall be eligible for estacode allowance subject to the approval of the Head of the Civil Service of the Federation. (b) Estacode allowance shall be payable at the rates specified in the extant circular. (c) Where a Minister, SGF, HOS, Perm See or DG who is on official assignment, outside the country decides that the Ministry should arrange for his/her accommodation and feeding, he/she shall be paid 25% of the entitled estacode allowance."
            },
            {
              "rule_number": "130109",
              "title": "Entertainment on duty visit outside Nigeria",
              "content": "An officer on duty visit outside Nigeria shall be granted: (a) Air passage for himself/herself only; but where the duration of the officer's duty is not less than 9 months, his/her spouse may accompany him/her at public expense; (b) Reimbursement of actual expenditure or transport essential to the business of the visit; and (c) Estacode Allowance."
            },
            {
              "rule_number": "130110",
              "title": "Estacode Supplementation Allowance",
              "content": "Where the cost of accommodation or hotel expenses of an officer travelling abroad is met by the host Government or institution, such officer shall be entitled to estacode supplementation allowance at specified rates depending on the level of support provided by the host."
            },
            {
              "rule_number": "130111",
              "title": "Travelling Days",
              "content": "For journeys outside Nigeria, the following travelling days shall apply: (a) For African Countries 2 days(to and fro) (b) For European Countries 2 days(to and fro) (c) Asia and American Countries- 4 days(to and fro)"
            },
            {
              "rule_number": "130112",
              "title": "Warm Clothing Allowance",
              "content": "(a) An officer who is required by Government to proceed to a foreign country on duty or on an approved course of instruction will be eligible for a warm clothing allowance. (b) The allowance is not payable under certain conditions including if the duty/course is undertaken during normal vacation leave in a cold climate country."
            },
            {
              "rule_number": "130113",
              "title": "Local course allowance",
              "content": "(a) Local Course of instruction is: a course which an officer takes locally in Nigeria but outside his/her station. (b) An officer attending a local course of institution at any Federal Training Centre, University or other approved Public Service Training Institutions is eligible for Training Allowance at specified rates."
            },
            {
              "rule_number": "130114",
              "title": "Book Allowance",
              "content": "Books/Project Allowance for Officers attending various courses at the Federal Training Centres, Treasury Schools, Universities and other approved Institutions in Nigeria shall be paid at the rates specified in the extant circular."
            },
            {
              "rule_number": "130115",
              "title": "Responsibility Allowance",
              "content": "The approved rates of responsibility allowance are payable to Chief Confidential Secretaries, Assistant Chief Confidential Secretaries, Confidential Secretaries and Typists attached to specified high-ranking officials at rates specified in extant circulars."
            },
            {
              "rule_number": "130116",
              "title": "Overtime",
              "content": "Overtime is the additional time spent outside the approved time of work."
            },
            {
              "rule_number": "130117",
              "title": "Entitled officers",
              "content": "Overtime Allowance shall be paid to officers on GL.14 and below."
            },
            {
              "rule_number": "130118",
              "title": "Authority for Overtime",
              "content": "Overtime shall only be authorized and approved by the Accounting Officer/Chief Executive of the Ministry/Extra Ministerial Office on the recommendation of the Director."
            },
            {
              "rule_number": "130119",
              "title": "Normal Approved Working Time",
              "content": "For the purpose of computing overtime, the normal approved working time per week shall be from 8.00 a.m. to 4.00 p.m. from Monday to Friday. This excludes Saturdays, Sundays and public holidays."
            },
            {
              "rule_number": "130120",
              "title": "Payment of Overtime",
              "content": "Payment of Overtime shall be made for time worked in excess of the normal working hours."
            },
            {
              "rule_number": "130121",
              "title": "Circumstances in which Officers can Work Overtime",
              "content": "The circumstances in which officers can work overtime are as follows: (a) Officers attached to Top Management/Officials; (b) On special assignments, e.g. Conferences, Committees, etc.; (c) Period of budgetary preparations; (d) Period of closing of annual accounts; (e) Any other assignment as may be approved by the Director and above."
            },
            {
              "rule_number": "130122",
              "title": "Limitation of Total Monthly Overtime",
              "content": "No officer qualified for overtime payments shall work overtime in excess of 45 hours in any month unless this is authorized in special circumstances by the Accounting Officer/Chief Executive."
            },
            {
              "rule_number": "130123",
              "title": "Rate of Payment of Overtime",
              "content": "Payment for overtime on normal working days will be at the rate of 0.7% of the monthly consolidated salary subject to a maximum of 45 hours in one month and must be approved by the Accounting Officer/Chief Executive."
            },
            {
              "rule_number": "130124",
              "title": "Work Free Days",
              "content": "A 'work-free day' means the working day on which public holiday falls."
            },
            {
              "rule_number": "130125",
              "title": "Payment for the time Worked/Done on Public Holiday",
              "content": "Time worked on work-free day will be paid at the rate of 1 of the normal Overtime rate; while on Public holidays, the rate shall double the normal overtime rate but must be approved by the Accounting Officer/Chief Executive."
            },
            {
              "rule_number": "130126",
              "title": "Effect of Acting Appointment",
              "content": "When an officer eligible for overtime payment is duly authorized as acting in a post which attracts overtime payment, he/she will be paid for overtime on his/her full acting emolument."
            },
            {
              "rule_number": "130127",
              "title": "Uniform Allowance",
              "content": "Uniform allowance at the rates specified in the extant circular is payable to senior officers in the following category: (a) Nursing and Midwifery Officers (b) Fire Officers"
            },
            {
              "rule_number": "130128",
              "title": "Acting Allowance",
              "content": "An officer duly authorized to act is eligible for acting allowance at the appropriate rate specified in rule 130129 and 130130 whichever is applicable from the gazetted date of commencement of his/her acting appointment to the date immediately preceding the gazetted date of termination thereof(both dates inclusive) except for any days in excess of 14 days of continuous absence from duty on account of ill health."
            },
            {
              "rule_number": "130129",
              "title": "Rate of Acting Allowance",
              "content": "When an officer has been recommended to act in a grade immediately higher than his/her own, he/she will be regarded as adequately performing the full duties of the higher post and shall be entitled to 100 per cent rate of acting allowance."
            },
            {
              "rule_number": "130130",
              "title": "Acting Appointment Allowance for Duties of more than One Office",
              "content": "If an officer is in receipt of a personal allowance in addition to the normal emoluments of his/her substantive office, such personal allowance will be treated as part of his/her substantive basic emolument for the purpose of calculating acting allowance."
            },
            {
              "rule_number": "130131",
              "title": "The Effect of Certain Special Recommendation on Acting Allowance",
              "content": "The substantive emolument of a contract officer or re-engaged pensioner will, for the purpose of calculating allowance in accordance with Rule 020411 be taken as the officer's actual emolument, less contract addition."
            },
            {
              "rule_number": "130132",
              "title": "Officers receiving Personal Allowance/Contract Officers and Re-engaged Pensioners'/Consolidated Emolument",
              "content": "Resettlement allowance is granted in compensation for out of pocket expenses not covered by other regulations, but which are incurred by the officers in the course of transfer as defined in Rule 130134."
            },
            {
              "rule_number": "130133",
              "title": "Furniture Allowance",
              "content": "Resettlement Allowance shall be paid at the rate of 2% of an Officer's annual emolument."
            },
            {
              "rule_number": "130134",
              "title": "Domestic Servants Allowance/Driver's Allowance",
              "content": "An officer whose transfer is at his own request shall be entitled to only transport allowance and not resettlement allowance."
            },
            {
              "rule_number": "130135",
              "title": "Resettlement allowance rate of payment",
              "content": "Resettlement Allowance shall be paid at the rate of 2% of an Officer's annual emolument."
            },
            {
              "rule_number": "130136",
              "title": "Not payable if transfer is at officer's own request",
              "content": "An officer whose transfer is at his own request shall be entitled to only transport allowance and not resettlement allowance."
            },
            {
              "rule_number": "130137",
              "title": "Part time teaching",
              "content": "The following rates of allowances are payable to those who teach on part time basis at the rates specified in the extant circular."
            },
            {
              "rule_number": "130138",
              "title": "Full time teaching allowance",
              "content": "Officers in the Professional, Administrative, Executive, Technological and allied cadres whose normal duties do not involve teaching but who are posted to full time-teaching in departments/training institutions and other organized institutions shall be paid an allowance of N 12,000.00 per annum during the period of such postings."
            },
            {
              "rule_number": "130139",
              "title": "House master/mistress allowance",
              "content": "A House Master/Mistress is eligible for a House Master/Mistress allowance at the rate specified in the extant circular."
            },
            {
              "rule_number": "130140",
              "title": "Science/Maths teaching allowance",
              "content": "Science/Mathematics Teachers are eligible for Science/Mathematics Teaching Allowance at the rate specified in the extant circular."
            },
            {
              "rule_number": "130141",
              "title": "Laboratory Attendants",
              "content": "Laboratory Attendants who in addition to their normal duties, are required to work with their evening class Section of the Institution shall be paid an allowance at a rate specified in the extant circular."
            }
          ]
        }
      ]
    },
    {
      "chapter_number": 14,
      "title": "INVENTIONS AWARDS COMMITTEE",
      "sections": [
        {
          "section_number": 1,
          "title": "INVENTIONS AND AWARDS COMMITTEE",
          "rules": [
            {
              "rule_number": "140101",
              "title": "Functions",
              "content": "There shall be constituted for the purposes of the Rules in this Chapter an Awards Committee which shall consist of a Judicial or Legal Officer appointed by the Head of Government as Chairman and such other persons as the Head of Government may from time to time appoint by notice in the gazette."
            },
            {
              "rule_number": "140102",
              "title": "Procedure",
              "content": "The functions of the Awards Committee shall be to make investigations and recommendations in connection with Rules 140108 and 140109."
            },
            {
              "rule_number": "140103",
              "title": "Provisional protection of inventions",
              "content": "The Awards Committee may make rules for regulating their proceedings, but no such rules shall come into force until they have been approved by the Head of Government. An officer shall be entitled to appear personally before an Awards Committee or be represented in such manner as the Awards Committee may approve."
            },
            {
              "rule_number": "140104",
              "title": "Provisional protection of inventions",
              "content": "An officer who has made an invention must immediately report it under Secret Cover to Government through his Permanent Secretary/Head of Extra-Ministerial Office. He may, at his own expense, and shall, at the expense of Government if so required, lodge an application for provisional protection with the Registrar of Patents and Designs."
            },
            {
              "rule_number": "140105",
              "title": "Government's opinion",
              "content": "As soon as practicable the Head of Government shall decide whether the officer shall or shall not be allowed controlling rights in the patent and his decision shall be communicated to the officer's Permanent Secretary/Head of Extra-Ministerial Office for the information of the officer."
            },
            {
              "rule_number": "140106",
              "title": "Rules applicable when the officer is allowed controlling rights",
              "content": "If the Head of Government decides that the officer shall be allowed controlling rights in the patent, the following provisions shall apply: (a) the officer shall be responsible for all expenditure in taking out the patent; (b) the Head of Government may attach to his decision such conditions as he may deem fit; (c) the officer may apply to the Awards Committee for an award in respect of his invention."
            },
            {
              "rule_number": "140107",
              "title": "Rules applicable when the officer is not Allowed controlling rights",
              "content": "If the Head of Government decides that the officer shall not be allowed controlling rights in the patents, the following provisions shall apply: (a) the officer shall assign all his rights in the invention to Government; (b) the Government shall be responsible for all expenditure in taking out the patent; (c) the Head of Government shall decide whether the officer shall or shall not be allowed a share of any commercial proceeds; (d) the officer may apply to the Awards Committee for an award in respect of his invention."
            },
            {
              "rule_number": "140108",
              "title": "Determination",
              "content": "The question whether an award shall be made, the amount thereof, and the amount of the share of commercial proceeds to be reserved to the Government under Rule 140106(b) or allowed to the officer under Rule 140107(c), shall be determined by the Head of Government after investigation by the Awards Committee."
            },
            {
              "rule_number": "140109",
              "title": "Modification",
              "content": "In the event of a material change taking place in the circumstances which existed at the time when the award or allocation of commercial proceeds was made, the original decision may be modified by the Head of Government after further investigation by the Awards Committee provided that, in any such modification of the original decision: the amount of an award which has been paid shall not be reduced."
            },
            {
              "rule_number": "140110",
              "title": "Secrecy",
              "content": "Nothing in this Chapter shall affect the duties and liabilities of any officer under the provision of Official Secrets Act(Cap, 335)."
            }
          ]
        }
      ]
    },
    {
      "chapter_number": 15,
      "title": "REWARD FOR OUTSTANDING WORK",
      "sections": [
        {
          "section_number": 1,
          "title": "REWARD FOR OUTSTANDING WORK",
          "rules": [
            {
              "rule_number": "150101",
              "title": "Definition",
              "content": "Reward in this Section refers to Ministerial award of gifts or certificates to deserving officers."
            },
            {
              "rule_number": "150102",
              "title": "Basis of Awards",
              "content": "The recipient of an award must have been considered as the best on the basis of outstanding performance of duties and exemplary conduct during the year."
            },
            {
              "rule_number": "150103",
              "title": "Frequency of Awards",
              "content": "Each Ministry or Extra-Ministerial Office may make such award to deserving officers annually."
            },
            {
              "rule_number": "150104",
              "title": "Nature of Awards",
              "content": "The award may be in the form of certificates, medals, gifts of cash or kind."
            },
            {
              "rule_number": "150105",
              "title": "Procedure for selection",
              "content": "The Permanent Secretary/Head of Extra-Ministerial Office shall be assisted by a committee in selecting deserving officers from nominations made by Heads of Departments/Divisions."
            },
            {
              "rule_number": "150106",
              "title": "Unique acts",
              "content": "Any officer who in the course of his official duties, carries out a unique act or, in perilous circumstances, secures the safety of human life or property may also be considered for an award as the occasion warrants."
            },
            {
              "rule_number": "150107",
              "title": "Certificate of Merit",
              "content": "An officer who has served continuously for a minimum of 15, 25, 35 years with good service record shall be eligible for a certificate of merit and award in kind commensurate with his length of service."
            }
          ]
        }
      ]
    },
    {
      "chapter_number": 16,
      "title": "APPLICATION OF PUBLIC SERVICE RULES TO FEDERAL GOVERNMENT PARASTATALS",
      "sections": [
        {
          "section_number": 1,
          "title": "GENERAL",
          "rules": [
            {
              "rule_number": "160101",
              "title": "Definitions",
              "content": "A Parastatal is a government-owned organization established by statute to render specified services(s) to the public. It is structured and operates according to the instrument establishing it and also comes under the policy directives of Government."
            },
            {
              "rule_number": "160102",
              "title": "Existing Rules/Conditions of Service",
              "content": "Parastatals shall be Classified into Four(4) categories as follows: Regulatory Agencies; (i) General Services; (ii) Infrastructure/ Utility Agencies; (iii) Security Agencies."
            },
            {
              "rule_number": "160103",
              "title": "Existing Rules/Conditions of Service",
              "content": "Parastatals are to retain and improve existing rules, procedures and practices in their establishments and ensure that there are no deviations from the general principles contained in the Public Service Rules. However in the absence of internal rules and regulations on any matter, the relevant provisions of the Public Service Rules shall apply."
            }
          ]
        },
        {
          "section_number": 2,
          "title": "BOARDS/COUNCIL MATTERS",
          "rules": [
            {
              "rule_number": "160201",
              "title": "Functions of Boards/Council",
              "content": "(a) Statutory Boards/ Councils shall set operational and administrative policies in accordance with government policy directives and supervises the implementation of such policies. The administrative policies may include those relating to appointment, promotion and discipline of staff. (b) A Board shall not be involved directly in the day-to-day management of a Parastatal. (c) A Minister exercise control of Parastatals at policy level through the Board of the Parastatal only."
            },
            {
              "rule_number": "160202",
              "title": "Privileges of Members of Board",
              "content": "Accommodation shall not be provided to any Part-Time Member of a Board on a permanent basis. No part time Member of the Board shall be allowed to retain official vehicle for use on a permanent basis."
            }
          ]
        },
        {
          "section_number": 3,
          "title": "APPOINTMENT AND PROMOTION",
          "rules": [
            {
              "rule_number": "160301",
              "title": "Authority for Appointment",
              "content": "All appointments to public offices, both senior and junior, in Federal Government Parastatals shall be made on the authority of the Boards/Councils within the approved manning levels."
            },
            {
              "rule_number": "160302",
              "title": "Appointment",
              "content": "Appointment into all grades in Parastatals shall be need-based and subject to the approval of the supervisory Boards/Councils. Such appointments shall be made through a fair and open selection process that ensures merit, credibility and equal employment opportunity for all with due regard to the Federal Character principle."
            },
            {
              "rule_number": "160303",
              "title": "Authority to Approve Promotion",
              "content": "The Board/Council of a Parastatal shall approve all promotions without prejudice to its powers to delegate."
            },
            {
              "rule_number": "160304",
              "title": "Eligibility for Promotion",
              "content": "The provisions of PSR 020701(b) and(c) on eligibility for promotion shall apply to all Parastatals, without prejudice to a Parastatal's conditions of service."
            }
          ]
        },
        {
          "section_number": 4,
          "title": "LEAVING THE SERVICE",
          "rules": [
            {
              "rule_number": "160401",
              "title": "Leaving the Service",
              "content": "(a) The provisions of Section, 8 in Chapter 2 of the Public Service Rules on leaving the service shall apply to all Parastatals, as contained in each Parastatal's conditions of service. (b) All such Conditions of Service for Parastatals shall be approved by their respective Boards and ratified by the Head of Civil Service of the Federation."
            }
          ]
        },
        {
          "section_number": 5,
          "title": "DISCIPLINE",
          "rules": [
            {
              "rule_number": "160501",
              "title": "Authority for Discipline",
              "content": "The power to exercise disciplinary control over officers in Parastatals is vested in the supervisory Boards/ Councils in accordance with their respective conditions of service."
            },
            {
              "rule_number": "160502",
              "title": "General Application",
              "content": "The provisions of Sections 2 to 6 in Chapter 3 of the Public Service Rules shall guide all Parastatals in addressing disciplinary matters provided that where reference to the Federal Civil Service Commission, Head of the Civil Service of the Federation or the Permanent Secretary, the Board/Councils shall perform such functions."
            },
            {
              "rule_number": "160503",
              "title": "Application to the paramilitary",
              "content": "In the case of paramilitary services, the disciplinary procedures adopted in their respective services shall also apply."
            }
          ]
        },
        {
          "section_number": 6,
          "title": "PETITIONS AND APPEALS",
          "rules": [
            {
              "rule_number": "160601",
              "title": "Petition to Head of Government",
              "content": "In consonance with Chapter 9 Section 2 of the Public Service Rules an officer of a Parastatal who wishes to make a representation to the Head of Government shall route such representation through the proper Departmental channels, namely: the petitioner's superior Officer; the Chief Executive Officer; the Board/Council and the supervising Ministry of the organization."
            }
          ]
        }
      ]
    }

    

  ]
}
